pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the CC field to a new value. */
#define AFE_WR_CFR_CC(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_CC_MASK) | AFE_CFR_CC(value)))
#define AFE_BWR_CFR_CC(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_CC_SHIFT), AFE_CFR_CC_SHIFT, AFE_CFR_CC_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field DEC_EN[13] (RW)
 *
 * This is used to enable decimation filter.
 *
 * Values:
 * - 0 - Decimation filter is disabled.
 * - 1 - Decimation filter is enabled.
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_DEC_EN field. */
#define AFE_RD_CFR_DEC_EN(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_DEC_EN_MASK) >> AFE_CFR_DEC_EN_SHIFT)
#define AFE_BRD_CFR_DEC_EN(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_DEC_EN_SHIFT, AFE_CFR_DEC_EN_WIDTH))

/*! @brief Set the DEC_EN field to a new value. */
#define AFE_WR_CFR_DEC_EN(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_DEC_EN_MASK) | AFE_CFR_DEC_EN(value)))
#define AFE_BWR_CFR_DEC_EN(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_DEC_EN_SHIFT), AFE_CFR_DEC_EN_SHIFT, AFE_CFR_DEC_EN_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field SD_MOD_EN[14] (RW)
 *
 * This is used to enable SD ADC1 .
 *
 * Values:
 * - 0 - SD ADC1 is disabled
 * - 1 - SD ADC1 is enabled
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_SD_MOD_EN field. */
#define AFE_RD_CFR_SD_MOD_EN(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_SD_MOD_EN_MASK) >> AFE_CFR_SD_MOD_EN_SHIFT)
#define AFE_BRD_CFR_SD_MOD_EN(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_SD_MOD_EN_SHIFT, AFE_CFR_SD_MOD_EN_WIDTH))

/*! @brief Set the SD_MOD_EN field to a new value. */
#define AFE_WR_CFR_SD_MOD_EN(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_SD_MOD_EN_MASK) | AFE_CFR_SD_MOD_EN(value)))
#define AFE_BWR_CFR_SD_MOD_EN(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_SD_MOD_EN_SHIFT), AFE_CFR_SD_MOD_EN_SHIFT, AFE_CFR_SD_MOD_EN_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field BYP_MODE[17] (RW)
 *
 * This field is used to disable internal modulators of the appropriate channel.
 * External modulators will be used.
 *
 * Values:
 * - 0 - Normal mode
 * - 1 - Bypass mode where ADC and PGA of the appropriate channel are disabled.
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_BYP_MODE field. */
#define AFE_RD_CFR_BYP_MODE(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_BYP_MODE_MASK) >> AFE_CFR_BYP_MODE_SHIFT)
#define AFE_BRD_CFR_BYP_MODE(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_BYP_MODE_SHIFT, AFE_CFR_BYP_MODE_WIDTH))

/*! @brief Set the BYP_MODE field to a new value. */
#define AFE_WR_CFR_BYP_MODE(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_BYP_MODE_MASK) | AFE_CFR_BYP_MODE(value)))
#define AFE_BWR_CFR_BYP_MODE(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_BYP_MODE_SHIFT), AFE_CFR_BYP_MODE_SHIFT, AFE_CFR_BYP_MODE_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field PGA_GAIN_SEL[21:19] (RW)
 *
 * This field selects the analog gain applied to the input signal.
 *
 * Values:
 * - 000 - reserved
 * - 001 - 1x (default)
 * - 010 - 2x
 * - 011 - 4x
 * - 100 - 8x
 * - 101 - 16x
 * - 110 - 32x
 * - 111 - reserved
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_PGA_GAIN_SEL field. */
#define AFE_RD_CFR_PGA_GAIN_SEL(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_PGA_GAIN_SEL_MASK) >> AFE_CFR_PGA_GAIN_SEL_SHIFT)
#define AFE_BRD_CFR_PGA_GAIN_SEL(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_PGA_GAIN_SEL_SHIFT, AFE_CFR_PGA_GAIN_SEL_WIDTH))

/*! @brief Set the PGA_GAIN_SEL field to a new value. */
#define AFE_WR_CFR_PGA_GAIN_SEL(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_PGA_GAIN_SEL_MASK) | AFE_CFR_PGA_GAIN_SEL(value)))
#define AFE_BWR_CFR_PGA_GAIN_SEL(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_PGA_GAIN_SEL_SHIFT), AFE_CFR_PGA_GAIN_SEL_SHIFT, AFE_CFR_PGA_GAIN_SEL_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field PGA_EN[24] (RW)
 *
 * It enables the PGA gain stage.
 *
 * Values:
 * - 0 - PGA disabled
 * - 1 - PGA enabled
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_PGA_EN field. */
#define AFE_RD_CFR_PGA_EN(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_PGA_EN_MASK) >> AFE_CFR_PGA_EN_SHIFT)
#define AFE_BRD_CFR_PGA_EN(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_PGA_EN_SHIFT, AFE_CFR_PGA_EN_WIDTH))

/*! @brief Set the PGA_EN field to a new value. */
#define AFE_WR_CFR_PGA_EN(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_PGA_EN_MASK) | AFE_CFR_PGA_EN(value)))
#define AFE_BWR_CFR_PGA_EN(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_PGA_EN_SHIFT), AFE_CFR_PGA_EN_SHIFT, AFE_CFR_PGA_EN_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CFR, field DEC_OSR[31:29] (RW)
 *
 * This field selects the oversampling ratio. It should not be modified while
 * the filter is operating. The Sinc filter output is scaled based on the OSR to
 * produce a 24 bit signed, two's complement output..
 *
 * Values:
 * - 000 - 64
 * - 001 - 128
 * - 010 - 256
 * - 011 - 512
 * - 100 - 1024
 * - 101 - 2048
 */
/*@{*/
/*! @brief Read current value of the AFE_CFR_DEC_OSR field. */
#define AFE_RD_CFR_DEC_OSR(base, index) ((AFE_CFR_REG(base, index) & AFE_CFR_DEC_OSR_MASK) >> AFE_CFR_DEC_OSR_SHIFT)
#define AFE_BRD_CFR_DEC_OSR(base, index) (BME_UBFX32(&AFE_CFR_REG(base, index), AFE_CFR_DEC_OSR_SHIFT, AFE_CFR_DEC_OSR_WIDTH))

/*! @brief Set the DEC_OSR field to a new value. */
#define AFE_WR_CFR_DEC_OSR(base, index, value) (AFE_WR_CFR(base, index, (AFE_RD_CFR(base, index) & ~AFE_CFR_DEC_OSR_MASK) | AFE_CFR_DEC_OSR(value)))
#define AFE_BWR_CFR_DEC_OSR(base, index, value) (BME_BFI32(&AFE_CFR_REG(base, index), ((uint32_t)(value) << AFE_CFR_DEC_OSR_SHIFT), AFE_CFR_DEC_OSR_SHIFT, AFE_CFR_DEC_OSR_WIDTH))
/*@}*/

