pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * AFE_CR - Control Register
 ******************************************************************************/

/*!
 * @brief AFE_CR - Control Register (RW)
 *
 * Reset value: 0x0040FA00U
 *
 * AFE Control Register has fields to control the global features of all
 * channels of AFE.
 */
/*!
 * @name Constants and macros for entire AFE_CR register
 */
/*@{*/
#define AFE_RD_CR(base)          (AFE_CR_REG(base))
#define AFE_WR_CR(base, value)   (AFE_CR_REG(base) = (value))
#define AFE_SET_CR(base, value)  (BME_OR32(&AFE_CR_REG(base), (uint32_t)(value)))
#define AFE_CLR_CR(base, value)  (BME_AND32(&AFE_CR_REG(base), (uint32_t)(~(value))))
#define AFE_TOG_CR(base, value)  (BME_XOR32(&AFE_CR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AFE_CR bitfields
 */

/*!
 * @name Register AFE_CR, field STRTUP_CNT[15:9] (RW)
 *
 * This field is used to program the start up delay of modulators. Minimum value
 * is two. if set less than that it would be converted to two.
 */
/*@{*/
/*! @brief Read current value of the AFE_CR_STRTUP_CNT field. */
#define AFE_RD_CR_STRTUP_CNT(base) ((AFE_CR_REG(base) & AFE_CR_STRTUP_CNT_MASK) >> AFE_CR_STRTUP_CNT_SHIFT)
#define AFE_BRD_CR_STRTUP_CNT(base) (BME_UBFX32(&AFE_CR_REG(base), AFE_CR_STRTUP_CNT_SHIFT, AFE_CR_STRTUP_CNT_WIDTH))

/*! @brief Set the STRTUP_CNT field to a new value. */
#define AFE_WR_CR_STRTUP_CNT(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_STRTUP_CNT_MASK) | AFE_CR_STRTUP_CNT(value)))
#define AFE_BWR_CR_STRTUP_CNT(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_STRTUP_CNT_SHIFT), AFE_CR_STRTUP_CNT_SHIFT, AFE_CR_STRTUP_CNT_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field RESULT_FORMAT[18] (RW)
 *
 * This field can be used to select AFE Result Register formating.
 *
 * Values:
 * - 0 - Left justified 2's complement 32-bit : SVVVVVVVVVVVVVVVVVVVVVVV00000000
 *     where (S= sign bit , V=valid result value, 0=zero)
 * - 1 - Right justified 2's complement 32-bit :
 *     SSSSSSSSSVVVVVVVVVVVVVVVVVVVVVVV where (S= sign bit , V= valid result value, 0= zero)
 */
/*@{*/
/*! @brief Read current value of the AFE_CR_RESULT_FORMAT field. */
#define AFE_RD_CR_RESULT_FORMAT(base) ((AFE_CR_REG(base) & AFE_CR_RESULT_FORMAT_MASK) >> AFE_CR_RESULT_FORMAT_SHIFT)
#define AFE_BRD_CR_RESULT_FORMAT(base) (BME_UBFX32(&AFE_CR_REG(base), AFE_CR_RESULT_FORMAT_SHIFT, AFE_CR_RESULT_FORMAT_WIDTH))

/*! @brief Set the RESULT_FORMAT field to a new value. */
#define AFE_WR_CR_RESULT_FORMAT(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_RESULT_FORMAT_MASK) | AFE_CR_RESULT_FORMAT(value)))
#define AFE_BWR_CR_RESULT_FORMAT(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_RESULT_FORMAT_SHIFT), AFE_CR_RESULT_FORMAT_SHIFT, AFE_CR_RESULT_FORMAT_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field DLY_OK[21] (WO)
 *
 * This field should be asserted after all the four delay registers are loaded.
 * DLY values in CHx_DR will become active when DLY_OK =1 and "a new conversion
 * starts". This bit is self clearing.
 */
/*@{*/
/*! @brief Set the DLY_OK field to a new value. */
#define AFE_WR_CR_DLY_OK(base, value) (AFE_WR_CR(base, AFE_CR_DLY_OK(value)))
#define AFE_BWR_CR_DLY_OK(base, value) (AFE_WR_CR_DLY_OK(base, value))
/*@}*/

/*!
 * @name Register AFE_CR, field RST_B[22] (RW)
 *
 * RST_B field is used to reset all ADCs, PGAs , Decimation filters and Clock
 * configuration bits.
 *
 * Values:
 * - 0 - All ADCs, PGAs and Decimation filters are disabled. Clock Configuration
 *     bits will be reset.
 * - 1 - .= All ADCs, PGAs and Decimation filters are enabled.
 */
/*@{*/
/*! @brief Read current value of the AFE_CR_RST_B field. */
#define AFE_RD_CR_RST_B(base) ((AFE_CR_REG(base) & AFE_CR_RST_B_MASK) >> AFE_CR_RST_B_SHIFT)
#define AFE_BRD_CR_RST_B(base) (BME_UBFX32(&AFE_CR_REG(base), AFE_CR_RST_B_SHIFT, AFE_CR_RST_B_WIDTH))

/*! @brief Set the RST_B field to a new value. */
#define AFE_WR_CR_RST_B(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_RST_B_MASK) | AFE_CR_RST_B(value)))
#define AFE_BWR_CR_RST_B(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_RST_B_SHIFT), AFE_CR_RST_B_SHIFT, AFE_CR_RST_B_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field LPM_EN[25] (RW)
 *
 * Values:
 * - 0 - AFE will be in normal mode
 * - 1 - AFE will be in low power mode. Setting this bit reduce the current
 *     consumption of ADC and Buffer Amplifier , the max modulator clock frequency is
 *     below 1Mhz.
 */
/*@{*/
/*! @brief Read current value of the AFE_CR_LPM_EN field. */
#define AFE_RD_CR_LPM_EN(base) ((AFE_CR_REG(base) & AFE_CR_LPM_EN_MASK) >> AFE_CR_LPM_EN_SHIFT)
#define AFE_BRD_CR_LPM_EN(base) (BME_UBFX32(&AFE_CR_REG(base), AFE_CR_LPM_EN_SHIFT, AFE_CR_LPM_EN_WIDTH))

/*! @brief Set the LPM_EN field to a new value. */
#define AFE_WR_CR_LPM_EN(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_LPM_EN_MASK) | AFE_CR_LPM_EN(value)))
#define AFE_BWR_CR_LPM_EN(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_LPM_EN_SHIFT), AFE_CR_LPM_EN_SHIFT, AFE_CR_LPM_EN_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field SOFT_TRG3[27] (WORZ)
 *
 * This field is set to trigger conversion on AFE Channel3.
 */
/*@{*/
/*! @brief Set the SOFT_TRG3 field to a new value. */
#define AFE_WR_CR_SOFT_TRG3(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_SOFT_TRG3_MASK) | AFE_CR_SOFT_TRG3(value)))
#define AFE_BWR_CR_SOFT_TRG3(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_SOFT_TRG3_SHIFT), AFE_CR_SOFT_TRG3_SHIFT, AFE_CR_SOFT_TRG3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field SOFT_TRG2[28] (WORZ)
 *
 * This field is set to trigger conversion on AFE Channel2.
 */
/*@{*/
/*! @brief Set the SOFT_TRG2 field to a new value. */
#define AFE_WR_CR_SOFT_TRG2(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_SOFT_TRG2_MASK) | AFE_CR_SOFT_TRG2(value)))
#define AFE_BWR_CR_SOFT_TRG2(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_SOFT_TRG2_SHIFT), AFE_CR_SOFT_TRG2_SHIFT, AFE_CR_SOFT_TRG2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field SOFT_TRG1[29] (WORZ)
 *
 * This field is set to trigger conversion on AFE Channel1.
 */
/*@{*/
/*! @brief Set the SOFT_TRG1 field to a new value. */
#define AFE_WR_CR_SOFT_TRG1(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_SOFT_TRG1_MASK) | AFE_CR_SOFT_TRG1(value)))
#define AFE_BWR_CR_SOFT_TRG1(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_SOFT_TRG1_SHIFT), AFE_CR_SOFT_TRG1_SHIFT, AFE_CR_SOFT_TRG1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field SOFT_TRG0[30] (WORZ)
 *
 * This field is set to trigger conversion on AFE Channel0.
 */
/*@{*/
/*! @brief Set the SOFT_TRG0 field to a new value. */
#define AFE_WR_CR_SOFT_TRG0(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_SOFT_TRG0_MASK) | AFE_CR_SOFT_TRG0(value)))
#define AFE_BWR_CR_SOFT_TRG0(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_SOFT_TRG0_SHIFT), AFE_CR_SOFT_TRG0_SHIFT, AFE_CR_SOFT_TRG0_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CR, field MSTR_EN[31] (RW)
 *
 * Setting this bit enables all ADCs and filters simultaneously whose SD_MOD_EN
 * and DEC_EN is asserted. If AFE bypass mode is enabled SD_MOD_EN bit will be
 * ignored.
 *
 * Values:
 * - 0 - All ADCs are disabled.
 * - 1 - All ADCs and filters will get simultaneously enabled .
 */
/*@{*/
/*! @brief Read current value of the AFE_CR_MSTR_EN field. */
#define AFE_RD_CR_MSTR_EN(base) ((AFE_CR_REG(base) & AFE_CR_MSTR_EN_MASK) >> AFE_CR_MSTR_EN_SHIFT)
#define AFE_BRD_CR_MSTR_EN(base) (BME_UBFX32(&AFE_CR_REG(base), AFE_CR_MSTR_EN_SHIFT, AFE_CR_MSTR_EN_WIDTH))

