pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the MSTR_EN field to a new value. */
#define AFE_WR_CR_MSTR_EN(base, value) (AFE_WR_CR(base, (AFE_RD_CR(base) & ~AFE_CR_MSTR_EN_MASK) | AFE_CR_MSTR_EN(value)))
#define AFE_BWR_CR_MSTR_EN(base, value) (BME_BFI32(&AFE_CR_REG(base), ((uint32_t)(value) << AFE_CR_MSTR_EN_SHIFT), AFE_CR_MSTR_EN_SHIFT, AFE_CR_MSTR_EN_WIDTH))
/*@}*/

/*******************************************************************************
 * AFE_CKR - Clock Configuration Register
 ******************************************************************************/

/*!
 * @brief AFE_CKR - Clock Configuration Register (RW)
 *
 * Reset value: 0x10000000U
 *
 * AFE Clock Configuration Register has fields to control the source of clock,
 * DIV factor and gating of clocks to AFEs.
 */
/*!
 * @name Constants and macros for entire AFE_CKR register
 */
/*@{*/
#define AFE_RD_CKR(base)         (AFE_CKR_REG(base))
#define AFE_WR_CKR(base, value)  (AFE_CKR_REG(base) = (value))
#define AFE_SET_CKR(base, value) (BME_OR32(&AFE_CKR_REG(base), (uint32_t)(value)))
#define AFE_CLR_CKR(base, value) (BME_AND32(&AFE_CKR_REG(base), (uint32_t)(~(value))))
#define AFE_TOG_CKR(base, value) (BME_XOR32(&AFE_CKR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AFE_CKR bitfields
 */

/*!
 * @name Register AFE_CKR, field CLS[22:21] (RW)
 *
 * The CLS bits are used to select one of the four clock sources for modulator
 * clk.
 *
 * Values:
 * - 00 - mod_clk0
 * - 01 - mod_clk1
 * - 10 - mod_clk2
 * - 11 - mod_clk3
 */
/*@{*/
/*! @brief Read current value of the AFE_CKR_CLS field. */
#define AFE_RD_CKR_CLS(base) ((AFE_CKR_REG(base) & AFE_CKR_CLS_MASK) >> AFE_CKR_CLS_SHIFT)
#define AFE_BRD_CKR_CLS(base) (BME_UBFX32(&AFE_CKR_REG(base), AFE_CKR_CLS_SHIFT, AFE_CKR_CLS_WIDTH))

/*! @brief Set the CLS field to a new value. */
#define AFE_WR_CKR_CLS(base, value) (AFE_WR_CKR(base, (AFE_RD_CKR(base) & ~AFE_CKR_CLS_MASK) | AFE_CKR_CLS(value)))
#define AFE_BWR_CKR_CLS(base, value) (BME_BFI32(&AFE_CKR_REG(base), ((uint32_t)(value) << AFE_CKR_CLS_SHIFT), AFE_CKR_CLS_SHIFT, AFE_CKR_CLS_WIDTH))
/*@}*/

/*!
 * @name Register AFE_CKR, field DIV[31:28] (RW)
 *
 * The DIV selects the clock divider ratio for the modulator clock. The
 * modulator clock frequency is the source clock divided by division factor. The default
 * value of DIV is 2.
 *
 * Values:
 * - 0000 - divide by 1
 * - 0001 - divide by 2 (default)
 * - 0010 - divide by 4
 * - 0011 - divide by 8
 * - 0100 - divide by 16
 * - 0101 - divide by 32
 * - 0110 - divide by 64
 * - 0111 - divide by 128
 * - 1xxx - divide by 256
 */
/*@{*/
/*! @brief Read current value of the AFE_CKR_DIV field. */
#define AFE_RD_CKR_DIV(base) ((AFE_CKR_REG(base) & AFE_CKR_DIV_MASK) >> AFE_CKR_DIV_SHIFT)
#define AFE_BRD_CKR_DIV(base) (BME_UBFX32(&AFE_CKR_REG(base), AFE_CKR_DIV_SHIFT, AFE_CKR_DIV_WIDTH))

/*! @brief Set the DIV field to a new value. */
#define AFE_WR_CKR_DIV(base, value) (AFE_WR_CKR(base, (AFE_RD_CKR(base) & ~AFE_CKR_DIV_MASK) | AFE_CKR_DIV(value)))
#define AFE_BWR_CKR_DIV(base, value) (BME_BFI32(&AFE_CKR_REG(base), ((uint32_t)(value) << AFE_CKR_DIV_SHIFT), AFE_CKR_DIV_SHIFT, AFE_CKR_DIV_WIDTH))
/*@}*/

/*******************************************************************************
 * AFE_DI - DMA and Interrupt Register
 ******************************************************************************/

/*!
 * @brief AFE_DI - DMA and Interrupt Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * DMA and Interrupt Register has fields to enable DMA and Interrupt requests.
 */
/*!
 * @name Constants and macros for entire AFE_DI register
 */
/*@{*/
#define AFE_RD_DI(base)          (AFE_DI_REG(base))
#define AFE_WR_DI(base, value)   (AFE_DI_REG(base) = (value))
#define AFE_SET_DI(base, value)  (BME_OR32(&AFE_DI_REG(base), (uint32_t)(value)))
#define AFE_CLR_DI(base, value)  (BME_AND32(&AFE_DI_REG(base), (uint32_t)(~(value))))
#define AFE_TOG_DI(base, value)  (BME_XOR32(&AFE_DI_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AFE_DI bitfields
 */

/*!
 * @name Register AFE_DI, field INTEN3[23] (RW)
 *
 * The conversion complete interrupt request is asserted for channel 3 when
 * INTEN3 and COC3 bits are set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_INTEN3 field. */
#define AFE_RD_DI_INTEN3(base) ((AFE_DI_REG(base) & AFE_DI_INTEN3_MASK) >> AFE_DI_INTEN3_SHIFT)
#define AFE_BRD_DI_INTEN3(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_INTEN3_SHIFT, AFE_DI_INTEN3_WIDTH))

/*! @brief Set the INTEN3 field to a new value. */
#define AFE_WR_DI_INTEN3(base, value) (AFE_WR_DI(base, (AFE_RD_DI(base) & ~AFE_DI_INTEN3_MASK) | AFE_DI_INTEN3(value)))
#define AFE_BWR_DI_INTEN3(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_INTEN3_SHIFT), AFE_DI_INTEN3_SHIFT, AFE_DI_INTEN3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field INTEN2[24] (RW)
 *
 * The conversion complete interrupt request is asserted for channel 2 when
 * INTEN2 and COC2 bits are set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_INTEN2 field. */
#define AFE_RD_DI_INTEN2(base) ((AFE_DI_REG(base) & AFE_DI_INTEN2_MASK) >> AFE_DI_INTEN2_SHIFT)
#define AFE_BRD_DI_INTEN2(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_INTEN2_SHIFT, AFE_DI_INTEN2_WIDTH))

/*! @brief Set the INTEN2 field to a new value. */
#define AFE_WR_DI_INTEN2(base, value) (AFE_WR_DI(base, (AFE_RD_DI(base) & ~AFE_DI_INTEN2_MASK) | AFE_DI_INTEN2(value)))
#define AFE_BWR_DI_INTEN2(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_INTEN2_SHIFT), AFE_DI_INTEN2_SHIFT, AFE_DI_INTEN2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field INTEN1[25] (RW)
 *
 * The conversion complete interrupt request is asserted for channel 1 when
 * INTEN1 and COC1 bits are set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_INTEN1 field. */
#define AFE_RD_DI_INTEN1(base) ((AFE_DI_REG(base) & AFE_DI_INTEN1_MASK) >> AFE_DI_INTEN1_SHIFT)
#define AFE_BRD_DI_INTEN1(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_INTEN1_SHIFT, AFE_DI_INTEN1_WIDTH))

/*! @brief Set the INTEN1 field to a new value. */
#define AFE_WR_DI_INTEN1(base, value) (AFE_WR_DI(base, (AFE_RD_DI(base) & ~AFE_DI_INTEN1_MASK) | AFE_DI_INTEN1(value)))
#define AFE_BWR_DI_INTEN1(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_INTEN1_SHIFT), AFE_DI_INTEN1_SHIFT, AFE_DI_INTEN1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field INTEN0[26] (RW)
 *
 * The conversion complete interrupt request is asserted for channel 0 when
 * INTEN0 and COC0 bits are set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_INTEN0 field. */
#define AFE_RD_DI_INTEN0(base) ((AFE_DI_REG(base) & AFE_DI_INTEN0_MASK) >> AFE_DI_INTEN0_SHIFT)
#define AFE_BRD_DI_INTEN0(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_INTEN0_SHIFT, AFE_DI_INTEN0_WIDTH))

/*! @brief Set the INTEN0 field to a new value. */
#define AFE_WR_DI_INTEN0(base, value) (AFE_WR_DI(base, (AFE_RD_DI(base) & ~AFE_DI_INTEN0_MASK) | AFE_DI_INTEN0(value)))
#define AFE_BWR_DI_INTEN0(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_INTEN0_SHIFT), AFE_DI_INTEN0_SHIFT, AFE_DI_INTEN0_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field DMAEN3[28] (RW)
 *
 * The DMA request is asserted for channel3 when the DMAEN3 and COC3 bits are
 * set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_DMAEN3 field. */
#define AFE_RD_DI_DMAEN3(base) ((AFE_DI_REG(base) & AFE_DI_DMAEN3_MASK) >> AFE_DI_DMAEN3_SHIFT)
#define AFE_BRD_DI_DMAEN3(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_DMAEN3_SHIFT, AFE_DI_DMAEN3_WIDTH))

/*! @brief Set the DMAEN3 field to a new value. */
#define AFE_WR_DI_DMAEN3(base, value) (AFE_WR_DI(base, (AFE_RD_DI(base) & ~AFE_DI_DMAEN3_MASK) | AFE_DI_DMAEN3(value)))
#define AFE_BWR_DI_DMAEN3(base, value) (BME_BFI32(&AFE_DI_REG(base), ((uint32_t)(value) << AFE_DI_DMAEN3_SHIFT), AFE_DI_DMAEN3_SHIFT, AFE_DI_DMAEN3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_DI, field DMAEN2[29] (RW)
 *
 * The DMA request is asserted for channel2 when the DMAEN2 and COC2 bits are
 * set.
 */
/*@{*/
/*! @brief Read current value of the AFE_DI_DMAEN2 field. */
#define AFE_RD_DI_DMAEN2(base) ((AFE_DI_REG(base) & AFE_DI_DMAEN2_MASK) >> AFE_DI_DMAEN2_SHIFT)
#define AFE_BRD_DI_DMAEN2(base) (BME_UBFX32(&AFE_DI_REG(base), AFE_DI_DMAEN2_SHIFT, AFE_DI_DMAEN2_WIDTH))

