pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual AFE_SR bitfields
 */

/*!
 * @name Register AFE_SR, field RDY3[16] (RO)
 *
 * It indicates that AFE Channel3 is ready for conversion.
 *
 * Values:
 * - 0 - AFE Channel3 is disabled or has not completed its start up period
 * - 1 - AFE Channel3 is ready to initiate conversions.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_RDY3 field. */
#define AFE_RD_SR_RDY3(base) ((AFE_SR_REG(base) & AFE_SR_RDY3_MASK) >> AFE_SR_RDY3_SHIFT)
#define AFE_BRD_SR_RDY3(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_RDY3_SHIFT, AFE_SR_RDY3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field RDY2[17] (RO)
 *
 * It indicates that AFE Channel2 is ready for conversion.
 *
 * Values:
 * - 0 - AFE Channel2 is disabled or has not completed its start up period
 * - 1 - AFE Channel2 is ready to initiate conversions.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_RDY2 field. */
#define AFE_RD_SR_RDY2(base) ((AFE_SR_REG(base) & AFE_SR_RDY2_MASK) >> AFE_SR_RDY2_SHIFT)
#define AFE_BRD_SR_RDY2(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_RDY2_SHIFT, AFE_SR_RDY2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field RDY1[18] (RO)
 *
 * It indicates that AFE Channel1 is ready for conversion.
 *
 * Values:
 * - 0 - AFE Channel1 is disabled or has not completed its start up period
 * - 1 - AFE Channel1 is ready to initiate conversions.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_RDY1 field. */
#define AFE_RD_SR_RDY1(base) ((AFE_SR_REG(base) & AFE_SR_RDY1_MASK) >> AFE_SR_RDY1_SHIFT)
#define AFE_BRD_SR_RDY1(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_RDY1_SHIFT, AFE_SR_RDY1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field RDY0[19] (RO)
 *
 * It indicates that AFE Channel0 is ready for conversion.
 *
 * Values:
 * - 0 - AFE Channel0 is disabled or has not completed its start up period
 * - 1 - AFE Channel0 is ready to initiate conversions.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_RDY0 field. */
#define AFE_RD_SR_RDY0(base) ((AFE_SR_REG(base) & AFE_SR_RDY0_MASK) >> AFE_SR_RDY0_SHIFT)
#define AFE_BRD_SR_RDY0(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_RDY0_SHIFT, AFE_SR_RDY0_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field OVR3[21] (RO)
 *
 * This bit is set when the previous data has not been read and new data has
 * already been arrived to be loaded in result register of the AFE Channel3 and
 * cleared on a read of the result register
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_OVR3 field. */
#define AFE_RD_SR_OVR3(base) ((AFE_SR_REG(base) & AFE_SR_OVR3_MASK) >> AFE_SR_OVR3_SHIFT)
#define AFE_BRD_SR_OVR3(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_OVR3_SHIFT, AFE_SR_OVR3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field OVR2[22] (RO)
 *
 * This bit is set when the previous data has not been read and new data has
 * already been arrived to be loaded in result register of the AFE Channel2 and
 * cleared on a read of the result register
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_OVR2 field. */
#define AFE_RD_SR_OVR2(base) ((AFE_SR_REG(base) & AFE_SR_OVR2_MASK) >> AFE_SR_OVR2_SHIFT)
#define AFE_BRD_SR_OVR2(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_OVR2_SHIFT, AFE_SR_OVR2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field OVR1[23] (RO)
 *
 * This bit is set when the previous data has not been read and new data has
 * already been arrived to be loaded in result register of the AFE Channel1 and
 * cleared on a read of the result register
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_OVR1 field. */
#define AFE_RD_SR_OVR1(base) ((AFE_SR_REG(base) & AFE_SR_OVR1_MASK) >> AFE_SR_OVR1_SHIFT)
#define AFE_BRD_SR_OVR1(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_OVR1_SHIFT, AFE_SR_OVR1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field OVR0[24] (RO)
 *
 * This bit is set when the previous data has not been read and new data has
 * already been arrived to be loaded in result register of the AFE Channel0 and
 * cleared on a read of the result register.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_OVR0 field. */
#define AFE_RD_SR_OVR0(base) ((AFE_SR_REG(base) & AFE_SR_OVR0_MASK) >> AFE_SR_OVR0_SHIFT)
#define AFE_BRD_SR_OVR0(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_OVR0_SHIFT, AFE_SR_OVR0_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field COC3[28] (RO)
 *
 * The COC flag is set when a conversion is completed and cleared on a read of
 * the result register CH3_AFE_RR. Since modulators take some time to start up,
 * this field is set at third sample and first two samples are ignored.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_COC3 field. */
#define AFE_RD_SR_COC3(base) ((AFE_SR_REG(base) & AFE_SR_COC3_MASK) >> AFE_SR_COC3_SHIFT)
#define AFE_BRD_SR_COC3(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_COC3_SHIFT, AFE_SR_COC3_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field COC2[29] (RO)
 *
 * The COC flag is set when a conversion is completed and cleared on a read of
 * the result register CH2_AFE_RR. Since modulators take some time to start up,
 * this field is set at third sample and first two samples are ignored.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_COC2 field. */
#define AFE_RD_SR_COC2(base) ((AFE_SR_REG(base) & AFE_SR_COC2_MASK) >> AFE_SR_COC2_SHIFT)
#define AFE_BRD_SR_COC2(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_COC2_SHIFT, AFE_SR_COC2_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field COC1[30] (RO)
 *
 * The COC flag is set when a conversion is completed and cleared on a read of
 * the result register CH1_AFE_RR. Since modulators take some time to start up,
 * this field is set at third sample and first two samples are ignored.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_COC1 field. */
#define AFE_RD_SR_COC1(base) ((AFE_SR_REG(base) & AFE_SR_COC1_MASK) >> AFE_SR_COC1_SHIFT)
#define AFE_BRD_SR_COC1(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_COC1_SHIFT, AFE_SR_COC1_WIDTH))
/*@}*/

/*!
 * @name Register AFE_SR, field COC0[31] (RO)
 *
 * The COC flag is set when a conversion is completed and cleared on a read of
 * the result register CH0_AFE_RR. Since modulators take some time to start up,
 * this field is set at third sample and first two samples are ignored.
 */
/*@{*/
/*! @brief Read current value of the AFE_SR_COC0 field. */
#define AFE_RD_SR_COC0(base) ((AFE_SR_REG(base) & AFE_SR_COC0_MASK) >> AFE_SR_COC0_SHIFT)
#define AFE_BRD_SR_COC0(base) (BME_UBFX32(&AFE_SR_REG(base), AFE_SR_COC0_SHIFT, AFE_SR_COC0_WIDTH))
/*@}*/

/* Unified AFE register access macros */
#define AFE_BRD_DI_INTEN(x, c)    (BME_UBFX32(HW_AFE_DI_ADDR(x), (26U-c), AFE_DI_INTEN0_WIDTH))
#define AFE_BWR_DI_INTEN(x, c, v) (BME_BFI32(HW_AFE_DI_ADDR(x), ((uint32_t)(v) << (26U-c)), (26U-c), 1U))
#define AFE_BRD_DI_DMAEN(x, c)    (BME_UBFX32(HW_AFE_DI_ADDR(x), (31U-c), AFE_DI_DMAEN0_WIDTH))
#define AFE_BWR_DI_DMAEN(x, c, v) (BME_BFI32(HW_AFE_DI_ADDR(x), ((uint32_t)(v) << (31U-c)), (31U-c), 1U))
#define AFE_BRD_RR(x, c)          (HW_AFE_RR0(x + 4U*c).U)
#define AFE_BRD_SR_RDY(x, c)      (BME_UBFX32(HW_AFE_SR_ADDR(x), (19U-c), AFE_SR_RDY0_WIDTH))
#define AFE_BRD_SR_OVR(x, c)      (BME_UBFX32(HW_AFE_SR_ADDR(x), (24U-c), AFE_SR_OVR0_WIDTH))
#define AFE_BRD_SR_COC(x, c)      (BME_UBFX32(HW_AFE_SR_ADDR(x), (31U-c), AFE_SR_COC0_WIDTH))
#define AFE_BWR_CR_SOFT_TRG(x, c) (BME_BFI32(HW_AFE_CR_ADDR(x), ((uint32_t)(c) << 27U), 27U, 4U))
#define AFE_WR_CFRx(x, c, v)      (HW_AFE_CFR0(x + 4U*c).U = (v))
#define AFE_WR_DRx(x, c, v)       (HW_AFE_DR0(x + 4U*c).U = (v))

