pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the AC5 field to a new value. */
#define AIPS_WR_PACRB_AC5(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC5_MASK) | AIPS_PACRB_AC5(value)))
#define AIPS_BWR_PACRB_AC5(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC5_SHIFT), AIPS_PACRB_AC5_SHIFT, AIPS_PACRB_AC5_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO5[11] (RW)
 *
 * Indicates the lock status of this register's AC5 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC5 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO5 field. */
#define AIPS_RD_PACRB_RO5(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO5_MASK) >> AIPS_PACRB_RO5_SHIFT)
#define AIPS_BRD_PACRB_RO5(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO5_SHIFT, AIPS_PACRB_RO5_WIDTH))

/*! @brief Set the RO5 field to a new value. */
#define AIPS_WR_PACRB_RO5(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO5_MASK) | AIPS_PACRB_RO5(value)))
#define AIPS_BWR_PACRB_RO5(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO5_SHIFT), AIPS_PACRB_RO5_SHIFT, AIPS_PACRB_RO5_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC4[14:12] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC4 field. */
#define AIPS_RD_PACRB_AC4(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC4_MASK) >> AIPS_PACRB_AC4_SHIFT)
#define AIPS_BRD_PACRB_AC4(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC4_SHIFT, AIPS_PACRB_AC4_WIDTH))

/*! @brief Set the AC4 field to a new value. */
#define AIPS_WR_PACRB_AC4(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC4_MASK) | AIPS_PACRB_AC4(value)))
#define AIPS_BWR_PACRB_AC4(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC4_SHIFT), AIPS_PACRB_AC4_SHIFT, AIPS_PACRB_AC4_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO4[15] (RW)
 *
 * Indicates the lock status of this register's AC4 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC4 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO4 field. */
#define AIPS_RD_PACRB_RO4(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO4_MASK) >> AIPS_PACRB_RO4_SHIFT)
#define AIPS_BRD_PACRB_RO4(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO4_SHIFT, AIPS_PACRB_RO4_WIDTH))

/*! @brief Set the RO4 field to a new value. */
#define AIPS_WR_PACRB_RO4(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO4_MASK) | AIPS_PACRB_RO4(value)))
#define AIPS_BWR_PACRB_RO4(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO4_SHIFT), AIPS_PACRB_RO4_SHIFT, AIPS_PACRB_RO4_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC3[18:16] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC3 field. */
#define AIPS_RD_PACRB_AC3(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC3_MASK) >> AIPS_PACRB_AC3_SHIFT)
#define AIPS_BRD_PACRB_AC3(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC3_SHIFT, AIPS_PACRB_AC3_WIDTH))

/*! @brief Set the AC3 field to a new value. */
#define AIPS_WR_PACRB_AC3(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC3_MASK) | AIPS_PACRB_AC3(value)))
#define AIPS_BWR_PACRB_AC3(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC3_SHIFT), AIPS_PACRB_AC3_SHIFT, AIPS_PACRB_AC3_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO3[19] (RW)
 *
 * Indicates the lock status of this register's AC3 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC3 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO3 field. */
#define AIPS_RD_PACRB_RO3(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO3_MASK) >> AIPS_PACRB_RO3_SHIFT)
#define AIPS_BRD_PACRB_RO3(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO3_SHIFT, AIPS_PACRB_RO3_WIDTH))

/*! @brief Set the RO3 field to a new value. */
#define AIPS_WR_PACRB_RO3(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO3_MASK) | AIPS_PACRB_RO3(value)))
#define AIPS_BWR_PACRB_RO3(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO3_SHIFT), AIPS_PACRB_RO3_SHIFT, AIPS_PACRB_RO3_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC2[22:20] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC2 field. */
#define AIPS_RD_PACRB_AC2(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC2_MASK) >> AIPS_PACRB_AC2_SHIFT)
#define AIPS_BRD_PACRB_AC2(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC2_SHIFT, AIPS_PACRB_AC2_WIDTH))

/*! @brief Set the AC2 field to a new value. */
#define AIPS_WR_PACRB_AC2(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC2_MASK) | AIPS_PACRB_AC2(value)))
#define AIPS_BWR_PACRB_AC2(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC2_SHIFT), AIPS_PACRB_AC2_SHIFT, AIPS_PACRB_AC2_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO2[23] (RW)
 *
 * Indicates the lock status of this register's AC2 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC2 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO2 field. */
#define AIPS_RD_PACRB_RO2(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO2_MASK) >> AIPS_PACRB_RO2_SHIFT)
#define AIPS_BRD_PACRB_RO2(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO2_SHIFT, AIPS_PACRB_RO2_WIDTH))

/*! @brief Set the RO2 field to a new value. */
#define AIPS_WR_PACRB_RO2(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO2_MASK) | AIPS_PACRB_RO2(value)))
#define AIPS_BWR_PACRB_RO2(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO2_SHIFT), AIPS_PACRB_RO2_SHIFT, AIPS_PACRB_RO2_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC1[26:24] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC1 field. */
#define AIPS_RD_PACRB_AC1(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC1_MASK) >> AIPS_PACRB_AC1_SHIFT)
#define AIPS_BRD_PACRB_AC1(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC1_SHIFT, AIPS_PACRB_AC1_WIDTH))

/*! @brief Set the AC1 field to a new value. */
#define AIPS_WR_PACRB_AC1(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC1_MASK) | AIPS_PACRB_AC1(value)))
#define AIPS_BWR_PACRB_AC1(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC1_SHIFT), AIPS_PACRB_AC1_SHIFT, AIPS_PACRB_AC1_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO1[27] (RW)
 *
 * Indicates the lock status of this register's AC1 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC1 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO1 field. */
#define AIPS_RD_PACRB_RO1(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO1_MASK) >> AIPS_PACRB_RO1_SHIFT)
#define AIPS_BRD_PACRB_RO1(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO1_SHIFT, AIPS_PACRB_RO1_WIDTH))

/*! @brief Set the RO1 field to a new value. */
#define AIPS_WR_PACRB_RO1(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO1_MASK) | AIPS_PACRB_RO1(value)))
#define AIPS_BWR_PACRB_RO1(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO1_SHIFT), AIPS_PACRB_RO1_SHIFT, AIPS_PACRB_RO1_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field AC0[30:28] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_AC0 field. */
#define AIPS_RD_PACRB_AC0(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_AC0_MASK) >> AIPS_PACRB_AC0_SHIFT)
#define AIPS_BRD_PACRB_AC0(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_AC0_SHIFT, AIPS_PACRB_AC0_WIDTH))

/*! @brief Set the AC0 field to a new value. */
#define AIPS_WR_PACRB_AC0(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_AC0_MASK) | AIPS_PACRB_AC0(value)))
#define AIPS_BWR_PACRB_AC0(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_AC0_SHIFT), AIPS_PACRB_AC0_SHIFT, AIPS_PACRB_AC0_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRB, field RO0[31] (RW)
 *
 * Indicates the lock status of this register's AC0 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC0 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRB_RO0 field. */
#define AIPS_RD_PACRB_RO0(base) ((AIPS_PACRB_REG(base) & AIPS_PACRB_RO0_MASK) >> AIPS_PACRB_RO0_SHIFT)
#define AIPS_BRD_PACRB_RO0(base) (BME_UBFX32(&AIPS_PACRB_REG(base), AIPS_PACRB_RO0_SHIFT, AIPS_PACRB_RO0_WIDTH))

/*! @brief Set the RO0 field to a new value. */
#define AIPS_WR_PACRB_RO0(base, value) (AIPS_WR_PACRB(base, (AIPS_RD_PACRB(base) & ~AIPS_PACRB_RO0_MASK) | AIPS_PACRB_RO0(value)))
#define AIPS_BWR_PACRB_RO0(base, value) (BME_BFI32(&AIPS_PACRB_REG(base), ((uint32_t)(value) << AIPS_PACRB_RO0_SHIFT), AIPS_PACRB_RO0_SHIFT, AIPS_PACRB_RO0_WIDTH))
/*@}*/

