pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * AIPS_PACRF - Peripheral Access Control Register
 ******************************************************************************/

/*!
 * @brief AIPS_PACRF - Peripheral Access Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * Each peripheral on this chip has a 4-bit PACR field which includes a
 * read-only "lock" bit plus a 3-bit attribute check field which defines the access
 * rights (privileged/user, secure/nonsecure) needed to reference the slave
 * peripheral's address space. Access to these registers is allowed using only 32-bit
 * privileged, secure reads and writes. Each 32-bit register controls eight
 * peripherals. PACRE-PACR P control access to the 96 off-platform peripherals. A
 * peripheral's assignment to a PACR field is defined by the memory map slot to which the
 * peripheral is assigned. See this device's peripheral bridge memory map
 * information for the assignment of a particular peripheral. The following table shows
 * the top-level structure of PACRs. Offset Register [31:28] [27:24] [23:20]
 * [19:16] [15:12] [11:8] [7:4] [3:0] 0x40 PACRE PACR32 PACR33 PACR34 PACR35 PACR36
 * PACR37 PACR38 PACR39 0x44 PACRF PACR40 PACR41 PACR42 PACR43 PACR44 PACR45
 * PACR46 PACR47 0x48 PACRG PACR48 PACR49 PACR50 PACR51 PACR52 PACR53 PACR54 PACR55
 * 0x4C PACRH PACR56 PACR57 PACR58 PACR59 PACR60 PACR61 PACR62 PACR63 0x50 PACRI
 * PACR64 PACR65 PACR66 PACR67 PACR68 PACR69 PACR70 PACR71 0x54 PACRJ PACR72 PACR73
 * PACR74 PACR75 PACR76 PACR77 PACR78 PACR79 0x58 PACRK PACR80 PACR81 PACR82
 * PACR83 PACR84 PACR85 PACR86 PACR87 0x5C PACRL PACR88 PACR89 PACR90 PACR91 PACR92
 * PACR93 PACR94 PACR95 0x60 PACRM PACR96 PACR97 PACR98 PACR99 PACR100 PACR101
 * PACR102 PACR103 0x64 PACRN PACR104 PACR105 PACR106 PACR107 PACR108 PACR109
 * PACR110 PACR111 0x68 PACRO PACR112 PACR113 PACR114 PACR115 PACR116 PACR117 PACR118
 * PACR119 0x6C PACRP PACR120 PACR121 PACR122 PACR123 PACR124 PACR125 PACR126
 * PACR127
 */
/*!
 * @name Constants and macros for entire AIPS_PACRF register
 */
/*@{*/
#define AIPS_RD_PACRF(base)      (AIPS_PACRF_REG(base))
#define AIPS_WR_PACRF(base, value) (AIPS_PACRF_REG(base) = (value))
#define AIPS_SET_PACRF(base, value) (BME_OR32(&AIPS_PACRF_REG(base), (uint32_t)(value)))
#define AIPS_CLR_PACRF(base, value) (BME_AND32(&AIPS_PACRF_REG(base), (uint32_t)(~(value))))
#define AIPS_TOG_PACRF(base, value) (BME_XOR32(&AIPS_PACRF_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual AIPS_PACRF bitfields
 */

/*!
 * @name Register AIPS_PACRF, field AC7[2:0] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRF_AC7 field. */
#define AIPS_RD_PACRF_AC7(base) ((AIPS_PACRF_REG(base) & AIPS_PACRF_AC7_MASK) >> AIPS_PACRF_AC7_SHIFT)
#define AIPS_BRD_PACRF_AC7(base) (BME_UBFX32(&AIPS_PACRF_REG(base), AIPS_PACRF_AC7_SHIFT, AIPS_PACRF_AC7_WIDTH))

/*! @brief Set the AC7 field to a new value. */
#define AIPS_WR_PACRF_AC7(base, value) (AIPS_WR_PACRF(base, (AIPS_RD_PACRF(base) & ~AIPS_PACRF_AC7_MASK) | AIPS_PACRF_AC7(value)))
#define AIPS_BWR_PACRF_AC7(base, value) (BME_BFI32(&AIPS_PACRF_REG(base), ((uint32_t)(value) << AIPS_PACRF_AC7_SHIFT), AIPS_PACRF_AC7_SHIFT, AIPS_PACRF_AC7_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRF, field RO7[3] (RW)
 *
 * Indicates the lock status of this register's AC7 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC7 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRF_RO7 field. */
#define AIPS_RD_PACRF_RO7(base) ((AIPS_PACRF_REG(base) & AIPS_PACRF_RO7_MASK) >> AIPS_PACRF_RO7_SHIFT)
#define AIPS_BRD_PACRF_RO7(base) (BME_UBFX32(&AIPS_PACRF_REG(base), AIPS_PACRF_RO7_SHIFT, AIPS_PACRF_RO7_WIDTH))

/*! @brief Set the RO7 field to a new value. */
#define AIPS_WR_PACRF_RO7(base, value) (AIPS_WR_PACRF(base, (AIPS_RD_PACRF(base) & ~AIPS_PACRF_RO7_MASK) | AIPS_PACRF_RO7(value)))
#define AIPS_BWR_PACRF_RO7(base, value) (BME_BFI32(&AIPS_PACRF_REG(base), ((uint32_t)(value) << AIPS_PACRF_RO7_SHIFT), AIPS_PACRF_RO7_SHIFT, AIPS_PACRF_RO7_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRF, field AC6[6:4] (RW)
 *
 * Defines the attributes required to access the corresponding slave
 * peripheral's memory space. See #pacr_attributes , "Attribute check (AC) values" for
 * details.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRF_AC6 field. */
#define AIPS_RD_PACRF_AC6(base) ((AIPS_PACRF_REG(base) & AIPS_PACRF_AC6_MASK) >> AIPS_PACRF_AC6_SHIFT)
#define AIPS_BRD_PACRF_AC6(base) (BME_UBFX32(&AIPS_PACRF_REG(base), AIPS_PACRF_AC6_SHIFT, AIPS_PACRF_AC6_WIDTH))

/*! @brief Set the AC6 field to a new value. */
#define AIPS_WR_PACRF_AC6(base, value) (AIPS_WR_PACRF(base, (AIPS_RD_PACRF(base) & ~AIPS_PACRF_AC6_MASK) | AIPS_PACRF_AC6(value)))
#define AIPS_BWR_PACRF_AC6(base, value) (BME_BFI32(&AIPS_PACRF_REG(base), ((uint32_t)(value) << AIPS_PACRF_AC6_SHIFT), AIPS_PACRF_AC6_SHIFT, AIPS_PACRF_AC6_WIDTH))
/*@}*/

/*!
 * @name Register AIPS_PACRF, field RO6[7] (RW)
 *
 * Indicates the lock status of this register's AC6 field. After this field is
 * set to 1, it cannot be changed and attempted writes to AC6 are ignored until
 * the next system reset clears this field.
 *
 * Values:
 * - 0 - Writes to corresponding AC field are allowed.
 * - 1 - Writes to corresponding AC field are ignored.
 */
/*@{*/
/*! @brief Read current value of the AIPS_PACRF_RO6 field. */
#define AIPS_RD_PACRF_RO6(base) ((AIPS_PACRF_REG(base) & AIPS_PACRF_RO6_MASK) >> AIPS_PACRF_RO6_SHIFT)
#define AIPS_BRD_PACRF_RO6(base) (BME_UBFX32(&AIPS_PACRF_REG(base), AIPS_PACRF_RO6_SHIFT, AIPS_PACRF_RO6_WIDTH))

