pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual DMAMUX_CHCFGn bitfields
 */

/*!
 * @name Register DMAMUX_CHCFGn, field SOURCE[5:0] (RW)
 *
 * Specifies which DMA source, if any, is routed to a particular DMA channel.
 * See the chip-specific DMAMUX information for details about the peripherals and
 * their slot numbers.
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFGn_SOURCE field. */
#define DMAMUX_RD_CHCFGn_SOURCE(base, index) ((DMAMUX_CHCFGn_REG(base, index) & DMAMUX_CHCFGn_SOURCE_MASK) >> DMAMUX_CHCFGn_SOURCE_SHIFT)
#define DMAMUX_BRD_CHCFGn_SOURCE(base, index) (BME_UBFX8(&DMAMUX_CHCFGn_REG(base, index), DMAMUX_CHCFGn_SOURCE_SHIFT, DMAMUX_CHCFGn_SOURCE_WIDTH))

/*! @brief Set the SOURCE field to a new value. */
#define DMAMUX_WR_CHCFGn_SOURCE(base, index, value) (DMAMUX_WR_CHCFGn(base, index, (DMAMUX_RD_CHCFGn(base, index) & ~DMAMUX_CHCFGn_SOURCE_MASK) | DMAMUX_CHCFGn_SOURCE(value)))
#define DMAMUX_BWR_CHCFGn_SOURCE(base, index, value) (BME_BFI8(&DMAMUX_CHCFGn_REG(base, index), ((uint8_t)(value) << DMAMUX_CHCFGn_SOURCE_SHIFT), DMAMUX_CHCFGn_SOURCE_SHIFT, DMAMUX_CHCFGn_SOURCE_WIDTH))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFGn, field TRIG[6] (RW)
 *
 * Enables the periodic trigger capability for the triggered DMA channel.
 *
 * Values:
 * - 0 - Triggering is disabled. If triggering is disabled and ENBL is set, the
 *     DMA Channel will simply route the specified source to the DMA channel.
 *     (Normal mode)
 * - 1 - Triggering is enabled. If triggering is enabled and ENBL is set, the
 *     DMAMUX is in Periodic Trigger mode.
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFGn_TRIG field. */
#define DMAMUX_RD_CHCFGn_TRIG(base, index) ((DMAMUX_CHCFGn_REG(base, index) & DMAMUX_CHCFGn_TRIG_MASK) >> DMAMUX_CHCFGn_TRIG_SHIFT)
#define DMAMUX_BRD_CHCFGn_TRIG(base, index) (BME_UBFX8(&DMAMUX_CHCFGn_REG(base, index), DMAMUX_CHCFGn_TRIG_SHIFT, DMAMUX_CHCFGn_TRIG_WIDTH))

/*! @brief Set the TRIG field to a new value. */
#define DMAMUX_WR_CHCFGn_TRIG(base, index, value) (DMAMUX_WR_CHCFGn(base, index, (DMAMUX_RD_CHCFGn(base, index) & ~DMAMUX_CHCFGn_TRIG_MASK) | DMAMUX_CHCFGn_TRIG(value)))
#define DMAMUX_BWR_CHCFGn_TRIG(base, index, value) (BME_BFI8(&DMAMUX_CHCFGn_REG(base, index), ((uint8_t)(value) << DMAMUX_CHCFGn_TRIG_SHIFT), DMAMUX_CHCFGn_TRIG_SHIFT, DMAMUX_CHCFGn_TRIG_WIDTH))
/*@}*/

/*!
 * @name Register DMAMUX_CHCFGn, field ENBL[7] (RW)
 *
 * Enables the DMA channel.
 *
 * Values:
 * - 0 - DMA channel is disabled. This mode is primarily used during
 *     configuration of the DMAMux. The DMA has separate channel enables/disables, which
 *     should be used to disable or reconfigure a DMA channel.
 * - 1 - DMA channel is enabled
 */
/*@{*/
/*! @brief Read current value of the DMAMUX_CHCFGn_ENBL field. */
#define DMAMUX_RD_CHCFGn_ENBL(base, index) ((DMAMUX_CHCFGn_REG(base, index) & DMAMUX_CHCFGn_ENBL_MASK) >> DMAMUX_CHCFGn_ENBL_SHIFT)
#define DMAMUX_BRD_CHCFGn_ENBL(base, index) (BME_UBFX8(&DMAMUX_CHCFGn_REG(base, index), DMAMUX_CHCFGn_ENBL_SHIFT, DMAMUX_CHCFGn_ENBL_WIDTH))

/*! @brief Set the ENBL field to a new value. */
#define DMAMUX_WR_CHCFGn_ENBL(base, index, value) (DMAMUX_WR_CHCFGn(base, index, (DMAMUX_RD_CHCFGn(base, index) & ~DMAMUX_CHCFGn_ENBL_MASK) | DMAMUX_CHCFGn_ENBL(value)))
#define DMAMUX_BWR_CHCFGn_ENBL(base, index, value) (BME_BFI8(&DMAMUX_CHCFGn_REG(base, index), ((uint8_t)(value) << DMAMUX_CHCFGn_ENBL_SHIFT), DMAMUX_CHCFGn_ENBL_SHIFT, DMAMUX_CHCFGn_ENBL_WIDTH))
/*@}*/

/*
 * MKM14ZA5 EWM
 *
 * External Watchdog Monitor
 *
 * Registers defined in this header file:
 * - EWM_CTRL - Control Register
 * - EWM_SERV - Service Register
 * - EWM_CMPL - Compare Low Register
 * - EWM_CMPH - Compare High Register
 */

#define EWM_INSTANCE_COUNT (1U) /*!< Number of instances of the EWM module. */
#define EWM_IDX (0U) /*!< Instance number for EWM. */

/*******************************************************************************
 * EWM_CTRL - Control Register
 ******************************************************************************/

/*!
 * @brief EWM_CTRL - Control Register (RW)
 *
 * Reset value: 0x00U
 *
 * The CTRL register is cleared by any reset. INEN, ASSIN and EWMEN bits can be
 * written once after a CPU reset. Modifying these bits more than once, generates
 * a bus transfer error.
 */
/*!
 * @name Constants and macros for entire EWM_CTRL register
 */
/*@{*/
#define EWM_RD_CTRL(base)        (EWM_CTRL_REG(base))
#define EWM_WR_CTRL(base, value) (EWM_CTRL_REG(base) = (value))
#define EWM_SET_CTRL(base, value) (BME_OR8(&EWM_CTRL_REG(base), (uint8_t)(value)))
#define EWM_CLR_CTRL(base, value) (BME_AND8(&EWM_CTRL_REG(base), (uint8_t)(~(value))))
#define EWM_TOG_CTRL(base, value) (BME_XOR8(&EWM_CTRL_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual EWM_CTRL bitfields
 */

/*!
 * @name Register EWM_CTRL, field EWMEN[0] (RW)
 *
 * This bit when set, enables the EWM module. This resets the EWM counter to
 * zero and deasserts the EWM_out signal. Clearing EWMEN bit disables the EWM, and
 * therefore it cannot be enabled until a reset occurs, due to the write-once
 * nature of this bit.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_EWMEN field. */
#define EWM_RD_CTRL_EWMEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_EWMEN_MASK) >> EWM_CTRL_EWMEN_SHIFT)
#define EWM_BRD_CTRL_EWMEN(base) (BME_UBFX8(&EWM_CTRL_REG(base), EWM_CTRL_EWMEN_SHIFT, EWM_CTRL_EWMEN_WIDTH))

/*! @brief Set the EWMEN field to a new value. */
#define EWM_WR_CTRL_EWMEN(base, value) (EWM_WR_CTRL(base, (EWM_RD_CTRL(base) & ~EWM_CTRL_EWMEN_MASK) | EWM_CTRL_EWMEN(value)))
#define EWM_BWR_CTRL_EWMEN(base, value) (BME_BFI8(&EWM_CTRL_REG(base), ((uint8_t)(value) << EWM_CTRL_EWMEN_SHIFT), EWM_CTRL_EWMEN_SHIFT, EWM_CTRL_EWMEN_WIDTH))
/*@}*/

/*!
 * @name Register EWM_CTRL, field ASSIN[1] (RW)
 *
 * Default assert state of the EWM_in signal is logic zero. Setting ASSIN bit
 * inverts the assert state to a logic one.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_ASSIN field. */
#define EWM_RD_CTRL_ASSIN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_ASSIN_MASK) >> EWM_CTRL_ASSIN_SHIFT)
#define EWM_BRD_CTRL_ASSIN(base) (BME_UBFX8(&EWM_CTRL_REG(base), EWM_CTRL_ASSIN_SHIFT, EWM_CTRL_ASSIN_WIDTH))

/*! @brief Set the ASSIN field to a new value. */
#define EWM_WR_CTRL_ASSIN(base, value) (EWM_WR_CTRL(base, (EWM_RD_CTRL(base) & ~EWM_CTRL_ASSIN_MASK) | EWM_CTRL_ASSIN(value)))
#define EWM_BWR_CTRL_ASSIN(base, value) (BME_BFI8(&EWM_CTRL_REG(base), ((uint8_t)(value) << EWM_CTRL_ASSIN_SHIFT), EWM_CTRL_ASSIN_SHIFT, EWM_CTRL_ASSIN_WIDTH))
/*@}*/

/*!
 * @name Register EWM_CTRL, field INEN[2] (RW)
 *
 * This bit when set, enables the EWM_in port.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_INEN field. */
#define EWM_RD_CTRL_INEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_INEN_MASK) >> EWM_CTRL_INEN_SHIFT)
#define EWM_BRD_CTRL_INEN(base) (BME_UBFX8(&EWM_CTRL_REG(base), EWM_CTRL_INEN_SHIFT, EWM_CTRL_INEN_WIDTH))

/*! @brief Set the INEN field to a new value. */
#define EWM_WR_CTRL_INEN(base, value) (EWM_WR_CTRL(base, (EWM_RD_CTRL(base) & ~EWM_CTRL_INEN_MASK) | EWM_CTRL_INEN(value)))
#define EWM_BWR_CTRL_INEN(base, value) (BME_BFI8(&EWM_CTRL_REG(base), ((uint8_t)(value) << EWM_CTRL_INEN_SHIFT), EWM_CTRL_INEN_SHIFT, EWM_CTRL_INEN_WIDTH))
/*@}*/

/*!
 * @name Register EWM_CTRL, field INTEN[3] (RW)
 *
 * This bit when set and EWM_out is asserted, an interrupt request is generated.
 * To de-assert interrupt request, user should clear this bit by writing 0.
 */
/*@{*/
/*! @brief Read current value of the EWM_CTRL_INTEN field. */
#define EWM_RD_CTRL_INTEN(base) ((EWM_CTRL_REG(base) & EWM_CTRL_INTEN_MASK) >> EWM_CTRL_INTEN_SHIFT)
#define EWM_BRD_CTRL_INTEN(base) (BME_UBFX8(&EWM_CTRL_REG(base), EWM_CTRL_INTEN_SHIFT, EWM_CTRL_INTEN_WIDTH))

