pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * FTFA_FPROT0 - Program Flash Protection Registers
 ******************************************************************************/

/*!
 * @brief FTFA_FPROT0 - Program Flash Protection Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FPROT registers define which program flash regions are protected from
 * program and erase operations. Protected flash regions cannot have their content
 * changed; that is, these regions cannot be programmed and cannot be erased by
 * any flash command. Unprotected regions can be changed by program and erase
 * operations. The four FPROT registers allow up to 32 protectable regions. Each bit
 * protects a 1/32 region of the program flash memory except for memory
 * configurations with less than 32 KB of program flash where each assigned bit protects 1
 * KB . For configurations with 24 KB of program flash memory or less, FPROT0 is
 * not used. For configurations with 16 KB of program flash memory or less,
 * FPROT1 is not used. For configurations with 8 KB of program flash memory, FPROT2 is
 * not used. The bitfields are defined in each register as follows: Program
 * flash protection register Program flash protection bits FPROT0 PROT[31:24] FPROT1
 * PROT[23:16] FPROT2 PROT[15:8] FPROT3 PROT[7:0] During the reset sequence, the
 * FPROT registers are loaded with the contents of the program flash protection
 * bytes in the Flash Configuration Field as indicated in the following table.
 * Program flash protection register Flash Configuration Field offset address FPROT0
 * 0x000B FPROT1 0x000A FPROT2 0x0009 FPROT3 0x0008 To change the program flash
 * protection that is loaded during the reset sequence, unprotect the sector of
 * program flash memory that contains the Flash Configuration Field. Then,
 * reprogram the program flash protection byte.
 */
/*!
 * @name Constants and macros for entire FTFA_FPROT0 register
 */
/*@{*/
#define FTFA_RD_FPROT0(base)     (FTFA_FPROT0_REG(base))
#define FTFA_WR_FPROT0(base, value) (FTFA_FPROT0_REG(base) = (value))
#define FTFA_SET_FPROT0(base, value) (BME_OR8(&FTFA_FPROT0_REG(base), (uint8_t)(value)))
#define FTFA_CLR_FPROT0(base, value) (BME_AND8(&FTFA_FPROT0_REG(base), (uint8_t)(~(value))))
#define FTFA_TOG_FPROT0(base, value) (BME_XOR8(&FTFA_FPROT0_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * MKM14ZA5 GPIO
 *
 * General Purpose Input/Output
 *
 * Registers defined in this header file:
 * - GPIO_PDOR - Port Data Output Register
 * - GPIO_PDIR - Port Data Input Register
 * - GPIO_PDDR - Port Data Direction Register
 * - GPIO_GACR - GPIO Attribute Checker Register
 */

#define GPIO_INSTANCE_COUNT (9U) /*!< Number of instances of the GPIO module. */
#define GPIOA_IDX (0U) /*!< Instance number for GPIOA. */
#define GPIOB_IDX (1U) /*!< Instance number for GPIOB. */
#define GPIOC_IDX (2U) /*!< Instance number for GPIOC. */
#define GPIOD_IDX (3U) /*!< Instance number for GPIOD. */
#define GPIOE_IDX (4U) /*!< Instance number for GPIOE. */
#define GPIOF_IDX (5U) /*!< Instance number for GPIOF. */
#define GPIOG_IDX (6U) /*!< Instance number for GPIOG. */
#define GPIOH_IDX (7U) /*!< Instance number for GPIOH. */
#define GPIOI_IDX (8U) /*!< Instance number for GPIOI. */

/*******************************************************************************
 * GPIO_PDOR - Port Data Output Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDOR - Port Data Output Register (RW)
 *
 * Reset value: 0x00U
 *
 * This register configures the logic levels that are driven on each
 * general-purpose output pins. Do not modify pin configuration registers associated with
 * pins not available in your selected package. All un-bonded pins not available in
 * your package will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDOR register
 */
/*@{*/
#define GPIO_RD_PDOR(base)       (GPIO_PDOR_REG(base))
#define GPIO_WR_PDOR(base, value) (GPIO_PDOR_REG(base) = (value))
#define GPIO_SET_PDOR(base, value) (BME_OR8(&GPIO_PDOR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_PDOR(base, value) (BME_AND8(&GPIO_PDOR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_PDOR(base, value) (BME_XOR8(&GPIO_PDOR_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * GPIO_PDIR - Port Data Input Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDIR - Port Data Input Register (RO)
 *
 * Reset value: 0x00U
 *
 * Do not modify pin configuration registers associated with pins not available
 * in your selected package. All un-bonded pins not available in your package
 * will default to DISABLE state for lowest power consumption.
 */
/*!
 * @name Constants and macros for entire GPIO_PDIR register
 */
/*@{*/
#define GPIO_RD_PDIR(base)       (GPIO_PDIR_REG(base))
/*@}*/

/*******************************************************************************
 * GPIO_PDDR - Port Data Direction Register
 ******************************************************************************/

/*!
 * @brief GPIO_PDDR - Port Data Direction Register (RW)
 *
 * Reset value: 0x00U
 *
 * The PDDR configures the individual port pins for input or output.
 */
/*!
 * @name Constants and macros for entire GPIO_PDDR register
 */
/*@{*/
#define GPIO_RD_PDDR(base)       (GPIO_PDDR_REG(base))
#define GPIO_WR_PDDR(base, value) (GPIO_PDDR_REG(base) = (value))
#define GPIO_SET_PDDR(base, value) (BME_OR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_PDDR(base, value) (BME_AND8(&GPIO_PDDR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_PDDR(base, value) (BME_XOR8(&GPIO_PDDR_REG(base), (uint8_t)(value)))
/*@}*/

/*******************************************************************************
 * GPIO_GACR - GPIO Attribute Checker Register
 ******************************************************************************/

/*!
 * @brief GPIO_GACR - GPIO Attribute Checker Register (RW)
 *
 * Reset value: 0x00U
 *
 * The GPIO module supports a device-specific number of data ports GPIO supports
 * single-cycle accesses from the processor core IOPORT bus as well as
 * references from the PBRIDGE-mapped address space. Since the core's IOPORT does not
 * support any type of bus stalls or error terminations, if an IOPORT access fails
 * the attribute checks, it is treated as a RAZ/WI access, that is, reads-as-zero
 * and writes ignored. GPIO GACRn register is checked for PBRDIGE accesses only if
 * the corresponding PACRn register allowed the reference. The appropriate PACRn
 * controls access rights to the entire GPIO address space, while the GACRn
 * registers define the access rights down to the byte level for the actual data
 * ports.
 */
/*!
 * @name Constants and macros for entire GPIO_GACR register
 */
/*@{*/
#define GPIO_RD_GACR(base)       (GPIO_GACR_REG(base))
#define GPIO_WR_GACR(base, value) (GPIO_GACR_REG(base) = (value))
#define GPIO_SET_GACR(base, value) (BME_OR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
#define GPIO_CLR_GACR(base, value) (BME_AND8(&GPIO_GACR_REG(base), (uint8_t)(~(value))))
#define GPIO_TOG_GACR(base, value) (BME_XOR8(&GPIO_GACR_REG(base), (uint8_t)(value)))
/*@}*/

