pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual GPIO_GACR bitfields
 */

/*!
 * @name Register GPIO_GACR, field ACB[2:0] (RW)
 *
 * This 3 bit field defines the attributes required to access the corresponding
 * GPIO port's programming model.
 *
 * Values:
 * - 000 - User nonsecure: Read + Write; User Secure: Read + Write; Privileged
 *     Secure: Read + Write
 * - 001 - User nonsecure: Read; User Secure: Read + Write; Privileged Secure:
 *     Read + Write
 * - 010 - User nonsecure: None; User Secure: Read + Write; Privileged Secure:
 *     Read + Write
 * - 011 - User nonsecure: Read; User Secure: Read; Privileged Secure: Read +
 *     Write
 * - 100 - User nonsecure: None; User Secure: Read; Privileged Secure: Read +
 *     Write
 * - 101 - User nonsecure: None; User Secure: None; Privileged Secure: Read +
 *     Write
 * - 110 - User nonsecure: None; User Secure: None; Privileged Secure: Read
 * - 111 - User nonsecure: None; User Secure: None; Privileged Secure: None
 */
/*@{*/
/*! @brief Read current value of the GPIO_GACR_ACB field. */
#define GPIO_RD_GACR_ACB(base) ((GPIO_GACR_REG(base) & GPIO_GACR_ACB_MASK) >> GPIO_GACR_ACB_SHIFT)
#define GPIO_BRD_GACR_ACB(base) (BME_UBFX8(&GPIO_GACR_REG(base), GPIO_GACR_ACB_SHIFT, GPIO_GACR_ACB_WIDTH))

/*! @brief Set the ACB field to a new value. */
#define GPIO_WR_GACR_ACB(base, value) (GPIO_WR_GACR(base, (GPIO_RD_GACR(base) & ~GPIO_GACR_ACB_MASK) | GPIO_GACR_ACB(value)))
#define GPIO_BWR_GACR_ACB(base, value) (BME_BFI8(&GPIO_GACR_REG(base), ((uint8_t)(value) << GPIO_GACR_ACB_SHIFT), GPIO_GACR_ACB_SHIFT, GPIO_GACR_ACB_WIDTH))
/*@}*/

/*!
 * @name Register GPIO_GACR, field ROB[7] (RW)
 *
 * This register bit provides a mechanism to "lock" the configuration state
 * defined by ACB. Once asserted, this bit remains set and attempted writes to the
 * ACB are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ACB are allowed.
 * - 1 - Writes to the ACB are ignored.
 */
/*@{*/
/*! @brief Read current value of the GPIO_GACR_ROB field. */
#define GPIO_RD_GACR_ROB(base) ((GPIO_GACR_REG(base) & GPIO_GACR_ROB_MASK) >> GPIO_GACR_ROB_SHIFT)
#define GPIO_BRD_GACR_ROB(base) (BME_UBFX8(&GPIO_GACR_REG(base), GPIO_GACR_ROB_SHIFT, GPIO_GACR_ROB_WIDTH))

/*! @brief Set the ROB field to a new value. */
#define GPIO_WR_GACR_ROB(base, value) (GPIO_WR_GACR(base, (GPIO_RD_GACR(base) & ~GPIO_GACR_ROB_MASK) | GPIO_GACR_ROB(value)))
#define GPIO_BWR_GACR_ROB(base, value) (BME_BFI8(&GPIO_GACR_REG(base), ((uint8_t)(value) << GPIO_GACR_ROB_SHIFT), GPIO_GACR_ROB_SHIFT, GPIO_GACR_ROB_WIDTH))
/*@}*/

/*
 * MKM14ZA5 I2C
 *
 * Inter-Integrated Circuit
 *
 * Registers defined in this header file:
 * - I2C_A1 - I2C Address Register 1
 * - I2C_F - I2C Frequency Divider register
 * - I2C_C1 - I2C Control Register 1
 * - I2C_S - I2C Status register
 * - I2C_D - I2C Data I/O register
 * - I2C_C2 - I2C Control Register 2
 * - I2C_FLT - I2C Programmable Input Glitch Filter Register
 * - I2C_RA - I2C Range Address register
 * - I2C_SMB - I2C SMBus Control and Status register
 * - I2C_A2 - I2C Address Register 2
 * - I2C_SLTH - I2C SCL Low Timeout Register High
 * - I2C_SLTL - I2C SCL Low Timeout Register Low
 */

#define I2C_INSTANCE_COUNT (2U) /*!< Number of instances of the I2C module. */
#define I2C0_IDX (0U) /*!< Instance number for I2C0. */
#define I2C1_IDX (1U) /*!< Instance number for I2C1. */

/*******************************************************************************
 * I2C_A1 - I2C Address Register 1
 ******************************************************************************/

/*!
 * @brief I2C_A1 - I2C Address Register 1 (RW)
 *
 * Reset value: 0x00U
 *
 * This register contains the slave address to be used by the I2C module.
 */
/*!
 * @name Constants and macros for entire I2C_A1 register
 */
/*@{*/
#define I2C_RD_A1(base)          (I2C_A1_REG(base))
#define I2C_WR_A1(base, value)   (I2C_A1_REG(base) = (value))
#define I2C_SET_A1(base, value)  (BME_OR8(&I2C_A1_REG(base), (uint8_t)(value)))
#define I2C_CLR_A1(base, value)  (BME_AND8(&I2C_A1_REG(base), (uint8_t)(~(value))))
#define I2C_TOG_A1(base, value)  (BME_XOR8(&I2C_A1_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual I2C_A1 bitfields
 */

/*!
 * @name Register I2C_A1, field AD[7:1] (RW)
 *
 * Contains the primary slave address used by the I2C module when it is
 * addressed as a slave. This field is used in the 7-bit address scheme and the lower
 * seven bits in the 10-bit address scheme.
 */
/*@{*/
/*! @brief Read current value of the I2C_A1_AD field. */
#define I2C_RD_A1_AD(base)   ((I2C_A1_REG(base) & I2C_A1_AD_MASK) >> I2C_A1_AD_SHIFT)
#define I2C_BRD_A1_AD(base)  (BME_UBFX8(&I2C_A1_REG(base), I2C_A1_AD_SHIFT, I2C_A1_AD_WIDTH))

/*! @brief Set the AD field to a new value. */
#define I2C_WR_A1_AD(base, value) (I2C_WR_A1(base, (I2C_RD_A1(base) & ~I2C_A1_AD_MASK) | I2C_A1_AD(value)))
#define I2C_BWR_A1_AD(base, value) (BME_BFI8(&I2C_A1_REG(base), ((uint8_t)(value) << I2C_A1_AD_SHIFT), I2C_A1_AD_SHIFT, I2C_A1_AD_WIDTH))
/*@}*/

/*******************************************************************************
 * I2C_F - I2C Frequency Divider register
 ******************************************************************************/

/*!
 * @brief I2C_F - I2C Frequency Divider register (RW)
 *
 * Reset value: 0x00U
 */
/*!
 * @name Constants and macros for entire I2C_F register
 */
/*@{*/
#define I2C_RD_F(base)           (I2C_F_REG(base))
#define I2C_WR_F(base, value)    (I2C_F_REG(base) = (value))
#define I2C_SET_F(base, value)   (BME_OR8(&I2C_F_REG(base), (uint8_t)(value)))
#define I2C_CLR_F(base, value)   (BME_AND8(&I2C_F_REG(base), (uint8_t)(~(value))))
#define I2C_TOG_F(base, value)   (BME_XOR8(&I2C_F_REG(base), (uint8_t)(value)))
/*@}*/

/*
 * Constants & macros for individual I2C_F bitfields
 */

/*!
 * @name Register I2C_F, field ICR[5:0] (RW)
 *
 * Prescales the I2C module clock for bit rate selection. This field and the
 * MULT field determine the I2C baud rate, the SDA hold time, the SCL start hold
 * time, and the SCL stop hold time. For a list of values corresponding to each ICR
 * setting, see I2C divider and hold values. The SCL divider multiplied by
 * multiplier factor (mul) determines the I2C baud rate. I2C baud rate = I2C module
 * clock speed (Hz)/(mul * SCL divider) The SDA hold time is the delay from the
 * falling edge of SCL (I2C clock) to the changing of SDA (I2C data). SDA hold time =
 * I2C module clock period (s) * mul * SDA hold value The SCL start hold time is
 * the delay from the falling edge of SDA (I2C data) while SCL is high (start
 * condition) to the falling edge of SCL (I2C clock). SCL start hold time = I2C
 * module clock period (s) * mul * SCL start hold value The SCL stop hold time is
 * the delay from the rising edge of SCL (I2C clock) to the rising edge of SDA (I2C
 * data) while SCL is high (stop condition). SCL stop hold time = I2C module
 * clock period (s) * mul * SCL stop hold value For example, if the I2C module clock
 * speed is 8 MHz, the following table shows the possible hold time values with
 * different ICR and MULT selections to achieve an I2C baud rate of 100 kbit/s.
 * MULT ICR Hold times (us) SDA SCL Start SCL Stop 2h 00h 3.500 3.000 5.500 1h 07h
 * 2.500 4.000 5.250 1h 0Bh 2.250 4.000 5.250 0h 14h 2.125 4.250 5.125 0h 18h
 * 1.125 4.750 5.125
 */
/*@{*/
/*! @brief Read current value of the I2C_F_ICR field. */
#define I2C_RD_F_ICR(base)   ((I2C_F_REG(base) & I2C_F_ICR_MASK) >> I2C_F_ICR_SHIFT)
#define I2C_BRD_F_ICR(base)  (BME_UBFX8(&I2C_F_REG(base), I2C_F_ICR_SHIFT, I2C_F_ICR_WIDTH))

