pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual LCD_WF bitfields
 */

/*!
 * @name Register LCD_WF, field WF0[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P0 as described above for WF3.
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF0 field. */
#define LCD_RD_WF_WF0(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF0_MASK) >> LCD_WF_WF0_SHIFT)
#define LCD_BRD_WF_WF0(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF0_SHIFT, LCD_WF_WF0_WIDTH))

/*! @brief Set the WF0 field to a new value. */
#define LCD_WR_WF_WF0(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF0_MASK) | LCD_WF_WF0(value)))
#define LCD_BWR_WF_WF0(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF0_SHIFT), LCD_WF_WF0_SHIFT, LCD_WF_WF0_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF60[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P60 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF60 field. */
#define LCD_RD_WF_WF60(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF60_MASK) >> LCD_WF_WF60_SHIFT)
#define LCD_BRD_WF_WF60(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF60_SHIFT, LCD_WF_WF60_WIDTH))

/*! @brief Set the WF60 field to a new value. */
#define LCD_WR_WF_WF60(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF60_MASK) | LCD_WF_WF60(value)))
#define LCD_BWR_WF_WF60(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF60_SHIFT), LCD_WF_WF60_SHIFT, LCD_WF_WF60_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF56[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P56 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF56 field. */
#define LCD_RD_WF_WF56(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF56_MASK) >> LCD_WF_WF56_SHIFT)
#define LCD_BRD_WF_WF56(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF56_SHIFT, LCD_WF_WF56_WIDTH))

/*! @brief Set the WF56 field to a new value. */
#define LCD_WR_WF_WF56(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF56_MASK) | LCD_WF_WF56(value)))
#define LCD_BWR_WF_WF56(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF56_SHIFT), LCD_WF_WF56_SHIFT, LCD_WF_WF56_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF52[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P52 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF52 field. */
#define LCD_RD_WF_WF52(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF52_MASK) >> LCD_WF_WF52_SHIFT)
#define LCD_BRD_WF_WF52(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF52_SHIFT, LCD_WF_WF52_WIDTH))

/*! @brief Set the WF52 field to a new value. */
#define LCD_WR_WF_WF52(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF52_MASK) | LCD_WF_WF52(value)))
#define LCD_BWR_WF_WF52(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF52_SHIFT), LCD_WF_WF52_SHIFT, LCD_WF_WF52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF4[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P4 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF4 field. */
#define LCD_RD_WF_WF4(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF4_MASK) >> LCD_WF_WF4_SHIFT)
#define LCD_BRD_WF_WF4(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF4_SHIFT, LCD_WF_WF4_WIDTH))

/*! @brief Set the WF4 field to a new value. */
#define LCD_WR_WF_WF4(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF4_MASK) | LCD_WF_WF4(value)))
#define LCD_BWR_WF_WF4(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF4_SHIFT), LCD_WF_WF4_SHIFT, LCD_WF_WF4_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF48[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P48 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF48 field. */
#define LCD_RD_WF_WF48(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF48_MASK) >> LCD_WF_WF48_SHIFT)
#define LCD_BRD_WF_WF48(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF48_SHIFT, LCD_WF_WF48_WIDTH))

/*! @brief Set the WF48 field to a new value. */
#define LCD_WR_WF_WF48(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF48_MASK) | LCD_WF_WF48(value)))
#define LCD_BWR_WF_WF48(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF48_SHIFT), LCD_WF_WF48_SHIFT, LCD_WF_WF48_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF44[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P44 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF44 field. */
#define LCD_RD_WF_WF44(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF44_MASK) >> LCD_WF_WF44_SHIFT)
#define LCD_BRD_WF_WF44(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF44_SHIFT, LCD_WF_WF44_WIDTH))

/*! @brief Set the WF44 field to a new value. */
#define LCD_WR_WF_WF44(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF44_MASK) | LCD_WF_WF44(value)))
#define LCD_BWR_WF_WF44(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF44_SHIFT), LCD_WF_WF44_SHIFT, LCD_WF_WF44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF40[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P40 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF40 field. */
#define LCD_RD_WF_WF40(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF40_MASK) >> LCD_WF_WF40_SHIFT)
#define LCD_BRD_WF_WF40(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF40_SHIFT, LCD_WF_WF40_WIDTH))

/*! @brief Set the WF40 field to a new value. */
#define LCD_WR_WF_WF40(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF40_MASK) | LCD_WF_WF40(value)))
#define LCD_BWR_WF_WF40(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF40_SHIFT), LCD_WF_WF40_SHIFT, LCD_WF_WF40_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF8[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P8 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF8 field. */
#define LCD_RD_WF_WF8(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF8_MASK) >> LCD_WF_WF8_SHIFT)
#define LCD_BRD_WF_WF8(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF8_SHIFT, LCD_WF_WF8_WIDTH))

/*! @brief Set the WF8 field to a new value. */
#define LCD_WR_WF_WF8(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF8_MASK) | LCD_WF_WF8(value)))
#define LCD_BWR_WF_WF8(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF8_SHIFT), LCD_WF_WF8_SHIFT, LCD_WF_WF8_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF36[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P36 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF36 field. */
#define LCD_RD_WF_WF36(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF36_MASK) >> LCD_WF_WF36_SHIFT)
#define LCD_BRD_WF_WF36(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF36_SHIFT, LCD_WF_WF36_WIDTH))

/*! @brief Set the WF36 field to a new value. */
#define LCD_WR_WF_WF36(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF36_MASK) | LCD_WF_WF36(value)))
#define LCD_BWR_WF_WF36(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF36_SHIFT), LCD_WF_WF36_SHIFT, LCD_WF_WF36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF32[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P32 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF32 field. */
#define LCD_RD_WF_WF32(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF32_MASK) >> LCD_WF_WF32_SHIFT)
#define LCD_BRD_WF_WF32(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF32_SHIFT, LCD_WF_WF32_WIDTH))

/*! @brief Set the WF32 field to a new value. */
#define LCD_WR_WF_WF32(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF32_MASK) | LCD_WF_WF32(value)))
#define LCD_BWR_WF_WF32(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF32_SHIFT), LCD_WF_WF32_SHIFT, LCD_WF_WF32_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF28[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P28 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF28 field. */
#define LCD_RD_WF_WF28(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF28_MASK) >> LCD_WF_WF28_SHIFT)
#define LCD_BRD_WF_WF28(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF28_SHIFT, LCD_WF_WF28_WIDTH))

/*! @brief Set the WF28 field to a new value. */
#define LCD_WR_WF_WF28(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF28_MASK) | LCD_WF_WF28(value)))
#define LCD_BWR_WF_WF28(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF28_SHIFT), LCD_WF_WF28_SHIFT, LCD_WF_WF28_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF12[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P12 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF12 field. */
#define LCD_RD_WF_WF12(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF12_MASK) >> LCD_WF_WF12_SHIFT)
#define LCD_BRD_WF_WF12(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF12_SHIFT, LCD_WF_WF12_WIDTH))

/*! @brief Set the WF12 field to a new value. */
#define LCD_WR_WF_WF12(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF12_MASK) | LCD_WF_WF12(value)))
#define LCD_BWR_WF_WF12(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF12_SHIFT), LCD_WF_WF12_SHIFT, LCD_WF_WF12_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF24[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P24 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF24 field. */
#define LCD_RD_WF_WF24(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF24_MASK) >> LCD_WF_WF24_SHIFT)
#define LCD_BRD_WF_WF24(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF24_SHIFT, LCD_WF_WF24_WIDTH))

/*! @brief Set the WF24 field to a new value. */
#define LCD_WR_WF_WF24(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF24_MASK) | LCD_WF_WF24(value)))
#define LCD_BWR_WF_WF24(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF24_SHIFT), LCD_WF_WF24_SHIFT, LCD_WF_WF24_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF20[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P20 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF20 field. */
#define LCD_RD_WF_WF20(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF20_MASK) >> LCD_WF_WF20_SHIFT)
#define LCD_BRD_WF_WF20(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF20_SHIFT, LCD_WF_WF20_WIDTH))

/*! @brief Set the WF20 field to a new value. */
#define LCD_WR_WF_WF20(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF20_MASK) | LCD_WF_WF20(value)))
#define LCD_BWR_WF_WF20(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF20_SHIFT), LCD_WF_WF20_SHIFT, LCD_WF_WF20_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF16[7:0] (RW)
 *
 * Controls segments or phases connected to LCD_P16 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF16 field. */
#define LCD_RD_WF_WF16(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF16_MASK) >> LCD_WF_WF16_SHIFT)
#define LCD_BRD_WF_WF16(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF16_SHIFT, LCD_WF_WF16_WIDTH))

/*! @brief Set the WF16 field to a new value. */
#define LCD_WR_WF_WF16(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF16_MASK) | LCD_WF_WF16(value)))
#define LCD_BWR_WF_WF16(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF16_SHIFT), LCD_WF_WF16_SHIFT, LCD_WF_WF16_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF5[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P5 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF5 field. */
#define LCD_RD_WF_WF5(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF5_MASK) >> LCD_WF_WF5_SHIFT)
#define LCD_BRD_WF_WF5(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF5_SHIFT, LCD_WF_WF5_WIDTH))

/*! @brief Set the WF5 field to a new value. */
#define LCD_WR_WF_WF5(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF5_MASK) | LCD_WF_WF5(value)))
#define LCD_BWR_WF_WF5(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF5_SHIFT), LCD_WF_WF5_SHIFT, LCD_WF_WF5_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF49[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P49 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF49 field. */
#define LCD_RD_WF_WF49(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF49_MASK) >> LCD_WF_WF49_SHIFT)
#define LCD_BRD_WF_WF49(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF49_SHIFT, LCD_WF_WF49_WIDTH))

/*! @brief Set the WF49 field to a new value. */
#define LCD_WR_WF_WF49(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF49_MASK) | LCD_WF_WF49(value)))
#define LCD_BWR_WF_WF49(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF49_SHIFT), LCD_WF_WF49_SHIFT, LCD_WF_WF49_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF45[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P45 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF45 field. */
#define LCD_RD_WF_WF45(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF45_MASK) >> LCD_WF_WF45_SHIFT)
#define LCD_BRD_WF_WF45(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF45_SHIFT, LCD_WF_WF45_WIDTH))

/*! @brief Set the WF45 field to a new value. */
#define LCD_WR_WF_WF45(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF45_MASK) | LCD_WF_WF45(value)))
#define LCD_BWR_WF_WF45(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF45_SHIFT), LCD_WF_WF45_SHIFT, LCD_WF_WF45_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF61[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P61 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF61 field. */
#define LCD_RD_WF_WF61(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF61_MASK) >> LCD_WF_WF61_SHIFT)
#define LCD_BRD_WF_WF61(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF61_SHIFT, LCD_WF_WF61_WIDTH))

/*! @brief Set the WF61 field to a new value. */
#define LCD_WR_WF_WF61(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF61_MASK) | LCD_WF_WF61(value)))
#define LCD_BWR_WF_WF61(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF61_SHIFT), LCD_WF_WF61_SHIFT, LCD_WF_WF61_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF25[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P25 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF25 field. */
#define LCD_RD_WF_WF25(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF25_MASK) >> LCD_WF_WF25_SHIFT)
#define LCD_BRD_WF_WF25(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF25_SHIFT, LCD_WF_WF25_WIDTH))

/*! @brief Set the WF25 field to a new value. */
#define LCD_WR_WF_WF25(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF25_MASK) | LCD_WF_WF25(value)))
#define LCD_BWR_WF_WF25(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF25_SHIFT), LCD_WF_WF25_SHIFT, LCD_WF_WF25_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF17[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P17 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF17 field. */
#define LCD_RD_WF_WF17(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF17_MASK) >> LCD_WF_WF17_SHIFT)
#define LCD_BRD_WF_WF17(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF17_SHIFT, LCD_WF_WF17_WIDTH))

/*! @brief Set the WF17 field to a new value. */
#define LCD_WR_WF_WF17(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF17_MASK) | LCD_WF_WF17(value)))
#define LCD_BWR_WF_WF17(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF17_SHIFT), LCD_WF_WF17_SHIFT, LCD_WF_WF17_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF41[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P41 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF41 field. */
#define LCD_RD_WF_WF41(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF41_MASK) >> LCD_WF_WF41_SHIFT)
#define LCD_BRD_WF_WF41(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF41_SHIFT, LCD_WF_WF41_WIDTH))

/*! @brief Set the WF41 field to a new value. */
#define LCD_WR_WF_WF41(base, index, value) (LCD_WR_WF(base, index, (LCD_RD_WF(base, index) & ~LCD_WF_WF41_MASK) | LCD_WF_WF41(value)))
#define LCD_BWR_WF_WF41(base, index, value) (BME_BFI32(&LCD_WF_REG(base, index), ((uint32_t)(value) << LCD_WF_WF41_SHIFT), LCD_WF_WF41_SHIFT, LCD_WF_WF41_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF, field WF13[15:8] (RW)
 *
 * Controls segments or phases connected to LCD_P13 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF13 field. */
#define LCD_RD_WF_WF13(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF13_MASK) >> LCD_WF_WF13_SHIFT)
#define LCD_BRD_WF_WF13(base, index) (BME_UBFX32(&LCD_WF_REG(base, index), LCD_WF_WF13_SHIFT, LCD_WF_WF13_WIDTH))

