pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the BPDLCD33 field to a new value. */
#define LCD_WR_WF8B_BPDLCD33(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD33_MASK) | LCD_WF8B_BPDLCD33(value)))
#define LCD_BWR_WF8B_BPDLCD33(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD33_SHIFT), LCD_WF8B_BPDLCD33_SHIFT, LCD_WF8B_BPDLCD33_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD34[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD34 field. */
#define LCD_RD_WF8B_BPDLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD34_MASK) >> LCD_WF8B_BPDLCD34_SHIFT)
#define LCD_BRD_WF8B_BPDLCD34(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD34_SHIFT, LCD_WF8B_BPDLCD34_WIDTH))

/*! @brief Set the BPDLCD34 field to a new value. */
#define LCD_WR_WF8B_BPDLCD34(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD34_MASK) | LCD_WF8B_BPDLCD34(value)))
#define LCD_BWR_WF8B_BPDLCD34(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD34_SHIFT), LCD_WF8B_BPDLCD34_SHIFT, LCD_WF8B_BPDLCD34_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD29[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD29 field. */
#define LCD_RD_WF8B_BPDLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD29_MASK) >> LCD_WF8B_BPDLCD29_SHIFT)
#define LCD_BRD_WF8B_BPDLCD29(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD29_SHIFT, LCD_WF8B_BPDLCD29_WIDTH))

/*! @brief Set the BPDLCD29 field to a new value. */
#define LCD_WR_WF8B_BPDLCD29(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD29_MASK) | LCD_WF8B_BPDLCD29(value)))
#define LCD_BWR_WF8B_BPDLCD29(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD29_SHIFT), LCD_WF8B_BPDLCD29_SHIFT, LCD_WF8B_BPDLCD29_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD58[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD58 field. */
#define LCD_RD_WF8B_BPDLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD58_MASK) >> LCD_WF8B_BPDLCD58_SHIFT)
#define LCD_BRD_WF8B_BPDLCD58(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD58_SHIFT, LCD_WF8B_BPDLCD58_WIDTH))

/*! @brief Set the BPDLCD58 field to a new value. */
#define LCD_WR_WF8B_BPDLCD58(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD58_MASK) | LCD_WF8B_BPDLCD58(value)))
#define LCD_BWR_WF8B_BPDLCD58(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD58_SHIFT), LCD_WF8B_BPDLCD58_SHIFT, LCD_WF8B_BPDLCD58_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD57[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD57 field. */
#define LCD_RD_WF8B_BPDLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD57_MASK) >> LCD_WF8B_BPDLCD57_SHIFT)
#define LCD_BRD_WF8B_BPDLCD57(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD57_SHIFT, LCD_WF8B_BPDLCD57_WIDTH))

/*! @brief Set the BPDLCD57 field to a new value. */
#define LCD_WR_WF8B_BPDLCD57(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD57_MASK) | LCD_WF8B_BPDLCD57(value)))
#define LCD_BWR_WF8B_BPDLCD57(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD57_SHIFT), LCD_WF8B_BPDLCD57_SHIFT, LCD_WF8B_BPDLCD57_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD42[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD42 field. */
#define LCD_RD_WF8B_BPDLCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD42_MASK) >> LCD_WF8B_BPDLCD42_SHIFT)
#define LCD_BRD_WF8B_BPDLCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD42_SHIFT, LCD_WF8B_BPDLCD42_WIDTH))

/*! @brief Set the BPDLCD42 field to a new value. */
#define LCD_WR_WF8B_BPDLCD42(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD42_MASK) | LCD_WF8B_BPDLCD42(value)))
#define LCD_BWR_WF8B_BPDLCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD42_SHIFT), LCD_WF8B_BPDLCD42_SHIFT, LCD_WF8B_BPDLCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD35[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD35 field. */
#define LCD_RD_WF8B_BPDLCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD35_MASK) >> LCD_WF8B_BPDLCD35_SHIFT)
#define LCD_BRD_WF8B_BPDLCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD35_SHIFT, LCD_WF8B_BPDLCD35_WIDTH))

/*! @brief Set the BPDLCD35 field to a new value. */
#define LCD_WR_WF8B_BPDLCD35(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD35_MASK) | LCD_WF8B_BPDLCD35(value)))
#define LCD_BWR_WF8B_BPDLCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD35_SHIFT), LCD_WF8B_BPDLCD35_SHIFT, LCD_WF8B_BPDLCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD52[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD52 field. */
#define LCD_RD_WF8B_BPDLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD52_MASK) >> LCD_WF8B_BPDLCD52_SHIFT)
#define LCD_BRD_WF8B_BPDLCD52(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD52_SHIFT, LCD_WF8B_BPDLCD52_WIDTH))

