pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the BPDLCD52 field to a new value. */
#define LCD_WR_WF8B_BPDLCD52(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD52_MASK) | LCD_WF8B_BPDLCD52(value)))
#define LCD_BWR_WF8B_BPDLCD52(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD52_SHIFT), LCD_WF8B_BPDLCD52_SHIFT, LCD_WF8B_BPDLCD52_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD7[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD7 field. */
#define LCD_RD_WF8B_BPDLCD7(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD7_MASK) >> LCD_WF8B_BPDLCD7_SHIFT)
#define LCD_BRD_WF8B_BPDLCD7(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD7_SHIFT, LCD_WF8B_BPDLCD7_WIDTH))

/*! @brief Set the BPDLCD7 field to a new value. */
#define LCD_WR_WF8B_BPDLCD7(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD7_MASK) | LCD_WF8B_BPDLCD7(value)))
#define LCD_BWR_WF8B_BPDLCD7(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD7_SHIFT), LCD_WF8B_BPDLCD7_SHIFT, LCD_WF8B_BPDLCD7_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD36[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD36 field. */
#define LCD_RD_WF8B_BPDLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD36_MASK) >> LCD_WF8B_BPDLCD36_SHIFT)
#define LCD_BRD_WF8B_BPDLCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD36_SHIFT, LCD_WF8B_BPDLCD36_WIDTH))

/*! @brief Set the BPDLCD36 field to a new value. */
#define LCD_WR_WF8B_BPDLCD36(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD36_MASK) | LCD_WF8B_BPDLCD36(value)))
#define LCD_BWR_WF8B_BPDLCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD36_SHIFT), LCD_WF8B_BPDLCD36_SHIFT, LCD_WF8B_BPDLCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD30[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD30 field. */
#define LCD_RD_WF8B_BPDLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD30_MASK) >> LCD_WF8B_BPDLCD30_SHIFT)
#define LCD_BRD_WF8B_BPDLCD30(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD30_SHIFT, LCD_WF8B_BPDLCD30_WIDTH))

/*! @brief Set the BPDLCD30 field to a new value. */
#define LCD_WR_WF8B_BPDLCD30(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD30_MASK) | LCD_WF8B_BPDLCD30(value)))
#define LCD_BWR_WF8B_BPDLCD30(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD30_SHIFT), LCD_WF8B_BPDLCD30_SHIFT, LCD_WF8B_BPDLCD30_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD41[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD41 field. */
#define LCD_RD_WF8B_BPDLCD41(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD41_MASK) >> LCD_WF8B_BPDLCD41_SHIFT)
#define LCD_BRD_WF8B_BPDLCD41(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD41_SHIFT, LCD_WF8B_BPDLCD41_WIDTH))

/*! @brief Set the BPDLCD41 field to a new value. */
#define LCD_WR_WF8B_BPDLCD41(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD41_MASK) | LCD_WF8B_BPDLCD41(value)))
#define LCD_BWR_WF8B_BPDLCD41(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD41_SHIFT), LCD_WF8B_BPDLCD41_SHIFT, LCD_WF8B_BPDLCD41_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD37[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD37 field. */
#define LCD_RD_WF8B_BPDLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD37_MASK) >> LCD_WF8B_BPDLCD37_SHIFT)
#define LCD_BRD_WF8B_BPDLCD37(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD37_SHIFT, LCD_WF8B_BPDLCD37_WIDTH))

/*! @brief Set the BPDLCD37 field to a new value. */
#define LCD_WR_WF8B_BPDLCD37(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD37_MASK) | LCD_WF8B_BPDLCD37(value)))
#define LCD_BWR_WF8B_BPDLCD37(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD37_SHIFT), LCD_WF8B_BPDLCD37_SHIFT, LCD_WF8B_BPDLCD37_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD44[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD44 field. */
#define LCD_RD_WF8B_BPDLCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD44_MASK) >> LCD_WF8B_BPDLCD44_SHIFT)
#define LCD_BRD_WF8B_BPDLCD44(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD44_SHIFT, LCD_WF8B_BPDLCD44_WIDTH))

/*! @brief Set the BPDLCD44 field to a new value. */
#define LCD_WR_WF8B_BPDLCD44(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPDLCD44_MASK) | LCD_WF8B_BPDLCD44(value)))
#define LCD_BWR_WF8B_BPDLCD44(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPDLCD44_SHIFT), LCD_WF8B_BPDLCD44_SHIFT, LCD_WF8B_BPDLCD44_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPDLCD63[3] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase D
 * - 1 - LCD segment on or LCD backplane active for phase D
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPDLCD63 field. */
#define LCD_RD_WF8B_BPDLCD63(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPDLCD63_MASK) >> LCD_WF8B_BPDLCD63_SHIFT)
#define LCD_BRD_WF8B_BPDLCD63(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPDLCD63_SHIFT, LCD_WF8B_BPDLCD63_WIDTH))

