pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the BPELCD41 field to a new value. */
#define LCD_WR_WF8B_BPELCD41(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD41_MASK) | LCD_WF8B_BPELCD41(value)))
#define LCD_BWR_WF8B_BPELCD41(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD41_SHIFT), LCD_WF8B_BPELCD41_SHIFT, LCD_WF8B_BPELCD41_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD36[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD36 field. */
#define LCD_RD_WF8B_BPELCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD36_MASK) >> LCD_WF8B_BPELCD36_SHIFT)
#define LCD_BRD_WF8B_BPELCD36(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD36_SHIFT, LCD_WF8B_BPELCD36_WIDTH))

/*! @brief Set the BPELCD36 field to a new value. */
#define LCD_WR_WF8B_BPELCD36(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD36_MASK) | LCD_WF8B_BPELCD36(value)))
#define LCD_BWR_WF8B_BPELCD36(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD36_SHIFT), LCD_WF8B_BPELCD36_SHIFT, LCD_WF8B_BPELCD36_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD8[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD8 field. */
#define LCD_RD_WF8B_BPELCD8(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD8_MASK) >> LCD_WF8B_BPELCD8_SHIFT)
#define LCD_BRD_WF8B_BPELCD8(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD8_SHIFT, LCD_WF8B_BPELCD8_WIDTH))

/*! @brief Set the BPELCD8 field to a new value. */
#define LCD_WR_WF8B_BPELCD8(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD8_MASK) | LCD_WF8B_BPELCD8(value)))
#define LCD_BWR_WF8B_BPELCD8(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD8_SHIFT), LCD_WF8B_BPELCD8_SHIFT, LCD_WF8B_BPELCD8_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD35[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD35 field. */
#define LCD_RD_WF8B_BPELCD35(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD35_MASK) >> LCD_WF8B_BPELCD35_SHIFT)
#define LCD_BRD_WF8B_BPELCD35(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD35_SHIFT, LCD_WF8B_BPELCD35_WIDTH))

/*! @brief Set the BPELCD35 field to a new value. */
#define LCD_WR_WF8B_BPELCD35(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD35_MASK) | LCD_WF8B_BPELCD35(value)))
#define LCD_BWR_WF8B_BPELCD35(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD35_SHIFT), LCD_WF8B_BPELCD35_SHIFT, LCD_WF8B_BPELCD35_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD42[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD42 field. */
#define LCD_RD_WF8B_BPELCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD42_MASK) >> LCD_WF8B_BPELCD42_SHIFT)
#define LCD_BRD_WF8B_BPELCD42(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD42_SHIFT, LCD_WF8B_BPELCD42_WIDTH))

/*! @brief Set the BPELCD42 field to a new value. */
#define LCD_WR_WF8B_BPELCD42(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD42_MASK) | LCD_WF8B_BPELCD42(value)))
#define LCD_BWR_WF8B_BPELCD42(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD42_SHIFT), LCD_WF8B_BPELCD42_SHIFT, LCD_WF8B_BPELCD42_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD34[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD34 field. */
#define LCD_RD_WF8B_BPELCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD34_MASK) >> LCD_WF8B_BPELCD34_SHIFT)
#define LCD_BRD_WF8B_BPELCD34(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD34_SHIFT, LCD_WF8B_BPELCD34_WIDTH))

/*! @brief Set the BPELCD34 field to a new value. */
#define LCD_WR_WF8B_BPELCD34(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD34_MASK) | LCD_WF8B_BPELCD34(value)))
#define LCD_BWR_WF8B_BPELCD34(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD34_SHIFT), LCD_WF8B_BPELCD34_SHIFT, LCD_WF8B_BPELCD34_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD33[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD33 field. */
#define LCD_RD_WF8B_BPELCD33(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD33_MASK) >> LCD_WF8B_BPELCD33_SHIFT)
#define LCD_BRD_WF8B_BPELCD33(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD33_SHIFT, LCD_WF8B_BPELCD33_WIDTH))

/*! @brief Set the BPELCD33 field to a new value. */
#define LCD_WR_WF8B_BPELCD33(base, index, value) (LCD_WR_WF8B(base, index, (LCD_RD_WF8B(base, index) & ~LCD_WF8B_BPELCD33_MASK) | LCD_WF8B_BPELCD33(value)))
#define LCD_BWR_WF8B_BPELCD33(base, index, value) (BME_BFI8(&LCD_WF8B_REG(base, index), ((uint8_t)(value) << LCD_WF8B_BPELCD33_SHIFT), LCD_WF8B_BPELCD33_SHIFT, LCD_WF8B_BPELCD33_WIDTH))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPELCD11[4] (RW)
 *
 * Values:
 * - 0 - LCD segment off or LCD backplane inactive for phase E
 * - 1 - LCD segment on or LCD backplane active for phase E
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPELCD11 field. */
#define LCD_RD_WF8B_BPELCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPELCD11_MASK) >> LCD_WF8B_BPELCD11_SHIFT)
#define LCD_BRD_WF8B_BPELCD11(base, index) (BME_UBFX8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPELCD11_SHIFT, LCD_WF8B_BPELCD11_WIDTH))

