pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * MCM_PID - Process ID register
 ******************************************************************************/

/*!
 * @brief MCM_PID - Process ID register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register drives the M0_PID value in the Memory Protection Unit (MPU).
 * System software loads this register before passing control to a given user mode
 * process. If the PID of the process does not match the value in this register,
 * a bus error occurs. See the MPU chapter for more details.
 */
/*!
 * @name Constants and macros for entire MCM_PID register
 */
/*@{*/
#define MCM_RD_PID(base)         (MCM_PID_REG(base))
#define MCM_WR_PID(base, value)  (MCM_PID_REG(base) = (value))
#define MCM_SET_PID(base, value) (MCM_WR_PID(base, MCM_RD_PID(base) |  (value)))
#define MCM_CLR_PID(base, value) (MCM_WR_PID(base, MCM_RD_PID(base) & ~(value)))
#define MCM_TOG_PID(base, value) (MCM_WR_PID(base, MCM_RD_PID(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_PID bitfields
 */

/*!
 * @name Register MCM_PID, field PID[7:0] (RW)
 *
 * Drives the M0_PID value in the MPU.
 *
 * Values:
 * - 0 - Reserved for privileged secure tasks
 */
/*@{*/
/*! @brief Read current value of the MCM_PID_PID field. */
#define MCM_RD_PID_PID(base) ((MCM_PID_REG(base) & MCM_PID_PID_MASK) >> MCM_PID_PID_SHIFT)
#define MCM_BRD_PID_PID(base) (MCM_RD_PID_PID(base))

/*! @brief Set the PID field to a new value. */
#define MCM_WR_PID_PID(base, value) (MCM_WR_PID(base, (MCM_RD_PID(base) & ~MCM_PID_PID_MASK) | MCM_PID_PID(value)))
#define MCM_BWR_PID_PID(base, value) (MCM_WR_PID_PID(base, value))
/*@}*/

/*******************************************************************************
 * MCM_CPO - Compute Operation Control Register
 ******************************************************************************/

/*!
 * @brief MCM_CPO - Compute Operation Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register controls the Compute Operation.
 */
/*!
 * @name Constants and macros for entire MCM_CPO register
 */
/*@{*/
#define MCM_RD_CPO(base)         (MCM_CPO_REG(base))
#define MCM_WR_CPO(base, value)  (MCM_CPO_REG(base) = (value))
#define MCM_SET_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) |  (value)))
#define MCM_CLR_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) & ~(value)))
#define MCM_TOG_CPO(base, value) (MCM_WR_CPO(base, MCM_RD_CPO(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual MCM_CPO bitfields
 */

/*!
 * @name Register MCM_CPO, field CPOREQ[0] (RW)
 *
 * This bit is auto-cleared by vector fetching if CPOWOI = 1.
 *
 * Values:
 * - 0 - Request is cleared.
 * - 1 - Request Compute Operation.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOREQ field. */
#define MCM_RD_CPO_CPOREQ(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOREQ_MASK) >> MCM_CPO_CPOREQ_SHIFT)
#define MCM_BRD_CPO_CPOREQ(base) (MCM_RD_CPO_CPOREQ(base))

/*! @brief Set the CPOREQ field to a new value. */
#define MCM_WR_CPO_CPOREQ(base, value) (MCM_WR_CPO(base, (MCM_RD_CPO(base) & ~MCM_CPO_CPOREQ_MASK) | MCM_CPO_CPOREQ(value)))
#define MCM_BWR_CPO_CPOREQ(base, value) (MCM_WR_CPO_CPOREQ(base, value))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOACK[1] (RO)
 *
 * Values:
 * - 0 - Compute operation entry has not completed or compute operation exit has
 *     completed.
 * - 1 - Compute operation entry has completed or compute operation exit has not
 *     completed.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOACK field. */
#define MCM_RD_CPO_CPOACK(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOACK_MASK) >> MCM_CPO_CPOACK_SHIFT)
#define MCM_BRD_CPO_CPOACK(base) (MCM_RD_CPO_CPOACK(base))
/*@}*/

/*!
 * @name Register MCM_CPO, field CPOWOI[2] (RW)
 *
 * Values:
 * - 0 - No effect.
 * - 1 - When set, the CPOREQ is cleared on any interrupt or exception vector
 *     fetch.
 */
/*@{*/
/*! @brief Read current value of the MCM_CPO_CPOWOI field. */
#define MCM_RD_CPO_CPOWOI(base) ((MCM_CPO_REG(base) & MCM_CPO_CPOWOI_MASK) >> MCM_CPO_CPOWOI_SHIFT)
#define MCM_BRD_CPO_CPOWOI(base) (MCM_RD_CPO_CPOWOI(base))

/*! @brief Set the CPOWOI field to a new value. */
#define MCM_WR_CPO_CPOWOI(base, value) (MCM_WR_CPO(base, (MCM_RD_CPO(base) & ~MCM_CPO_CPOWOI_MASK) | MCM_CPO_CPOWOI(value)))
#define MCM_BWR_CPO_CPOWOI(base, value) (MCM_WR_CPO_CPOWOI(base, value))
/*@}*/

/*******************************************************************************
 * MCM_MATCR - Master Attribute Configuration Register
 ******************************************************************************/

/*!
 * @brief MCM_MATCR - Master Attribute Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This 32-bit register consists of four 8-bit attribute configuration register
 * fields for each system bus master. Each MATCRn register field allows the
 * corresponding bus master's secure/nonsecure and privileged/user attributes to be
 * forced to a static state, or simply enable the attributes generated by the
 * master module. This information is then used on a per bus transaction basis to
 * control access. See the MPU chapter for more details. For all ATCn values, if the
 * state indicates privileged (either statically or via the master module's
 * attribute), then the other state indicator is forced to secure. Writes to ATC0
 * configure the processor's master attributes, and software must take special care
 * with this value. Typically, the processor would use an ATC0 value of {0b11- or
 * 0b00-} because the other values can create a configuration where access to
 * system level resources is not allowed. Each MATCRn register field also contains a
 * lock bit (RO) that may be set to disable writes to the register, preserving
 * the configured state until the next system reset.
 */
/*!
 * @name Constants and macros for entire MCM_MATCR register
 */
/*@{*/
#define MCM_RD_MATCR(base, index) (MCM_MATCR_REG(base, index))
#define MCM_WR_MATCR(base, index, value) (MCM_MATCR_REG(base, index) = (value))
#define MCM_SET_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) |  (value)))
#define MCM_CLR_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) & ~(value)))
#define MCM_TOG_MATCR(base, index, value) (MCM_WR_MATCR(base, index, MCM_RD_MATCR(base, index) ^  (value)))
/*@}*/

