pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual MCM_MATCR bitfields
 */

/*!
 * @name Register MCM_MATCR, field ATC0[2:0] (RW)
 *
 * This 3-bit field defines the privileged/user and secure/nonsecure attribute
 * configurations.
 *
 * Values:
 * - 00x - Master attributes are statically forced to {privileged, secure}.
 * - 010 - Master attributes are statically forced to {user, secure}.
 * - 011 - Master attributes are statically forced to {user, nonsecure}.
 * - 100 - Enable master attribute {privileged or user} and statically force
 *     {secure}.
 * - 101 - Enable master attribute {privileged or user} and statically force
 *     {nonsecure}.
 * - 11x - Enable master attribute {privileged or user, secure or nonsecure}
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_ATC0 field. */
#define MCM_RD_MATCR_ATC0(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_ATC0_MASK) >> MCM_MATCR_ATC0_SHIFT)
#define MCM_BRD_MATCR_ATC0(base, index) (MCM_RD_MATCR_ATC0(base, index))

/*! @brief Set the ATC0 field to a new value. */
#define MCM_WR_MATCR_ATC0(base, index, value) (MCM_WR_MATCR(base, index, (MCM_RD_MATCR(base, index) & ~MCM_MATCR_ATC0_MASK) | MCM_MATCR_ATC0(value)))
#define MCM_BWR_MATCR_ATC0(base, index, value) (MCM_WR_MATCR_ATC0(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field RO0[7] (RW)
 *
 * This register bit provides a mechanism to lock the configuration state
 * defined by ATCn. Once asserted, this bit remains set and attempted writes to the
 * ATCn register are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ATCn are allowed.
 * - 1 - Writes to the ATCn are ignored.
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_RO0 field. */
#define MCM_RD_MATCR_RO0(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_RO0_MASK) >> MCM_MATCR_RO0_SHIFT)
#define MCM_BRD_MATCR_RO0(base, index) (MCM_RD_MATCR_RO0(base, index))

/*! @brief Set the RO0 field to a new value. */
#define MCM_WR_MATCR_RO0(base, index, value) (MCM_WR_MATCR(base, index, (MCM_RD_MATCR(base, index) & ~MCM_MATCR_RO0_MASK) | MCM_MATCR_RO0(value)))
#define MCM_BWR_MATCR_RO0(base, index, value) (MCM_WR_MATCR_RO0(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field ATC2[18:16] (RW)
 *
 * This 3-bit field defines the privileged/user and secure/nonsecure attribute
 * configurations.
 *
 * Values:
 * - 00x - Master attributes are statically forced to {privileged, secure}.
 * - 010 - Master attributes are statically forced to {user, secure}.
 * - 011 - Master attributes are statically forced to {user, nonsecure}.
 * - 100 - Enable master attribute {privileged or user} and statically force
 *     {secure}.
 * - 101 - Enable master attribute {privileged or user} and statically force
 *     {nonsecure}.
 * - 11x - Enable master attribute {privileged or user, secure or nonsecure}
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_ATC2 field. */
#define MCM_RD_MATCR_ATC2(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_ATC2_MASK) >> MCM_MATCR_ATC2_SHIFT)
#define MCM_BRD_MATCR_ATC2(base, index) (MCM_RD_MATCR_ATC2(base, index))

/*! @brief Set the ATC2 field to a new value. */
#define MCM_WR_MATCR_ATC2(base, index, value) (MCM_WR_MATCR(base, index, (MCM_RD_MATCR(base, index) & ~MCM_MATCR_ATC2_MASK) | MCM_MATCR_ATC2(value)))
#define MCM_BWR_MATCR_ATC2(base, index, value) (MCM_WR_MATCR_ATC2(base, index, value))
/*@}*/

/*!
 * @name Register MCM_MATCR, field RO2[23] (RW)
 *
 * This register bit provides a mechanism to lock the configuration state
 * defined by ATCn. Once asserted, this bit remains set and attempted writes to the
 * ATCn are ignored until the next system reset clears the flag.
 *
 * Values:
 * - 0 - Writes to the ATCn are allowed.
 * - 1 - Writes to the ATCn are ignored.
 */
/*@{*/
/*! @brief Read current value of the MCM_MATCR_RO2 field. */
#define MCM_RD_MATCR_RO2(base, index) ((MCM_MATCR_REG(base, index) & MCM_MATCR_RO2_MASK) >> MCM_MATCR_RO2_SHIFT)
#define MCM_BRD_MATCR_RO2(base, index) (MCM_RD_MATCR_RO2(base, index))

/*! @brief Set the RO2 field to a new value. */
#define MCM_WR_MATCR_RO2(base, index, value) (MCM_WR_MATCR(base, index, (MCM_RD_MATCR(base, index) & ~MCM_MATCR_RO2_MASK) | MCM_MATCR_RO2(value)))
#define MCM_BWR_MATCR_RO2(base, index, value) (MCM_WR_MATCR_RO2(base, index, value))
/*@}*/

/*
 * MKM14ZA5 MPU
 *
 * Memory protection unit
 *
 * Registers defined in this header file:
 * - MPU_CESR - Control/Error Status Register
 * - MPU_EAR - Error Address Register, slave port n
 * - MPU_EDR - Error Detail Register, slave port n
 * - MPU_WORD - Region Descriptor n, Word 0
 * - MPU_RGDAAC - Region Descriptor Alternate Access Control n
 */

#define MPU_INSTANCE_COUNT (1U) /*!< Number of instances of the MPU module. */
#define MPU_IDX (0U) /*!< Instance number for MPU. */

/*******************************************************************************
 * MPU_CESR - Control/Error Status Register
 ******************************************************************************/

/*!
 * @brief MPU_CESR - Control/Error Status Register (RW)
 *
 * Reset value: 0x00812001U
 */
/*!
 * @name Constants and macros for entire MPU_CESR register
 */
/*@{*/
#define MPU_RD_CESR(base)        (MPU_CESR_REG(base))
#define MPU_WR_CESR(base, value) (MPU_CESR_REG(base) = (value))
#define MPU_SET_CESR(base, value) (BME_OR32(&MPU_CESR_REG(base), (uint32_t)(value)))
#define MPU_CLR_CESR(base, value) (BME_AND32(&MPU_CESR_REG(base), (uint32_t)(~(value))))
#define MPU_TOG_CESR(base, value) (BME_XOR32(&MPU_CESR_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual MPU_CESR bitfields
 */

/*!
 * @name Register MPU_CESR, field VLD[0] (RW)
 *
 * Global enable/disable for the MPU.
 *
 * Values:
 * - 0 - MPU is disabled. All accesses from all bus masters are allowed.
 * - 1 - MPU is enabled
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_VLD field. */
#define MPU_RD_CESR_VLD(base) ((MPU_CESR_REG(base) & MPU_CESR_VLD_MASK) >> MPU_CESR_VLD_SHIFT)
#define MPU_BRD_CESR_VLD(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_VLD_SHIFT, MPU_CESR_VLD_WIDTH))

/*! @brief Set the VLD field to a new value. */
#define MPU_WR_CESR_VLD(base, value) (MPU_WR_CESR(base, (MPU_RD_CESR(base) & ~(MPU_CESR_VLD_MASK | MPU_CESR_SPERR_MASK)) | MPU_CESR_VLD(value)))
#define MPU_BWR_CESR_VLD(base, value) (BME_BFI32(&MPU_CESR_REG(base), ((uint32_t)(value) << MPU_CESR_VLD_SHIFT), MPU_CESR_VLD_SHIFT, MPU_CESR_VLD_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field NRGD[11:8] (RO)
 *
 * Indicates the number of region descriptors implemented in the MPU.
 *
 * Values:
 * - 0000 - 8 region descriptors
 * - 0001 - 12 region descriptors
 * - 0010 - 16 region descriptors
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_NRGD field. */
#define MPU_RD_CESR_NRGD(base) ((MPU_CESR_REG(base) & MPU_CESR_NRGD_MASK) >> MPU_CESR_NRGD_SHIFT)
#define MPU_BRD_CESR_NRGD(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_NRGD_SHIFT, MPU_CESR_NRGD_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field NSP[15:12] (RO)
 *
 * Specifies the number of slave ports connected to the MPU.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_NSP field. */
#define MPU_RD_CESR_NSP(base) ((MPU_CESR_REG(base) & MPU_CESR_NSP_MASK) >> MPU_CESR_NSP_SHIFT)
#define MPU_BRD_CESR_NSP(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_NSP_SHIFT, MPU_CESR_NSP_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field HRL[19:16] (RO)
 *
 * Specifies the MPU's hardware and definition revision level. It can be read by
 * software to determine the functional definition of the module.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_HRL field. */
#define MPU_RD_CESR_HRL(base) ((MPU_CESR_REG(base) & MPU_CESR_HRL_MASK) >> MPU_CESR_HRL_SHIFT)
#define MPU_BRD_CESR_HRL(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_HRL_SHIFT, MPU_CESR_HRL_WIDTH))
/*@}*/

/*!
 * @name Register MPU_CESR, field SPERR[31:30] (W1C)
 *
 * Indicates a captured error in EARn and EDRn. This bit is set when the
 * hardware detects an error and records the faulting address and attributes. It is
 * cleared by writing one to it. If another error is captured at the exact same cycle
 * as the write, the flag remains set. A find-first-one instruction or
 * equivalent can detect the presence of a captured error. The following shows the
 * correspondence between the bit number and slave port number: Bit 31 corresponds to
 * slave port 0. Bit 30 corresponds to slave port 1.
 *
 * Values:
 * - 0 - No error has occurred for slave port n.
 * - 1 - An error has occurred for slave port n.
 */
/*@{*/
/*! @brief Read current value of the MPU_CESR_SPERR field. */
#define MPU_RD_CESR_SPERR(base) ((MPU_CESR_REG(base) & MPU_CESR_SPERR_MASK) >> MPU_CESR_SPERR_SHIFT)
#define MPU_BRD_CESR_SPERR(base) (BME_UBFX32(&MPU_CESR_REG(base), MPU_CESR_SPERR_SHIFT, MPU_CESR_SPERR_WIDTH))

/*! @brief Set the SPERR field to a new value. */
#define MPU_WR_CESR_SPERR(base, value) (MPU_WR_CESR(base, (MPU_RD_CESR(base) & ~MPU_CESR_SPERR_MASK) | MPU_CESR_SPERR(value)))
#define MPU_BWR_CESR_SPERR(base, value) (BME_BFI32(&MPU_CESR_REG(base), ((uint32_t)(value) << MPU_CESR_SPERR_SHIFT), MPU_CESR_SPERR_SHIFT, MPU_CESR_SPERR_WIDTH))
/*@}*/

