pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the M3SM field to a new value. */
#define MPU_WR_RGDAAC_M3SM(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M3SM_MASK) | MPU_RGDAAC_M3SM(value)))
#define MPU_BWR_RGDAAC_M3SM(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M3SM_SHIFT), MPU_RGDAAC_M3SM_SHIFT, MPU_RGDAAC_M3SM_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M3PE[23] (RW)
 *
 * Values:
 * - 0 - Do not include the process identifier in the evaluation
 * - 1 - Include the process identifier and mask (RGDn.RGDAAC) in the region hit
 *     evaluation
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M3PE field. */
#define MPU_RD_RGDAAC_M3PE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M3PE_MASK) >> MPU_RGDAAC_M3PE_SHIFT)
#define MPU_BRD_RGDAAC_M3PE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M3PE_SHIFT, MPU_RGDAAC_M3PE_WIDTH))

/*! @brief Set the M3PE field to a new value. */
#define MPU_WR_RGDAAC_M3PE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M3PE_MASK) | MPU_RGDAAC_M3PE(value)))
#define MPU_BWR_RGDAAC_M3PE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M3PE_SHIFT), MPU_RGDAAC_M3PE_SHIFT, MPU_RGDAAC_M3PE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M4WE[24] (RW)
 *
 * Values:
 * - 0 - Bus master 4 writes terminate with an access error and the write is not
 *     performed
 * - 1 - Bus master 4 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M4WE field. */
#define MPU_RD_RGDAAC_M4WE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M4WE_MASK) >> MPU_RGDAAC_M4WE_SHIFT)
#define MPU_BRD_RGDAAC_M4WE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M4WE_SHIFT, MPU_RGDAAC_M4WE_WIDTH))

/*! @brief Set the M4WE field to a new value. */
#define MPU_WR_RGDAAC_M4WE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M4WE_MASK) | MPU_RGDAAC_M4WE(value)))
#define MPU_BWR_RGDAAC_M4WE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M4WE_SHIFT), MPU_RGDAAC_M4WE_SHIFT, MPU_RGDAAC_M4WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M4RE[25] (RW)
 *
 * Values:
 * - 0 - Bus master 4 reads terminate with an access error and the read is not
 *     performed
 * - 1 - Bus master 4 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M4RE field. */
#define MPU_RD_RGDAAC_M4RE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M4RE_MASK) >> MPU_RGDAAC_M4RE_SHIFT)
#define MPU_BRD_RGDAAC_M4RE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M4RE_SHIFT, MPU_RGDAAC_M4RE_WIDTH))

/*! @brief Set the M4RE field to a new value. */
#define MPU_WR_RGDAAC_M4RE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M4RE_MASK) | MPU_RGDAAC_M4RE(value)))
#define MPU_BWR_RGDAAC_M4RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M4RE_SHIFT), MPU_RGDAAC_M4RE_SHIFT, MPU_RGDAAC_M4RE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M5WE[26] (RW)
 *
 * Values:
 * - 0 - Bus master 5 writes terminate with an access error and the write is not
 *     performed
 * - 1 - Bus master 5 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M5WE field. */
#define MPU_RD_RGDAAC_M5WE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M5WE_MASK) >> MPU_RGDAAC_M5WE_SHIFT)
#define MPU_BRD_RGDAAC_M5WE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M5WE_SHIFT, MPU_RGDAAC_M5WE_WIDTH))

/*! @brief Set the M5WE field to a new value. */
#define MPU_WR_RGDAAC_M5WE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M5WE_MASK) | MPU_RGDAAC_M5WE(value)))
#define MPU_BWR_RGDAAC_M5WE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M5WE_SHIFT), MPU_RGDAAC_M5WE_SHIFT, MPU_RGDAAC_M5WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M5RE[27] (RW)
 *
 * Values:
 * - 0 - Bus master 5 reads terminate with an access error and the read is not
 *     performed
 * - 1 - Bus master 5 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M5RE field. */
#define MPU_RD_RGDAAC_M5RE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M5RE_MASK) >> MPU_RGDAAC_M5RE_SHIFT)
#define MPU_BRD_RGDAAC_M5RE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M5RE_SHIFT, MPU_RGDAAC_M5RE_WIDTH))

/*! @brief Set the M5RE field to a new value. */
#define MPU_WR_RGDAAC_M5RE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M5RE_MASK) | MPU_RGDAAC_M5RE(value)))
#define MPU_BWR_RGDAAC_M5RE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M5RE_SHIFT), MPU_RGDAAC_M5RE_SHIFT, MPU_RGDAAC_M5RE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M6WE[28] (RW)
 *
 * Values:
 * - 0 - Bus master 6 writes terminate with an access error and the write is not
 *     performed
 * - 1 - Bus master 6 writes allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M6WE field. */
#define MPU_RD_RGDAAC_M6WE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M6WE_MASK) >> MPU_RGDAAC_M6WE_SHIFT)
#define MPU_BRD_RGDAAC_M6WE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M6WE_SHIFT, MPU_RGDAAC_M6WE_WIDTH))

/*! @brief Set the M6WE field to a new value. */
#define MPU_WR_RGDAAC_M6WE(base, index, value) (MPU_WR_RGDAAC(base, index, (MPU_RD_RGDAAC(base, index) & ~MPU_RGDAAC_M6WE_MASK) | MPU_RGDAAC_M6WE(value)))
#define MPU_BWR_RGDAAC_M6WE(base, index, value) (BME_BFI32(&MPU_RGDAAC_REG(base, index), ((uint32_t)(value) << MPU_RGDAAC_M6WE_SHIFT), MPU_RGDAAC_M6WE_SHIFT, MPU_RGDAAC_M6WE_WIDTH))
/*@}*/

/*!
 * @name Register MPU_RGDAAC, field M6RE[29] (RW)
 *
 * Values:
 * - 0 - Bus master 6 reads terminate with an access error and the read is not
 *     performed
 * - 1 - Bus master 6 reads allowed
 */
/*@{*/
/*! @brief Read current value of the MPU_RGDAAC_M6RE field. */
#define MPU_RD_RGDAAC_M6RE(base, index) ((MPU_RGDAAC_REG(base, index) & MPU_RGDAAC_M6RE_MASK) >> MPU_RGDAAC_M6RE_SHIFT)
#define MPU_BRD_RGDAAC_M6RE(base, index) (BME_UBFX32(&MPU_RGDAAC_REG(base, index), MPU_RGDAAC_M6RE_SHIFT, MPU_RGDAAC_M6RE_WIDTH))

