pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the DST_EN field to a new value. */
#define RTC_WR_CTRL_DST_EN(base, value) (RTC_WR_CTRL(base, (RTC_RD_CTRL(base) & ~RTC_CTRL_DST_EN_MASK) | RTC_CTRL_DST_EN(value)))
#define RTC_BWR_CTRL_DST_EN(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_DST_EN_SHIFT), RTC_CTRL_DST_EN_SHIFT, RTC_CTRL_DST_EN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field SWR[8] (WORZ)
 *
 * Self clearing bit. Asserting this field clears the contents of alarm,
 * interrupt (status and enable except tamper interrupt enable bit ) registers,
 * STATUS[CMP_DONE], and STATUS[BUS_ERR] and has no effect on DST, calendaring, Standby
 * time and tamper detect registers.
 *
 * Values:
 * - 0 - Software Reset cleared.
 * - 1 - Software Reset asserted.
 */
/*@{*/
/*! @brief Set the SWR field to a new value. */
#define RTC_WR_CTRL_SWR(base, value) (RTC_WR_CTRL(base, (RTC_RD_CTRL(base) & ~RTC_CTRL_SWR_MASK) | RTC_CTRL_SWR(value)))
#define RTC_BWR_CTRL_SWR(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_SWR_SHIFT), RTC_CTRL_SWR_SHIFT, RTC_CTRL_SWR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL, field CLKOUT[14:13] (RW)
 *
 * Selects which clock to output from SoC for use outside RTC.
 *
 * Values:
 * - 00 - No Output Clock
 * - 01 - Fine 1 Hz Clock
 * - 10 - 32.768 kHz Clock
 * - 11 - Coarse 1 Hz Clock
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL_CLKOUT field. */
#define RTC_RD_CTRL_CLKOUT(base) ((RTC_CTRL_REG(base) & RTC_CTRL_CLKOUT_MASK) >> RTC_CTRL_CLKOUT_SHIFT)
#define RTC_BRD_CTRL_CLKOUT(base) (BME_UBFX16(&RTC_CTRL_REG(base), RTC_CTRL_CLKOUT_SHIFT, RTC_CTRL_CLKOUT_WIDTH))

/*! @brief Set the CLKOUT field to a new value. */
#define RTC_WR_CTRL_CLKOUT(base, value) (RTC_WR_CTRL(base, (RTC_RD_CTRL(base) & ~RTC_CTRL_CLKOUT_MASK) | RTC_CTRL_CLKOUT(value)))
#define RTC_BWR_CTRL_CLKOUT(base, value) (BME_BFI16(&RTC_CTRL_REG(base), ((uint16_t)(value) << RTC_CTRL_CLKOUT_SHIFT), RTC_CTRL_CLKOUT_SHIFT, RTC_CTRL_CLKOUT_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_STATUS - RTC Status Register
 ******************************************************************************/

/*!
 * @brief RTC_STATUS - RTC Status Register (RW)
 *
 * Reset value: 0x0008U
 *
 * This register indicates the status of various processes going inside the RTC.
 * This register also helps the user software to read time or date register when
 * their values are stable and not changing. Bus Error bit get cleared by
 * writing '1' to them. Software Reset resets the whole register (except the RST_SRC
 * bit) to its default state. All memory mapped registers are protected against
 * spurious updates by the write protect mechanism. To unlock the registers , a
 * specific pattern (as mentioned in above table) has to be written in the write
 * enable bits (WE[1:0]) to enable or disable write protection.. The WE[1:0] bits are
 * the only bits that are freely writeable by user software. The write enable
 * bits are self clearing bits that always return zeros on read.
 */
/*!
 * @name Constants and macros for entire RTC_STATUS register
 */
/*@{*/
#define RTC_RD_STATUS(base)      (RTC_STATUS_REG(base))
#define RTC_WR_STATUS(base, value) (RTC_STATUS_REG(base) = (value))
#define RTC_SET_STATUS(base, value) (BME_OR16(&RTC_STATUS_REG(base), (uint16_t)(value)))
#define RTC_CLR_STATUS(base, value) (BME_AND16(&RTC_STATUS_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_STATUS(base, value) (BME_XOR16(&RTC_STATUS_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_STATUS bitfields
 */

/*!
 * @name Register RTC_STATUS, field INVAL_BIT[0] (RO)
 *
 * This read-only bit indicates the time /date counters are invalid or changing
 * and thus should not be read/written to. This bit is asserted for 1 oscillator
 * clock cycle before and after the 1 Hz (seconds clock) boundary/edge. Write
 * access to time /date registers gets nullified (terminate normally) and no
 * register value gets changed. Read during INVAL bit asserted returns 0xFFFF. No
 * Transfer Error is asserted.
 *
 * Values:
 * - 0 - Time /Date Counters can be read/written. Time /Date is valid.
 * - 1 - Time /Date Counter values are changing or Time /Date is invalid and
 *     cannot be read or written.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_INVAL_BIT field. */
#define RTC_RD_STATUS_INVAL_BIT(base) ((RTC_STATUS_REG(base) & RTC_STATUS_INVAL_BIT_MASK) >> RTC_STATUS_INVAL_BIT_SHIFT)
#define RTC_BRD_STATUS_INVAL_BIT(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_INVAL_BIT_SHIFT, RTC_STATUS_INVAL_BIT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field WRITE_PROT_EN[1] (RO)
 *
 * This read-only bit indicates that registers are in locked mode and write to
 * them is disabled. Any write access made to the register space when write
 * protection is enabled (that is in locked mode) will cause the transfer error signal
 * to be asserted.
 *
 * Values:
 * - 0 - Registers are unlocked and can be accessed.
 * - 1 - Registers are locked and in read-only mode.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_WRITE_PROT_EN field. */
#define RTC_RD_STATUS_WRITE_PROT_EN(base) ((RTC_STATUS_REG(base) & RTC_STATUS_WRITE_PROT_EN_MASK) >> RTC_STATUS_WRITE_PROT_EN_SHIFT)
#define RTC_BRD_STATUS_WRITE_PROT_EN(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_WRITE_PROT_EN_SHIFT, RTC_STATUS_WRITE_PROT_EN_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field CPU_LOW_VOLT[2] (RO)
 *
 * This bit is asserted when the MCU/CPU power falls below the read only
 * threshold when all write cycles are terminated normally and no change is done to the
 * registers. Registers are read only. Transfer Error is not asserted on write
 * access.
 *
 * Values:
 * - 0 - CPU in Normal Operating Voltage.
 * - 1 - CPU Voltage is below Normal Operating Voltage. RTC Registers in
 *     read-only mode.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_CPU_LOW_VOLT field. */
#define RTC_RD_STATUS_CPU_LOW_VOLT(base) ((RTC_STATUS_REG(base) & RTC_STATUS_CPU_LOW_VOLT_MASK) >> RTC_STATUS_CPU_LOW_VOLT_SHIFT)
#define RTC_BRD_STATUS_CPU_LOW_VOLT(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_CPU_LOW_VOLT_SHIFT, RTC_STATUS_CPU_LOW_VOLT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field RST_SRC[3] (RO)
 *
 * This bit indicates to the user software the cause for reset to the part and
 * subsequent boot up of CPU. This bit is asserted only on the power on reset that
 * is generated within RTC (that is Power On Reset when both VBAT and VDD are
 * powered up) and this indicates that part has been reset. On entering standby
 * mode, this bit is cleared which indicates the part is booting after Standby Mode
 * Exit, when the standby mode is actually exited.
 *
 * Values:
 * - 0 - Part was reset due to Standby Mode Exit (that is when VDD is powered up
 *     and VBAT was not powered down at all).
 * - 1 - Part was reset due to Power-On Reset (that is Power On Reset when both
 *     VBAT and VDD are powered up).
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_RST_SRC field. */
#define RTC_RD_STATUS_RST_SRC(base) ((RTC_STATUS_REG(base) & RTC_STATUS_RST_SRC_MASK) >> RTC_STATUS_RST_SRC_SHIFT)
#define RTC_BRD_STATUS_RST_SRC(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_RST_SRC_SHIFT, RTC_STATUS_RST_SRC_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field CMP_INT[5] (RO)
 *
 * This read-only status bit is asserted for a time equal to compensation
 * interval seconds (as configured by user). This bit is used by MCU to calculate the
 * interrupts serviced during this interval and perform corrections in case of
 * deviations (i.e. Calibration). This bit toggles on every start of new
 * compensation interval and is either 0 or 1 during the entire duration. This bit will not
 * toggle if compensation logic has been disabled by MCU.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_CMP_INT field. */
#define RTC_RD_STATUS_CMP_INT(base) ((RTC_STATUS_REG(base) & RTC_STATUS_CMP_INT_MASK) >> RTC_STATUS_CMP_INT_SHIFT)
#define RTC_BRD_STATUS_CMP_INT(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_CMP_INT_SHIFT, RTC_STATUS_CMP_INT_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field WE[7:6] (WORZ)
 *
 * These bits control the entry and exit of the write protection mode. Both
 * registers are protected by the write protection mechanism. These are self clearing
 * bits. Reads will return zeros. When the registers are unlocked, they remain
 * in this unlocked state for a time of 2 seconds after which they get locked
 * automatically. After power-on-reset, the registers come out as unlocked but they
 * get locked automatically 15 seconds after power on.
 *
 * Values:
 * - 10 - Enable Write Protection - Registers are locked.
 */
/*@{*/
/*! @brief Set the WE field to a new value. */
#define RTC_WR_STATUS_WE(base, value) (RTC_WR_STATUS(base, (RTC_RD_STATUS(base) & ~(RTC_STATUS_WE_MASK | RTC_STATUS_BUS_ERR_MASK | RTC_STATUS_CMP_DONE_MASK)) | RTC_STATUS_WE(value)))
#define RTC_BWR_STATUS_WE(base, value) (BME_BFI16(&RTC_STATUS_REG(base), ((uint16_t)(value) << RTC_STATUS_WE_SHIFT), RTC_STATUS_WE_SHIFT, RTC_STATUS_WE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field BUS_ERR[8] (W1C)
 *
 * This bit indicates that a read or write cycle was initiated by software when
 * the INVAL_BIT was set. Write access to time /date registers gets nullified
 * (terminate normally) and no register value gets changed. Read during INVAL bit
 * asserted returns 16'hFFFF. No Transfer Error is asserted. This bit gets cleared
 * by writing 1 to it.
 *
 * Values:
 * - 0 - Read and Write accesses are normal.
 * - 1 - Read or Write accesses occurred when INVAL_BIT was asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_BUS_ERR field. */
#define RTC_RD_STATUS_BUS_ERR(base) ((RTC_STATUS_REG(base) & RTC_STATUS_BUS_ERR_MASK) >> RTC_STATUS_BUS_ERR_SHIFT)
#define RTC_BRD_STATUS_BUS_ERR(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_BUS_ERR_SHIFT, RTC_STATUS_BUS_ERR_WIDTH))

/*! @brief Set the BUS_ERR field to a new value. */
#define RTC_WR_STATUS_BUS_ERR(base, value) (RTC_WR_STATUS(base, (RTC_RD_STATUS(base) & ~(RTC_STATUS_BUS_ERR_MASK | RTC_STATUS_CMP_DONE_MASK)) | RTC_STATUS_BUS_ERR(value)))
#define RTC_BWR_STATUS_BUS_ERR(base, value) (BME_BFI16(&RTC_STATUS_REG(base), ((uint16_t)(value) << RTC_STATUS_BUS_ERR_SHIFT), RTC_STATUS_BUS_ERR_SHIFT, RTC_STATUS_BUS_ERR_WIDTH))
/*@}*/

/*!
 * @name Register RTC_STATUS, field CMP_DONE[11] (W1C)
 *
 * This bit indicates that current compensation cycle is complete. The bit gets
 * cleared by writing 1 to it. Done bit is asserted seven 32.768 kHz clock cycles
 * before actual compensation interval completes so that back to back
 * compensation can be enabled.
 *
 * Values:
 * - 0 - Compensation busy or not enabled.
 * - 1 - Compensation completed.
 */
/*@{*/
/*! @brief Read current value of the RTC_STATUS_CMP_DONE field. */
#define RTC_RD_STATUS_CMP_DONE(base) ((RTC_STATUS_REG(base) & RTC_STATUS_CMP_DONE_MASK) >> RTC_STATUS_CMP_DONE_SHIFT)
#define RTC_BRD_STATUS_CMP_DONE(base) (BME_UBFX16(&RTC_STATUS_REG(base), RTC_STATUS_CMP_DONE_SHIFT, RTC_STATUS_CMP_DONE_WIDTH))

/*! @brief Set the CMP_DONE field to a new value. */
#define RTC_WR_STATUS_CMP_DONE(base, value) (RTC_WR_STATUS(base, (RTC_RD_STATUS(base) & ~(RTC_STATUS_CMP_DONE_MASK | RTC_STATUS_BUS_ERR_MASK)) | RTC_STATUS_CMP_DONE(value)))
#define RTC_BWR_STATUS_CMP_DONE(base, value) (BME_BFI16(&RTC_STATUS_REG(base), ((uint16_t)(value) << RTC_STATUS_CMP_DONE_SHIFT), RTC_STATUS_CMP_DONE_SHIFT, RTC_STATUS_CMP_DONE_WIDTH))
/*@}*/

