pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * RTC_ISR - RTC Interrupt Status Register
 ******************************************************************************/

/*!
 * @brief RTC_ISR - RTC Interrupt Status Register (RW)
 *
 * Reset value: 0x0001U
 *
 * For the sampling timer interrupt status bits [14:6], refer to chip
 * configuration chapter for the applicable sampling timer frequencies. This register
 * indicates the status of the various real-time clock interrupts. When an event of
 * the types included in this register occurs then the bit will be set in this
 * register regardless of its corresponding interrupt enable bit being set. The
 * status bits are cleared by writing a value of 1, which also clears the interrupt.
 * Interrupts may occur while the system clock is idle or in standby mode. When
 * the system enters the active power mode, interrupt will be indicated to the CPU.
 * The first event of the Sampling Timer interrupts after Power-on-Reset should
 * not used to qualify any periodic interval. However, the correct periodic
 * interval (that is 512 Hz or 256 Hz, and so on) should be determined using two
 * sampling timer interrupts. The time between two interrupt would always be the
 * correct time period. Tamper Interrupt Status is set on reset as POR is generated
 * when battery and CPU power are unavailable and either is powered up. Removal of
 * battery is considered as a tamper and hence this bit is set on reset. The
 * status register is also cleared on software reset except for the tamper status
 * which remains unaffected . Sampling interrupts from 512 Hz to 2 Hz are generated
 * using uncompensated clock. Only 1 Hz is compensated.
 */
/*!
 * @name Constants and macros for entire RTC_ISR register
 */
/*@{*/
#define RTC_RD_ISR(base)         (RTC_ISR_REG(base))
#define RTC_WR_ISR(base, value)  (RTC_ISR_REG(base) = (value))
#define RTC_SET_ISR(base, value) (BME_OR16(&RTC_ISR_REG(base), (uint16_t)(value)))
#define RTC_CLR_ISR(base, value) (BME_AND16(&RTC_ISR_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_ISR(base, value) (BME_XOR16(&RTC_ISR_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_ISR bitfields
 */

/*!
 * @name Register RTC_ISR, field TAMPER_IS[0] (RO)
 *
 * This field is cleared when TAMPER_SCR[TMPR_STS] is cleared.
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted (Default on reset) .
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_TAMPER_IS field. */
#define RTC_RD_ISR_TAMPER_IS(base) ((RTC_ISR_REG(base) & RTC_ISR_TAMPER_IS_MASK) >> RTC_ISR_TAMPER_IS_SHIFT)
#define RTC_BRD_ISR_TAMPER_IS(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_TAMPER_IS_SHIFT, RTC_ISR_TAMPER_IS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field ALM_IS[2] (W1C)
 *
 * This bit indicates that the alarm value programmed matches the counter values.
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_ALM_IS field. */
#define RTC_RD_ISR_ALM_IS(base) ((RTC_ISR_REG(base) & RTC_ISR_ALM_IS_MASK) >> RTC_ISR_ALM_IS_SHIFT)
#define RTC_BRD_ISR_ALM_IS(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_ALM_IS_SHIFT, RTC_ISR_ALM_IS_WIDTH))

/*! @brief Set the ALM_IS field to a new value. */
#define RTC_WR_ISR_ALM_IS(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_ALM_IS(value)))
#define RTC_BWR_ISR_ALM_IS(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_ALM_IS_SHIFT), RTC_ISR_ALM_IS_SHIFT, RTC_ISR_ALM_IS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field DAY_IS[3] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_DAY_IS field. */
#define RTC_RD_ISR_DAY_IS(base) ((RTC_ISR_REG(base) & RTC_ISR_DAY_IS_MASK) >> RTC_ISR_DAY_IS_SHIFT)
#define RTC_BRD_ISR_DAY_IS(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_DAY_IS_SHIFT, RTC_ISR_DAY_IS_WIDTH))

/*! @brief Set the DAY_IS field to a new value. */
#define RTC_WR_ISR_DAY_IS(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_DAY_IS_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_DAY_IS(value)))
#define RTC_BWR_ISR_DAY_IS(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_DAY_IS_SHIFT), RTC_ISR_DAY_IS_SHIFT, RTC_ISR_DAY_IS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field HOUR_IS[4] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_HOUR_IS field. */
#define RTC_RD_ISR_HOUR_IS(base) ((RTC_ISR_REG(base) & RTC_ISR_HOUR_IS_MASK) >> RTC_ISR_HOUR_IS_SHIFT)
#define RTC_BRD_ISR_HOUR_IS(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_HOUR_IS_SHIFT, RTC_ISR_HOUR_IS_WIDTH))

/*! @brief Set the HOUR_IS field to a new value. */
#define RTC_WR_ISR_HOUR_IS(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_HOUR_IS_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_HOUR_IS(value)))
#define RTC_BWR_ISR_HOUR_IS(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_HOUR_IS_SHIFT), RTC_ISR_HOUR_IS_SHIFT, RTC_ISR_HOUR_IS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field MIN_IS[5] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_MIN_IS field. */
#define RTC_RD_ISR_MIN_IS(base) ((RTC_ISR_REG(base) & RTC_ISR_MIN_IS_MASK) >> RTC_ISR_MIN_IS_SHIFT)
#define RTC_BRD_ISR_MIN_IS(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_MIN_IS_SHIFT, RTC_ISR_MIN_IS_WIDTH))

/*! @brief Set the MIN_IS field to a new value. */
#define RTC_WR_ISR_MIN_IS(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_MIN_IS_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_MIN_IS(value)))
#define RTC_BWR_ISR_MIN_IS(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_MIN_IS_SHIFT), RTC_ISR_MIN_IS_SHIFT, RTC_ISR_MIN_IS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_1HZ[6] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_1HZ field. */
#define RTC_RD_ISR_IS_1HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_1HZ_MASK) >> RTC_ISR_IS_1HZ_SHIFT)
#define RTC_BRD_ISR_IS_1HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_1HZ_SHIFT, RTC_ISR_IS_1HZ_WIDTH))

/*! @brief Set the IS_1HZ field to a new value. */
#define RTC_WR_ISR_IS_1HZ(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_IS_1HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_2HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_IS_1HZ(value)))
#define RTC_BWR_ISR_IS_1HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_1HZ_SHIFT), RTC_ISR_IS_1HZ_SHIFT, RTC_ISR_IS_1HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_2HZ[7] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_2HZ field. */
#define RTC_RD_ISR_IS_2HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_2HZ_MASK) >> RTC_ISR_IS_2HZ_SHIFT)
#define RTC_BRD_ISR_IS_2HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_2HZ_SHIFT, RTC_ISR_IS_2HZ_WIDTH))

/*! @brief Set the IS_2HZ field to a new value. */
#define RTC_WR_ISR_IS_2HZ(base, value) (RTC_WR_ISR(base, (RTC_RD_ISR(base) & ~(RTC_ISR_IS_2HZ_MASK | RTC_ISR_ALM_IS_MASK | RTC_ISR_DAY_IS_MASK | RTC_ISR_HOUR_IS_MASK | RTC_ISR_MIN_IS_MASK | RTC_ISR_IS_1HZ_MASK | RTC_ISR_IS_4HZ_MASK | RTC_ISR_IS_8HZ_MASK | RTC_ISR_IS_16HZ_MASK | RTC_ISR_IS_32HZ_MASK | RTC_ISR_IS_64HZ_MASK | RTC_ISR_IS_128HZ_MASK | RTC_ISR_IS_256HZ_MASK | RTC_ISR_IS_512HZ_MASK)) | RTC_ISR_IS_2HZ(value)))
#define RTC_BWR_ISR_IS_2HZ(base, value) (BME_BFI16(&RTC_ISR_REG(base), ((uint16_t)(value) << RTC_ISR_IS_2HZ_SHIFT), RTC_ISR_IS_2HZ_SHIFT, RTC_ISR_IS_2HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_ISR, field IS_4HZ[8] (W1C)
 *
 * Values:
 * - 0 - Interrupt is de-asserted.
 * - 1 - Interrupt is asserted.
 */
/*@{*/
/*! @brief Read current value of the RTC_ISR_IS_4HZ field. */
#define RTC_RD_ISR_IS_4HZ(base) ((RTC_ISR_REG(base) & RTC_ISR_IS_4HZ_MASK) >> RTC_ISR_IS_4HZ_SHIFT)
#define RTC_BRD_ISR_IS_4HZ(base) (BME_UBFX16(&RTC_ISR_REG(base), RTC_ISR_IS_4HZ_SHIFT, RTC_ISR_IS_4HZ_WIDTH))

