pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * RTC_IER - RTC Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief RTC_IER - RTC Interrupt Enable Register (RW)
 *
 * Reset value: 0x0001U
 *
 * For the sampling timer interrupt enable bits [14:6], refer to chip
 * configuration chapter for the applicable sampling timer frequencies. The real-time clock
 * interrupt enable register (IER) is used to enable/disable the various
 * real-time clock interrupts. De-asserting an interrupt enable bit has no effect on the
 * assertion of its corresponding status bit. Alarm interrupt is asserted on
 * counters matching the alarm setting done in the memory map. The counters matched
 * for the alarm interrupt are selected based on the Alarm Type set in CTRL[3:2]
 * bits. The various types of alarm available are as per the following table.
 * Only one alarm type can be used at a time. Alarm Match Table ALM_MATCH[1:0]
 * (CTRL[3:2]) Counters Matched Alarm Type 00 Seconds, Minutes, and Hours Daily 01
 * Seconds, Minutes, Hours, and Days Monthly 10 Seconds, Minutes, Hours, Days, and
 * Months Yearly 11 Seconds, Minutes, Hours, Days, Months, and Year One Time A
 * common interrupt is generated by the block. The user software should read the
 * status register in the interrupt service routine to determine which interrupt has
 * occurred. The tamper detect interrupt enable is an exception as it is enabled
 * after power on reset. All interrupts enables except tamper interrupt enable
 * are reset to default state on software reset.
 */
/*!
 * @name Constants and macros for entire RTC_IER register
 */
/*@{*/
#define RTC_RD_IER(base)         (RTC_IER_REG(base))
#define RTC_WR_IER(base, value)  (RTC_IER_REG(base) = (value))
#define RTC_SET_IER(base, value) (BME_OR16(&RTC_IER_REG(base), (uint16_t)(value)))
#define RTC_CLR_IER(base, value) (BME_AND16(&RTC_IER_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_IER(base, value) (BME_XOR16(&RTC_IER_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_IER bitfields
 */

/*!
 * @name Register RTC_IER, field TAMPER_IE[0] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled (Default on reset).
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_TAMPER_IE field. */
#define RTC_RD_IER_TAMPER_IE(base) ((RTC_IER_REG(base) & RTC_IER_TAMPER_IE_MASK) >> RTC_IER_TAMPER_IE_SHIFT)
#define RTC_BRD_IER_TAMPER_IE(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_TAMPER_IE_SHIFT, RTC_IER_TAMPER_IE_WIDTH))

/*! @brief Set the TAMPER_IE field to a new value. */
#define RTC_WR_IER_TAMPER_IE(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_TAMPER_IE_MASK) | RTC_IER_TAMPER_IE(value)))
#define RTC_BWR_IER_TAMPER_IE(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_TAMPER_IE_SHIFT), RTC_IER_TAMPER_IE_SHIFT, RTC_IER_TAMPER_IE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field ALM_IE[2] (RW)
 *
 * This bit indicates that the alarm value programmed matches the counter values.
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_ALM_IE field. */
#define RTC_RD_IER_ALM_IE(base) ((RTC_IER_REG(base) & RTC_IER_ALM_IE_MASK) >> RTC_IER_ALM_IE_SHIFT)
#define RTC_BRD_IER_ALM_IE(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_ALM_IE_SHIFT, RTC_IER_ALM_IE_WIDTH))

/*! @brief Set the ALM_IE field to a new value. */
#define RTC_WR_IER_ALM_IE(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_ALM_IE_MASK) | RTC_IER_ALM_IE(value)))
#define RTC_BWR_IER_ALM_IE(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_ALM_IE_SHIFT), RTC_IER_ALM_IE_SHIFT, RTC_IER_ALM_IE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field DAY_IE[3] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_DAY_IE field. */
#define RTC_RD_IER_DAY_IE(base) ((RTC_IER_REG(base) & RTC_IER_DAY_IE_MASK) >> RTC_IER_DAY_IE_SHIFT)
#define RTC_BRD_IER_DAY_IE(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_DAY_IE_SHIFT, RTC_IER_DAY_IE_WIDTH))

/*! @brief Set the DAY_IE field to a new value. */
#define RTC_WR_IER_DAY_IE(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_DAY_IE_MASK) | RTC_IER_DAY_IE(value)))
#define RTC_BWR_IER_DAY_IE(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_DAY_IE_SHIFT), RTC_IER_DAY_IE_SHIFT, RTC_IER_DAY_IE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field HOUR_IE[4] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_HOUR_IE field. */
#define RTC_RD_IER_HOUR_IE(base) ((RTC_IER_REG(base) & RTC_IER_HOUR_IE_MASK) >> RTC_IER_HOUR_IE_SHIFT)
#define RTC_BRD_IER_HOUR_IE(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_HOUR_IE_SHIFT, RTC_IER_HOUR_IE_WIDTH))

/*! @brief Set the HOUR_IE field to a new value. */
#define RTC_WR_IER_HOUR_IE(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_HOUR_IE_MASK) | RTC_IER_HOUR_IE(value)))
#define RTC_BWR_IER_HOUR_IE(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_HOUR_IE_SHIFT), RTC_IER_HOUR_IE_SHIFT, RTC_IER_HOUR_IE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field MIN_IE[5] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_MIN_IE field. */
#define RTC_RD_IER_MIN_IE(base) ((RTC_IER_REG(base) & RTC_IER_MIN_IE_MASK) >> RTC_IER_MIN_IE_SHIFT)
#define RTC_BRD_IER_MIN_IE(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_MIN_IE_SHIFT, RTC_IER_MIN_IE_WIDTH))

/*! @brief Set the MIN_IE field to a new value. */
#define RTC_WR_IER_MIN_IE(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_MIN_IE_MASK) | RTC_IER_MIN_IE(value)))
#define RTC_BWR_IER_MIN_IE(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_MIN_IE_SHIFT), RTC_IER_MIN_IE_SHIFT, RTC_IER_MIN_IE_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_1HZ[6] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_1HZ field. */
#define RTC_RD_IER_IE_1HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_1HZ_MASK) >> RTC_IER_IE_1HZ_SHIFT)
#define RTC_BRD_IER_IE_1HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_1HZ_SHIFT, RTC_IER_IE_1HZ_WIDTH))

/*! @brief Set the IE_1HZ field to a new value. */
#define RTC_WR_IER_IE_1HZ(base, value) (RTC_WR_IER(base, (RTC_RD_IER(base) & ~RTC_IER_IE_1HZ_MASK) | RTC_IER_IE_1HZ(value)))
#define RTC_BWR_IER_IE_1HZ(base, value) (BME_BFI16(&RTC_IER_REG(base), ((uint16_t)(value) << RTC_IER_IE_1HZ_SHIFT), RTC_IER_IE_1HZ_SHIFT, RTC_IER_IE_1HZ_WIDTH))
/*@}*/

/*!
 * @name Register RTC_IER, field IE_2HZ[7] (RW)
 *
 * Values:
 * - 0 - Interrupt is disabled.
 * - 1 - Interrupt is enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_IER_IE_2HZ field. */
#define RTC_RD_IER_IE_2HZ(base) ((RTC_IER_REG(base) & RTC_IER_IE_2HZ_MASK) >> RTC_IER_IE_2HZ_SHIFT)
#define RTC_BRD_IER_IE_2HZ(base) (BME_UBFX16(&RTC_IER_REG(base), RTC_IER_IE_2HZ_SHIFT, RTC_IER_IE_2HZ_WIDTH))

