pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the CLK_SEL1 field to a new value. */
#define RTC_WR_FILTER01_CFG_CLK_SEL1(base, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~RTC_FILTER01_CFG_CLK_SEL1_MASK) | RTC_FILTER01_CFG_CLK_SEL1(value)))
#define RTC_BWR_FILTER01_CFG_CLK_SEL1(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_CLK_SEL1_SHIFT), RTC_FILTER01_CFG_CLK_SEL1_SHIFT, RTC_FILTER01_CFG_CLK_SEL1_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER01_CFG, field POL1[7] (RW)
 *
 * This bit controls the polarity of tamper detect input bit 1 (TAMPER[1]).
 *
 * Values:
 * - 0 - Tamper detect input bit 1 is active high.
 * - 1 - Tamper detect input bit 1 is active low.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_POL1 field. */
#define RTC_RD_FILTER01_CFG_POL1(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_POL1_MASK) >> RTC_FILTER01_CFG_POL1_SHIFT)
#define RTC_BRD_FILTER01_CFG_POL1(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_POL1_SHIFT, RTC_FILTER01_CFG_POL1_WIDTH))

/*! @brief Set the POL1 field to a new value. */
#define RTC_WR_FILTER01_CFG_POL1(base, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~RTC_FILTER01_CFG_POL1_MASK) | RTC_FILTER01_CFG_POL1(value)))
#define RTC_BWR_FILTER01_CFG_POL1(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_POL1_SHIFT), RTC_FILTER01_CFG_POL1_SHIFT, RTC_FILTER01_CFG_POL1_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER01_CFG, field FIL_DUR0[11:8] (RW)
 *
 * This bit indicates the number of tamper filter clock cycles for which the
 * TAMPER[0] signal should remains stable before being detected as a tamper. These
 * bits are used by the tamper filtering operation. With the tamper duration set
 * to Zero any tamper detected on the tamper pins will directly set the tamper
 * status and interrupt bits. Caution is required when making the tamper filter
 * duration equal to 0 as any glitches on the tamper pins will cause a tamper
 * interrupt.
 *
 * Values:
 * - 0 - Filtering operation disabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_FIL_DUR0 field. */
#define RTC_RD_FILTER01_CFG_FIL_DUR0(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_FIL_DUR0_MASK) >> RTC_FILTER01_CFG_FIL_DUR0_SHIFT)
#define RTC_BRD_FILTER01_CFG_FIL_DUR0(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_FIL_DUR0_SHIFT, RTC_FILTER01_CFG_FIL_DUR0_WIDTH))

/*! @brief Set the FIL_DUR0 field to a new value. */
#define RTC_WR_FILTER01_CFG_FIL_DUR0(base, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~RTC_FILTER01_CFG_FIL_DUR0_MASK) | RTC_FILTER01_CFG_FIL_DUR0(value)))
#define RTC_BWR_FILTER01_CFG_FIL_DUR0(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_FIL_DUR0_SHIFT), RTC_FILTER01_CFG_FIL_DUR0_SHIFT, RTC_FILTER01_CFG_FIL_DUR0_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER01_CFG, field CLK_SEL0[14:12] (RW)
 *
 * This bit is a write once bit and selects the clock source for tamper filter
 * for tamper detect input bit 0.
 *
 * Values:
 * - 000 - 32 kHz clock
 * - 001 - 512 Hz clock
 * - 010 - 128 Hz clock
 * - 011 - 64 Hz clock
 * - 100 - 16 Hz clock
 * - 101 - 8 Hz clock
 * - 110 - 4 Hz clock
 * - 111 - 2 Hz clock
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_CLK_SEL0 field. */
#define RTC_RD_FILTER01_CFG_CLK_SEL0(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_CLK_SEL0_MASK) >> RTC_FILTER01_CFG_CLK_SEL0_SHIFT)
#define RTC_BRD_FILTER01_CFG_CLK_SEL0(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_CLK_SEL0_SHIFT, RTC_FILTER01_CFG_CLK_SEL0_WIDTH))

/*! @brief Set the CLK_SEL0 field to a new value. */
#define RTC_WR_FILTER01_CFG_CLK_SEL0(base, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~RTC_FILTER01_CFG_CLK_SEL0_MASK) | RTC_FILTER01_CFG_CLK_SEL0(value)))
#define RTC_BWR_FILTER01_CFG_CLK_SEL0(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_CLK_SEL0_SHIFT), RTC_FILTER01_CFG_CLK_SEL0_SHIFT, RTC_FILTER01_CFG_CLK_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER01_CFG, field POL0[15] (RW)
 *
 * This bit controls the polarity of tamper detect input bit 0 (TAMPER[0]).
 *
 * Values:
 * - 0 - Tamper detect input bit 0 is active high.
 * - 1 - Tamper detect input bit 0 is active low.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER01_CFG_POL0 field. */
#define RTC_RD_FILTER01_CFG_POL0(base) ((RTC_FILTER01_CFG_REG(base) & RTC_FILTER01_CFG_POL0_MASK) >> RTC_FILTER01_CFG_POL0_SHIFT)
#define RTC_BRD_FILTER01_CFG_POL0(base) (BME_UBFX16(&RTC_FILTER01_CFG_REG(base), RTC_FILTER01_CFG_POL0_SHIFT, RTC_FILTER01_CFG_POL0_WIDTH))

/*! @brief Set the POL0 field to a new value. */
#define RTC_WR_FILTER01_CFG_POL0(base, value) (RTC_WR_FILTER01_CFG(base, (RTC_RD_FILTER01_CFG(base) & ~RTC_FILTER01_CFG_POL0_MASK) | RTC_FILTER01_CFG_POL0(value)))
#define RTC_BWR_FILTER01_CFG_POL0(base, value) (BME_BFI16(&RTC_FILTER01_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER01_CFG_POL0_SHIFT), RTC_FILTER01_CFG_POL0_SHIFT, RTC_FILTER01_CFG_POL0_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_FILTER2_CFG - RTC Tamper 2 Filter Configuration Register
 ******************************************************************************/

/*!
 * @brief RTC_FILTER2_CFG - RTC Tamper 2 Filter Configuration Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register must be configured once during the initial startup of
 * application and must not be changed on the fly to avoid any erratic behavior. Changing
 * the register on the fly might lead to missing of tamper events or assertion of
 * false tamper events. Tamper 3 is an internal tamper detect bit and hence does
 * not require any filtering.
 */
/*!
 * @name Constants and macros for entire RTC_FILTER2_CFG register
 */
/*@{*/
#define RTC_RD_FILTER2_CFG(base) (RTC_FILTER2_CFG_REG(base))
#define RTC_WR_FILTER2_CFG(base, value) (RTC_FILTER2_CFG_REG(base) = (value))
#define RTC_SET_FILTER2_CFG(base, value) (BME_OR16(&RTC_FILTER2_CFG_REG(base), (uint16_t)(value)))
#define RTC_CLR_FILTER2_CFG(base, value) (BME_AND16(&RTC_FILTER2_CFG_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_FILTER2_CFG(base, value) (BME_XOR16(&RTC_FILTER2_CFG_REG(base), (uint16_t)(value)))
/*@}*/

