pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual RTC_FILTER2_CFG bitfields
 */

/*!
 * @name Register RTC_FILTER2_CFG, field FIL_DUR2[11:8] (RW)
 *
 * This bit indicates the number of tamper filter clock cycles for which the
 * TAMPER[2] signal should remains stable before being detected as a tamper. These
 * bits are used by the tamper filtering operation. With the tamper duration set
 * to Zero any tamper detected on the tamper pins will directly set the tamper
 * status and interrupt bits. Caution is required when making the tamper filter
 * duration equal to 0 as any glitches on the tamper pins will cause a tamper
 * interrupt.
 *
 * Values:
 * - 0 - Filtering operation disabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER2_CFG_FIL_DUR2 field. */
#define RTC_RD_FILTER2_CFG_FIL_DUR2(base) ((RTC_FILTER2_CFG_REG(base) & RTC_FILTER2_CFG_FIL_DUR2_MASK) >> RTC_FILTER2_CFG_FIL_DUR2_SHIFT)
#define RTC_BRD_FILTER2_CFG_FIL_DUR2(base) (BME_UBFX16(&RTC_FILTER2_CFG_REG(base), RTC_FILTER2_CFG_FIL_DUR2_SHIFT, RTC_FILTER2_CFG_FIL_DUR2_WIDTH))

/*! @brief Set the FIL_DUR2 field to a new value. */
#define RTC_WR_FILTER2_CFG_FIL_DUR2(base, value) (RTC_WR_FILTER2_CFG(base, (RTC_RD_FILTER2_CFG(base) & ~RTC_FILTER2_CFG_FIL_DUR2_MASK) | RTC_FILTER2_CFG_FIL_DUR2(value)))
#define RTC_BWR_FILTER2_CFG_FIL_DUR2(base, value) (BME_BFI16(&RTC_FILTER2_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER2_CFG_FIL_DUR2_SHIFT), RTC_FILTER2_CFG_FIL_DUR2_SHIFT, RTC_FILTER2_CFG_FIL_DUR2_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER2_CFG, field CLK_SEL2[14:12] (RW)
 *
 * This bit is a write once bit and selects the clock source for tamper filter
 * for tamper detect input bit 2.
 *
 * Values:
 * - 000 - 32 kHz clock
 * - 001 - 512 Hz clock
 * - 010 - 128 Hz clock
 * - 011 - 64 Hz clock
 * - 100 - 16 Hz clock
 * - 101 - 8 Hz clock
 * - 110 - 4 Hz clock
 * - 111 - 2 Hz clock
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER2_CFG_CLK_SEL2 field. */
#define RTC_RD_FILTER2_CFG_CLK_SEL2(base) ((RTC_FILTER2_CFG_REG(base) & RTC_FILTER2_CFG_CLK_SEL2_MASK) >> RTC_FILTER2_CFG_CLK_SEL2_SHIFT)
#define RTC_BRD_FILTER2_CFG_CLK_SEL2(base) (BME_UBFX16(&RTC_FILTER2_CFG_REG(base), RTC_FILTER2_CFG_CLK_SEL2_SHIFT, RTC_FILTER2_CFG_CLK_SEL2_WIDTH))

/*! @brief Set the CLK_SEL2 field to a new value. */
#define RTC_WR_FILTER2_CFG_CLK_SEL2(base, value) (RTC_WR_FILTER2_CFG(base, (RTC_RD_FILTER2_CFG(base) & ~RTC_FILTER2_CFG_CLK_SEL2_MASK) | RTC_FILTER2_CFG_CLK_SEL2(value)))
#define RTC_BWR_FILTER2_CFG_CLK_SEL2(base, value) (BME_BFI16(&RTC_FILTER2_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER2_CFG_CLK_SEL2_SHIFT), RTC_FILTER2_CFG_CLK_SEL2_SHIFT, RTC_FILTER2_CFG_CLK_SEL2_WIDTH))
/*@}*/

/*!
 * @name Register RTC_FILTER2_CFG, field POL2[15] (RW)
 *
 * This bit controls the polarity of tamper detect input bit 2 (TAMPER[2]).
 *
 * Values:
 * - 0 - Tamper detect input bit 2 is active high.
 * - 1 - Tamper detect input bit 2 is active low.
 */
/*@{*/
/*! @brief Read current value of the RTC_FILTER2_CFG_POL2 field. */
#define RTC_RD_FILTER2_CFG_POL2(base) ((RTC_FILTER2_CFG_REG(base) & RTC_FILTER2_CFG_POL2_MASK) >> RTC_FILTER2_CFG_POL2_SHIFT)
#define RTC_BRD_FILTER2_CFG_POL2(base) (BME_UBFX16(&RTC_FILTER2_CFG_REG(base), RTC_FILTER2_CFG_POL2_SHIFT, RTC_FILTER2_CFG_POL2_WIDTH))

/*! @brief Set the POL2 field to a new value. */
#define RTC_WR_FILTER2_CFG_POL2(base, value) (RTC_WR_FILTER2_CFG(base, (RTC_RD_FILTER2_CFG(base) & ~RTC_FILTER2_CFG_POL2_MASK) | RTC_FILTER2_CFG_POL2(value)))
#define RTC_BWR_FILTER2_CFG_POL2(base, value) (BME_BFI16(&RTC_FILTER2_CFG_REG(base), ((uint16_t)(value) << RTC_FILTER2_CFG_POL2_SHIFT), RTC_FILTER2_CFG_POL2_SHIFT, RTC_FILTER2_CFG_POL2_WIDTH))
/*@}*/

/*******************************************************************************
 * RTC_TAMPER_QUEUE - Tamper Queue Register
 ******************************************************************************/

/*!
 * @brief RTC_TAMPER_QUEUE - Tamper Queue Register (RO)
 *
 * Reset value: 0x0000U
 *
 * Tamper queue register provides the Time stamp and the Pin number on which the
 * tamper occured. Reading beyond the depth of FIFO when the FIFO is full or
 * empty returns random data. See the Chip Configuration chapter for the depth of
 * the Tamper FIFO.
 */
/*!
 * @name Constants and macros for entire RTC_TAMPER_QUEUE register
 */
/*@{*/
#define RTC_RD_TAMPER_QUEUE(base) (RTC_TAMPER_QUEUE_REG(base))
/*@}*/

/*******************************************************************************
 * RTC_CTRL2 - RTC Control 2 Register
 ******************************************************************************/

/*!
 * @brief RTC_CTRL2 - RTC Control 2 Register (RW)
 *
 * Reset value: 0x0080U
 *
 * RTC control 2 register defines the attributes for the configuration of tamper
 * pins.
 */
/*!
 * @name Constants and macros for entire RTC_CTRL2 register
 */
/*@{*/
#define RTC_RD_CTRL2(base)       (RTC_CTRL2_REG(base))
#define RTC_WR_CTRL2(base, value) (RTC_CTRL2_REG(base) = (value))
#define RTC_SET_CTRL2(base, value) (BME_OR16(&RTC_CTRL2_REG(base), (uint16_t)(value)))
#define RTC_CLR_CTRL2(base, value) (BME_AND16(&RTC_CTRL2_REG(base), (uint16_t)(~(value))))
#define RTC_TOG_CTRL2(base, value) (BME_XOR16(&RTC_CTRL2_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual RTC_CTRL2 bitfields
 */

/*!
 * @name Register RTC_CTRL2, field TAMP_CFG_OVER[0] (RW)
 *
 * Set this field to 1 only when all the tamper_cfg registers are programmed.
 *
 * Values:
 * - 0 - Tamper filter processing disabled.
 * - 1 - Tamper filter processing enabled.
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL2_TAMP_CFG_OVER field. */
#define RTC_RD_CTRL2_TAMP_CFG_OVER(base) ((RTC_CTRL2_REG(base) & RTC_CTRL2_TAMP_CFG_OVER_MASK) >> RTC_CTRL2_TAMP_CFG_OVER_SHIFT)
#define RTC_BRD_CTRL2_TAMP_CFG_OVER(base) (BME_UBFX16(&RTC_CTRL2_REG(base), RTC_CTRL2_TAMP_CFG_OVER_SHIFT, RTC_CTRL2_TAMP_CFG_OVER_WIDTH))

/*! @brief Set the TAMP_CFG_OVER field to a new value. */
#define RTC_WR_CTRL2_TAMP_CFG_OVER(base, value) (RTC_WR_CTRL2(base, (RTC_RD_CTRL2(base) & ~RTC_CTRL2_TAMP_CFG_OVER_MASK) | RTC_CTRL2_TAMP_CFG_OVER(value)))
#define RTC_BWR_CTRL2_TAMP_CFG_OVER(base, value) (BME_BFI16(&RTC_CTRL2_REG(base), ((uint16_t)(value) << RTC_CTRL2_TAMP_CFG_OVER_SHIFT), RTC_CTRL2_TAMP_CFG_OVER_SHIFT, RTC_CTRL2_TAMP_CFG_OVER_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL2, field WAKEUP_STATUS[6:5] (RW)
 *
 * Values:
 * - 00 - The wakeup/hibernation pin is in HiZ mode.
 * - 01 - The wakeup/hibernation pin is at logic 0. MCU is in sleep mode.
 * - 10 - The wakeup/ hibernation pin is at logic 1. MCU is in sleep mode.
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL2_WAKEUP_STATUS field. */
#define RTC_RD_CTRL2_WAKEUP_STATUS(base) ((RTC_CTRL2_REG(base) & RTC_CTRL2_WAKEUP_STATUS_MASK) >> RTC_CTRL2_WAKEUP_STATUS_SHIFT)
#define RTC_BRD_CTRL2_WAKEUP_STATUS(base) (BME_UBFX16(&RTC_CTRL2_REG(base), RTC_CTRL2_WAKEUP_STATUS_SHIFT, RTC_CTRL2_WAKEUP_STATUS_WIDTH))

