pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the WAKEUP_STATUS field to a new value. */
#define RTC_WR_CTRL2_WAKEUP_STATUS(base, value) (RTC_WR_CTRL2(base, (RTC_RD_CTRL2(base) & ~RTC_CTRL2_WAKEUP_STATUS_MASK) | RTC_CTRL2_WAKEUP_STATUS(value)))
#define RTC_BWR_CTRL2_WAKEUP_STATUS(base, value) (BME_BFI16(&RTC_CTRL2_REG(base), ((uint16_t)(value) << RTC_CTRL2_WAKEUP_STATUS_SHIFT), RTC_CTRL2_WAKEUP_STATUS_SHIFT, RTC_CTRL2_WAKEUP_STATUS_WIDTH))
/*@}*/

/*!
 * @name Register RTC_CTRL2, field WAKEUP_MODE[7] (RW)
 *
 * Values:
 * - 0 - Tamper pin 0 is used as the tamper pin.
 * - 1 - Tamper pin 0 is used as a wakeup/hibernation pin.
 */
/*@{*/
/*! @brief Read current value of the RTC_CTRL2_WAKEUP_MODE field. */
#define RTC_RD_CTRL2_WAKEUP_MODE(base) ((RTC_CTRL2_REG(base) & RTC_CTRL2_WAKEUP_MODE_MASK) >> RTC_CTRL2_WAKEUP_MODE_SHIFT)
#define RTC_BRD_CTRL2_WAKEUP_MODE(base) (BME_UBFX16(&RTC_CTRL2_REG(base), RTC_CTRL2_WAKEUP_MODE_SHIFT, RTC_CTRL2_WAKEUP_MODE_WIDTH))

/*! @brief Set the WAKEUP_MODE field to a new value. */
#define RTC_WR_CTRL2_WAKEUP_MODE(base, value) (RTC_WR_CTRL2(base, (RTC_RD_CTRL2(base) & ~RTC_CTRL2_WAKEUP_MODE_MASK) | RTC_CTRL2_WAKEUP_MODE(value)))
#define RTC_BWR_CTRL2_WAKEUP_MODE(base, value) (BME_BFI16(&RTC_CTRL2_REG(base), ((uint16_t)(value) << RTC_CTRL2_WAKEUP_MODE_SHIFT), RTC_CTRL2_WAKEUP_MODE_SHIFT, RTC_CTRL2_WAKEUP_MODE_WIDTH))
/*@}*/

/*
 * MKM14ZA5 SIM
 *
 * System Integration Module
 *
 * Registers defined in this header file:
 * - SIM_SOPT1 - System Options Register 1
 * - SIM_SOPT1_CFG - SOPT1 Configuration Register
 * - SIM_CTRL_REG - System Control Register
 * - SIM_SDID - System Device Identification Register
 * - SIM_SCGC4 - System Clock Gating Control Register 4
 * - SIM_SCGC5 - System Clock Gating Control Register 5
 * - SIM_SCGC6 - System Clock Gating Control Register 6
 * - SIM_SCGC7 - System Clock Gating Control Register 7
 * - SIM_CLKDIV1 - System Clock Divider Register 1
 * - SIM_FCFG1 - Flash Configuration Register 1
 * - SIM_FCFG2 - Flash Configuration Register 2
 * - SIM_UID0 - Unique Identification Register 0
 * - SIM_UID1 - Unique Identification Register 1
 * - SIM_UID2 - Unique Identification Register 2
 * - SIM_UID3 - Unique Identification Register 3
 * - SIM_MISC_CTL - Miscellaneous Control Register
 */

#define SIM_INSTANCE_COUNT (1U) /*!< Number of instances of the SIM module. */
#define SIM_IDX (0U) /*!< Instance number for SIM. */

/*******************************************************************************
 * SIM_SOPT1 - System Options Register 1
 ******************************************************************************/

/*!
 * @brief SIM_SOPT1 - System Options Register 1 (RW)
 *
 * Reset value: 0x00005000U
 *
 * The SOPT1 register is only reset on POR or LVD.
 */
/*!
 * @name Constants and macros for entire SIM_SOPT1 register
 */
/*@{*/
#define SIM_RD_SOPT1(base)       (SIM_SOPT1_REG(base))
#define SIM_WR_SOPT1(base, value) (SIM_SOPT1_REG(base) = (value))
#define SIM_SET_SOPT1(base, value) (BME_OR32(&SIM_SOPT1_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT1(base, value) (BME_AND32(&SIM_SOPT1_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT1(base, value) (BME_XOR32(&SIM_SOPT1_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT1 bitfields
 */

/*!
 * @name Register SIM_SOPT1, field SRAMSIZE[15:12] (RO)
 *
 * Values:
 * - 0101 - 16kB System RAM
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_SRAMSIZE field. */
#define SIM_RD_SOPT1_SRAMSIZE(base) ((SIM_SOPT1_REG(base) & SIM_SOPT1_SRAMSIZE_MASK) >> SIM_SOPT1_SRAMSIZE_SHIFT)
#define SIM_BRD_SOPT1_SRAMSIZE(base) (BME_UBFX32(&SIM_SOPT1_REG(base), SIM_SOPT1_SRAMSIZE_SHIFT, SIM_SOPT1_SRAMSIZE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1, field OSC32KSEL[19:18] (RW)
 *
 * Selects the 32 kHz clock source for LPTMR , CLKOUT , LCD , EWM, WDOG. This
 * bit is reset only on POR/LVD.
 *
 * Values:
 * - 00 - OSC32KCLK
 * - 01 - ERCLK32K
 * - 10 - MCGIRCLK
 * - 11 - LPO
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_OSC32KSEL field. */
#define SIM_RD_SOPT1_OSC32KSEL(base) ((SIM_SOPT1_REG(base) & SIM_SOPT1_OSC32KSEL_MASK) >> SIM_SOPT1_OSC32KSEL_SHIFT)
#define SIM_BRD_SOPT1_OSC32KSEL(base) (BME_UBFX32(&SIM_SOPT1_REG(base), SIM_SOPT1_OSC32KSEL_SHIFT, SIM_SOPT1_OSC32KSEL_WIDTH))

/*! @brief Set the OSC32KSEL field to a new value. */
#define SIM_WR_SOPT1_OSC32KSEL(base, value) (SIM_WR_SOPT1(base, (SIM_RD_SOPT1(base) & ~SIM_SOPT1_OSC32KSEL_MASK) | SIM_SOPT1_OSC32KSEL(value)))
#define SIM_BWR_SOPT1_OSC32KSEL(base, value) (BME_BFI32(&SIM_SOPT1_REG(base), ((uint32_t)(value) << SIM_SOPT1_OSC32KSEL_SHIFT), SIM_SOPT1_OSC32KSEL_SHIFT, SIM_SOPT1_OSC32KSEL_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT1_CFG - SOPT1 Configuration Register
 ******************************************************************************/

/*!
 * @brief SIM_SOPT1_CFG - SOPT1 Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The SOPT1CFG register is reset on system reset not VLLS.
 */
/*!
 * @name Constants and macros for entire SIM_SOPT1_CFG register
 */
/*@{*/
#define SIM_RD_SOPT1_CFG(base)   (SIM_SOPT1_CFG_REG(base))
#define SIM_WR_SOPT1_CFG(base, value) (SIM_SOPT1_CFG_REG(base) = (value))
#define SIM_SET_SOPT1_CFG(base, value) (BME_OR32(&SIM_SOPT1_CFG_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT1_CFG(base, value) (BME_AND32(&SIM_SOPT1_CFG_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT1_CFG(base, value) (BME_XOR32(&SIM_SOPT1_CFG_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT1_CFG bitfields
 */

/*!
 * @name Register SIM_SOPT1_CFG, field LPTMR1SEL[1:0] (RW)
 *
 * This field is used to select source for LP timer channel1.
 *
 * Values:
 * - 00 - Pad PTE4
 * - 01 - Pad PTF4
 * - 10 - Pad PTG1
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_LPTMR1SEL field. */
#define SIM_RD_SOPT1_CFG_LPTMR1SEL(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_LPTMR1SEL_MASK) >> SIM_SOPT1_CFG_LPTMR1SEL_SHIFT)
#define SIM_BRD_SOPT1_CFG_LPTMR1SEL(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_LPTMR1SEL_SHIFT, SIM_SOPT1_CFG_LPTMR1SEL_WIDTH))

/*! @brief Set the LPTMR1SEL field to a new value. */
#define SIM_WR_SOPT1_CFG_LPTMR1SEL(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_LPTMR1SEL_MASK) | SIM_SOPT1_CFG_LPTMR1SEL(value)))
#define SIM_BWR_SOPT1_CFG_LPTMR1SEL(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_LPTMR1SEL_SHIFT), SIM_SOPT1_CFG_LPTMR1SEL_SHIFT, SIM_SOPT1_CFG_LPTMR1SEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1_CFG, field LPTMR2SEL[3:2] (RW)
 *
 * This field is used to select source for LP timer channel2.
 *
 * Values:
 * - 00 - Pad PTD6
 * - 01 - Pad PTF3
 * - 10 - Pad PTG5
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_LPTMR2SEL field. */
#define SIM_RD_SOPT1_CFG_LPTMR2SEL(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_LPTMR2SEL_MASK) >> SIM_SOPT1_CFG_LPTMR2SEL_SHIFT)
#define SIM_BRD_SOPT1_CFG_LPTMR2SEL(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_LPTMR2SEL_SHIFT, SIM_SOPT1_CFG_LPTMR2SEL_WIDTH))

/*! @brief Set the LPTMR2SEL field to a new value. */
#define SIM_WR_SOPT1_CFG_LPTMR2SEL(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_LPTMR2SEL_MASK) | SIM_SOPT1_CFG_LPTMR2SEL(value)))
#define SIM_BWR_SOPT1_CFG_LPTMR2SEL(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_LPTMR2SEL_SHIFT), SIM_SOPT1_CFG_LPTMR2SEL_SHIFT, SIM_SOPT1_CFG_LPTMR2SEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1_CFG, field LPTMR3SEL[5:4] (RW)
 *
 * This field is used to select source for LP timer channel3.
 *
 * Values:
 * - 00 - Pad PTD5
 * - 01 - Pad PTG0
 * - 10 - Pad PTG6
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_LPTMR3SEL field. */
#define SIM_RD_SOPT1_CFG_LPTMR3SEL(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_LPTMR3SEL_MASK) >> SIM_SOPT1_CFG_LPTMR3SEL_SHIFT)
#define SIM_BRD_SOPT1_CFG_LPTMR3SEL(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_LPTMR3SEL_SHIFT, SIM_SOPT1_CFG_LPTMR3SEL_WIDTH))

/*! @brief Set the LPTMR3SEL field to a new value. */
#define SIM_WR_SOPT1_CFG_LPTMR3SEL(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_LPTMR3SEL_MASK) | SIM_SOPT1_CFG_LPTMR3SEL(value)))
#define SIM_BWR_SOPT1_CFG_LPTMR3SEL(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_LPTMR3SEL_SHIFT), SIM_SOPT1_CFG_LPTMR3SEL_SHIFT, SIM_SOPT1_CFG_LPTMR3SEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1_CFG, field CMPOLPTMR0SEL[6] (RW)
 *
 * This field is used to select CMP outputs as the source for LP timer channel0.
 *
 * Values:
 * - 0 - CMP[1] output selected as LPTMR input[0]
 * - 1 - CMP[0] output selected as LPTMR input[0]
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_CMPOLPTMR0SEL field. */
#define SIM_RD_SOPT1_CFG_CMPOLPTMR0SEL(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_CMPOLPTMR0SEL_MASK) >> SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT)
#define SIM_BRD_SOPT1_CFG_CMPOLPTMR0SEL(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT, SIM_SOPT1_CFG_CMPOLPTMR0SEL_WIDTH))

/*! @brief Set the CMPOLPTMR0SEL field to a new value. */
#define SIM_WR_SOPT1_CFG_CMPOLPTMR0SEL(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_CMPOLPTMR0SEL_MASK) | SIM_SOPT1_CFG_CMPOLPTMR0SEL(value)))
#define SIM_BWR_SOPT1_CFG_CMPOLPTMR0SEL(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT), SIM_SOPT1_CFG_CMPOLPTMR0SEL_SHIFT, SIM_SOPT1_CFG_CMPOLPTMR0SEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1_CFG, field RAMSBDIS[8] (RW)
 *
 * Disable source bias of System SRAM arrays during VLPR and VLPW modes.
 *
 * Values:
 * - 0 - Source bias of System SRAM enabled during VLPR and VLPW modes.
 * - 1 - Source bias of System SRAM disabled during VLPR and VLPW modes.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_RAMSBDIS field. */
#define SIM_RD_SOPT1_CFG_RAMSBDIS(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_RAMSBDIS_MASK) >> SIM_SOPT1_CFG_RAMSBDIS_SHIFT)
#define SIM_BRD_SOPT1_CFG_RAMSBDIS(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_RAMSBDIS_SHIFT, SIM_SOPT1_CFG_RAMSBDIS_WIDTH))

/*! @brief Set the RAMSBDIS field to a new value. */
#define SIM_WR_SOPT1_CFG_RAMSBDIS(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_RAMSBDIS_MASK) | SIM_SOPT1_CFG_RAMSBDIS(value)))
#define SIM_BWR_SOPT1_CFG_RAMSBDIS(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_RAMSBDIS_SHIFT), SIM_SOPT1_CFG_RAMSBDIS_SHIFT, SIM_SOPT1_CFG_RAMSBDIS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT1_CFG, field RAMBPEN[9] (RW)
 *
 * Enable System SRAM bitline precharge during VLPR and VLPW modes.
 *
 * Values:
 * - 0 - Bitline precharge of system SRAM disabled during VLPR and VLPW modes.
 * - 1 - Bitline precharge of system SRAM enabled during VLPR and VLPW modes.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT1_CFG_RAMBPEN field. */
#define SIM_RD_SOPT1_CFG_RAMBPEN(base) ((SIM_SOPT1_CFG_REG(base) & SIM_SOPT1_CFG_RAMBPEN_MASK) >> SIM_SOPT1_CFG_RAMBPEN_SHIFT)
#define SIM_BRD_SOPT1_CFG_RAMBPEN(base) (BME_UBFX32(&SIM_SOPT1_CFG_REG(base), SIM_SOPT1_CFG_RAMBPEN_SHIFT, SIM_SOPT1_CFG_RAMBPEN_WIDTH))

/*! @brief Set the RAMBPEN field to a new value. */
#define SIM_WR_SOPT1_CFG_RAMBPEN(base, value) (SIM_WR_SOPT1_CFG(base, (SIM_RD_SOPT1_CFG(base) & ~SIM_SOPT1_CFG_RAMBPEN_MASK) | SIM_SOPT1_CFG_RAMBPEN(value)))
#define SIM_BWR_SOPT1_CFG_RAMBPEN(base, value) (BME_BFI32(&SIM_SOPT1_CFG_REG(base), ((uint32_t)(value) << SIM_SOPT1_CFG_RAMBPEN_SHIFT), SIM_SOPT1_CFG_RAMBPEN_SHIFT, SIM_SOPT1_CFG_RAMBPEN_WIDTH))
/*@}*/

