pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual SIM_SCGC4 bitfields
 */

/*!
 * @name Register SIM_SCGC4, field EWM[1] (RW)
 *
 * This bit controls the clock gate to the EWM module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_EWM field. */
#define SIM_RD_SCGC4_EWM(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_EWM_MASK) >> SIM_SCGC4_EWM_SHIFT)
#define SIM_BRD_SCGC4_EWM(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_EWM_SHIFT, SIM_SCGC4_EWM_WIDTH))

/*! @brief Set the EWM field to a new value. */
#define SIM_WR_SCGC4_EWM(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_EWM_MASK) | SIM_SCGC4_EWM(value)))
#define SIM_BWR_SCGC4_EWM(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_EWM_SHIFT), SIM_SCGC4_EWM_SHIFT, SIM_SCGC4_EWM_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field MCG[4] (RW)
 *
 * This bit controls the clock gate to the MCG Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_MCG field. */
#define SIM_RD_SCGC4_MCG(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_MCG_MASK) >> SIM_SCGC4_MCG_SHIFT)
#define SIM_BRD_SCGC4_MCG(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_MCG_SHIFT, SIM_SCGC4_MCG_WIDTH))

/*! @brief Set the MCG field to a new value. */
#define SIM_WR_SCGC4_MCG(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_MCG_MASK) | SIM_SCGC4_MCG(value)))
#define SIM_BWR_SCGC4_MCG(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_MCG_SHIFT), SIM_SCGC4_MCG_SHIFT, SIM_SCGC4_MCG_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field OSC[6] (RW)
 *
 * This bit controls the clock gate to the Oscillator(Mhz).
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_OSC field. */
#define SIM_RD_SCGC4_OSC(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_OSC_MASK) >> SIM_SCGC4_OSC_SHIFT)
#define SIM_BRD_SCGC4_OSC(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_OSC_SHIFT, SIM_SCGC4_OSC_WIDTH))

/*! @brief Set the OSC field to a new value. */
#define SIM_WR_SCGC4_OSC(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_OSC_MASK) | SIM_SCGC4_OSC(value)))
#define SIM_BWR_SCGC4_OSC(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_OSC_SHIFT), SIM_SCGC4_OSC_SHIFT, SIM_SCGC4_OSC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field I2C0[7] (RW)
 *
 * This bit controls the clock gate to the I2C0 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_I2C0 field. */
#define SIM_RD_SCGC4_I2C0(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_I2C0_MASK) >> SIM_SCGC4_I2C0_SHIFT)
#define SIM_BRD_SCGC4_I2C0(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_I2C0_SHIFT, SIM_SCGC4_I2C0_WIDTH))

/*! @brief Set the I2C0 field to a new value. */
#define SIM_WR_SCGC4_I2C0(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_I2C0_MASK) | SIM_SCGC4_I2C0(value)))
#define SIM_BWR_SCGC4_I2C0(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_I2C0_SHIFT), SIM_SCGC4_I2C0_SHIFT, SIM_SCGC4_I2C0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field I2C1[8] (RW)
 *
 * This bit controls the clock gate to the I2C1 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_I2C1 field. */
#define SIM_RD_SCGC4_I2C1(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_I2C1_MASK) >> SIM_SCGC4_I2C1_SHIFT)
#define SIM_BRD_SCGC4_I2C1(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_I2C1_SHIFT, SIM_SCGC4_I2C1_WIDTH))

/*! @brief Set the I2C1 field to a new value. */
#define SIM_WR_SCGC4_I2C1(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_I2C1_MASK) | SIM_SCGC4_I2C1(value)))
#define SIM_BWR_SCGC4_I2C1(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_I2C1_SHIFT), SIM_SCGC4_I2C1_SHIFT, SIM_SCGC4_I2C1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field UART0[10] (RW)
 *
 * This bit controls the clock gate to the UART0 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_UART0 field. */
#define SIM_RD_SCGC4_UART0(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_UART0_MASK) >> SIM_SCGC4_UART0_SHIFT)
#define SIM_BRD_SCGC4_UART0(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_UART0_SHIFT, SIM_SCGC4_UART0_WIDTH))

/*! @brief Set the UART0 field to a new value. */
#define SIM_WR_SCGC4_UART0(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_UART0_MASK) | SIM_SCGC4_UART0(value)))
#define SIM_BWR_SCGC4_UART0(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_UART0_SHIFT), SIM_SCGC4_UART0_SHIFT, SIM_SCGC4_UART0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field UART1[11] (RW)
 *
 * This bit controls the clock gate to the UART1 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_UART1 field. */
#define SIM_RD_SCGC4_UART1(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_UART1_MASK) >> SIM_SCGC4_UART1_SHIFT)
#define SIM_BRD_SCGC4_UART1(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_UART1_SHIFT, SIM_SCGC4_UART1_WIDTH))

/*! @brief Set the UART1 field to a new value. */
#define SIM_WR_SCGC4_UART1(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_UART1_MASK) | SIM_SCGC4_UART1(value)))
#define SIM_BWR_SCGC4_UART1(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_UART1_SHIFT), SIM_SCGC4_UART1_SHIFT, SIM_SCGC4_UART1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field UART2[12] (RW)
 *
 * This bit controls the clock gate to the UART2 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_UART2 field. */
#define SIM_RD_SCGC4_UART2(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_UART2_MASK) >> SIM_SCGC4_UART2_SHIFT)
#define SIM_BRD_SCGC4_UART2(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_UART2_SHIFT, SIM_SCGC4_UART2_WIDTH))

/*! @brief Set the UART2 field to a new value. */
#define SIM_WR_SCGC4_UART2(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_UART2_MASK) | SIM_SCGC4_UART2(value)))
#define SIM_BWR_SCGC4_UART2(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_UART2_SHIFT), SIM_SCGC4_UART2_SHIFT, SIM_SCGC4_UART2_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field UART3[13] (RW)
 *
 * This bit controls the clock gate to the UART3 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_UART3 field. */
#define SIM_RD_SCGC4_UART3(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_UART3_MASK) >> SIM_SCGC4_UART3_SHIFT)
#define SIM_BRD_SCGC4_UART3(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_UART3_SHIFT, SIM_SCGC4_UART3_WIDTH))

/*! @brief Set the UART3 field to a new value. */
#define SIM_WR_SCGC4_UART3(base, value) (SIM_WR_SCGC4(base, (SIM_RD_SCGC4(base) & ~SIM_SCGC4_UART3_MASK) | SIM_SCGC4_UART3(value)))
#define SIM_BWR_SCGC4_UART3(base, value) (BME_BFI32(&SIM_SCGC4_REG(base), ((uint32_t)(value) << SIM_SCGC4_UART3_SHIFT), SIM_SCGC4_UART3_SHIFT, SIM_SCGC4_UART3_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SCGC4, field VREF[15] (RW)
 *
 * This bit controls the clock gate to the VREF module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
/*! @brief Read current value of the SIM_SCGC4_VREF field. */
#define SIM_RD_SCGC4_VREF(base) ((SIM_SCGC4_REG(base) & SIM_SCGC4_VREF_MASK) >> SIM_SCGC4_VREF_SHIFT)
#define SIM_BRD_SCGC4_VREF(base) (BME_UBFX32(&SIM_SCGC4_REG(base), SIM_SCGC4_VREF_SHIFT, SIM_SCGC4_VREF_WIDTH))

