pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*
 * Constants & macros for individual SIM_FCFG1 bitfields
 */

/*!
 * @name Register SIM_FCFG1, field FLASHDIS[0] (RW)
 *
 * Flash accesses are disabled (and generate a bus error) and the Flash memory
 * is placed in a low power state. This bit should not be changed during VLP
 * modes. Relocate the interrupt vectors out of Flash memory before disabling the
 * Flash.
 *
 * Values:
 * - 0 - Flash is enabled
 * - 1 - Flash is disabled
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDIS field. */
#define SIM_RD_FCFG1_FLASHDIS(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDIS_MASK) >> SIM_FCFG1_FLASHDIS_SHIFT)
#define SIM_BRD_FCFG1_FLASHDIS(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDIS_SHIFT, SIM_FCFG1_FLASHDIS_WIDTH))

/*! @brief Set the FLASHDIS field to a new value. */
#define SIM_WR_FCFG1_FLASHDIS(base, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~SIM_FCFG1_FLASHDIS_MASK) | SIM_FCFG1_FLASHDIS(value)))
#define SIM_BWR_FCFG1_FLASHDIS(base, value) (BME_BFI32(&SIM_FCFG1_REG(base), ((uint32_t)(value) << SIM_FCFG1_FLASHDIS_SHIFT), SIM_FCFG1_FLASHDIS_SHIFT, SIM_FCFG1_FLASHDIS_WIDTH))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field FLASHDOZE[1] (RW)
 *
 * When set, Flash memory is disabled for the duration of Wait mode. An attempt
 * by the DMA or other bus master to access the Flash when the Flash is disabled
 * will result in a bus error. This bit should be clear during VLP modes. The
 * Flash will be automatically enabled again at the end of Wait mode so interrupt
 * vectors do not need to be relocated out of Flash memory. The wakeup time from
 * Wait mode is extended when this bit is set.
 *
 * Values:
 * - 0 - Flash remains enabled during Wait mode
 * - 1 - Flash is disabled for the duration of Wait mode
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_FLASHDOZE field. */
#define SIM_RD_FCFG1_FLASHDOZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_FLASHDOZE_MASK) >> SIM_FCFG1_FLASHDOZE_SHIFT)
#define SIM_BRD_FCFG1_FLASHDOZE(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_FLASHDOZE_SHIFT, SIM_FCFG1_FLASHDOZE_WIDTH))

/*! @brief Set the FLASHDOZE field to a new value. */
#define SIM_WR_FCFG1_FLASHDOZE(base, value) (SIM_WR_FCFG1(base, (SIM_RD_FCFG1(base) & ~SIM_FCFG1_FLASHDOZE_MASK) | SIM_FCFG1_FLASHDOZE(value)))
#define SIM_BWR_FCFG1_FLASHDOZE(base, value) (BME_BFI32(&SIM_FCFG1_REG(base), ((uint32_t)(value) << SIM_FCFG1_FLASHDOZE_SHIFT), SIM_FCFG1_FLASHDOZE_SHIFT, SIM_FCFG1_FLASHDOZE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_FCFG1, field PFSIZE[27:24] (RO)
 *
 * This field specifies the amount of program flash memory available on the
 * device . Undefined values are reserved.
 *
 * Values:
 * - 0000 - Reserved
 * - 0001 - Reserved
 * - 0011 - Reserved
 * - 0100 - Reserved
 * - 0101 - 64 KB of program flash memory, 2 KB protection region
 * - 0110 - Reserved
 * - 0111 - 128 KB of program flash memory, 4 KB protection region
 * - 1000 - Reserved
 * - 1001 - Reserved
 * - 1111 - (Default)
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG1_PFSIZE field. */
#define SIM_RD_FCFG1_PFSIZE(base) ((SIM_FCFG1_REG(base) & SIM_FCFG1_PFSIZE_MASK) >> SIM_FCFG1_PFSIZE_SHIFT)
#define SIM_BRD_FCFG1_PFSIZE(base) (BME_UBFX32(&SIM_FCFG1_REG(base), SIM_FCFG1_PFSIZE_SHIFT, SIM_FCFG1_PFSIZE_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_FCFG2 - Flash Configuration Register 2
 ******************************************************************************/

/*!
 * @brief SIM_FCFG2 - Flash Configuration Register 2 (RO)
 *
 * Reset value: 0x10000000U
 *
 * Writes to this register can only be performed in Supervisor mode
 */
/*!
 * @name Constants and macros for entire SIM_FCFG2 register
 */
/*@{*/
#define SIM_RD_FCFG2(base)       (SIM_FCFG2_REG(base))
/*@}*/

/*
 * Constants & macros for individual SIM_FCFG2 bitfields
 */

/*!
 * @name Register SIM_FCFG2, field MAXADDR[30:24] (RO)
 *
 * This field concatenated with leading zeros indicates the first invalid
 * address of program flash.
 */
/*@{*/
/*! @brief Read current value of the SIM_FCFG2_MAXADDR field. */
#define SIM_RD_FCFG2_MAXADDR(base) ((SIM_FCFG2_REG(base) & SIM_FCFG2_MAXADDR_MASK) >> SIM_FCFG2_MAXADDR_SHIFT)
#define SIM_BRD_FCFG2_MAXADDR(base) (BME_UBFX32(&SIM_FCFG2_REG(base), SIM_FCFG2_MAXADDR_SHIFT, SIM_FCFG2_MAXADDR_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_UID0 - Unique Identification Register 0
 ******************************************************************************/

/*!
 * @brief SIM_UID0 - Unique Identification Register 0 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UID0 register
 */
/*@{*/
#define SIM_RD_UID0(base)        (SIM_UID0_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UID1 - Unique Identification Register 1
 ******************************************************************************/

/*!
 * @brief SIM_UID1 - Unique Identification Register 1 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UID1 register
 */
/*@{*/
#define SIM_RD_UID1(base)        (SIM_UID1_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UID2 - Unique Identification Register 2
 ******************************************************************************/

/*!
 * @brief SIM_UID2 - Unique Identification Register 2 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UID2 register
 */
/*@{*/
#define SIM_RD_UID2(base)        (SIM_UID2_REG(base))
/*@}*/

/*******************************************************************************
 * SIM_UID3 - Unique Identification Register 3
 ******************************************************************************/

/*!
 * @brief SIM_UID3 - Unique Identification Register 3 (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_UID3 register
 */
/*@{*/
#define SIM_RD_UID3(base)        (SIM_UID3_REG(base))
/*@}*/

