pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the ONCE field to a new value. */
#define TMR_WR_CTRL_ONCE(base, value) (TMR_WR_CTRL(base, (TMR_RD_CTRL(base) & ~TMR_CTRL_ONCE_MASK) | TMR_CTRL_ONCE(value)))
#define TMR_BWR_CTRL_ONCE(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_ONCE_SHIFT), TMR_CTRL_ONCE_SHIFT, TMR_CTRL_ONCE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field SCS[8:7] (RW)
 *
 * These bits identify the external input pin to be used as a count command or
 * timer command. The selected input can trigger the timer to capture the current
 * value of CNTR . The selected input can also be used to specify the count
 * direction. The selected signal can also be used as a fault input when CSCTRL[FAULT]
 * is set. The polarity of the signal can be inverted by SCTRL[IPS].
 *
 * Values:
 * - 00 - Counter 0 input pin
 * - 01 - Counter 1 input pin
 * - 10 - Counter 2 input pin
 * - 11 - Counter 3 input pin
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_SCS field. */
#define TMR_RD_CTRL_SCS(base) ((TMR_CTRL_REG(base) & TMR_CTRL_SCS_MASK) >> TMR_CTRL_SCS_SHIFT)
#define TMR_BRD_CTRL_SCS(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_SCS_SHIFT, TMR_CTRL_SCS_WIDTH))

/*! @brief Set the SCS field to a new value. */
#define TMR_WR_CTRL_SCS(base, value) (TMR_WR_CTRL(base, (TMR_RD_CTRL(base) & ~TMR_CTRL_SCS_MASK) | TMR_CTRL_SCS(value)))
#define TMR_BWR_CTRL_SCS(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_SCS_SHIFT), TMR_CTRL_SCS_SHIFT, TMR_CTRL_SCS_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field PCS[12:9] (RW)
 *
 * These bits select the primary count source. A timer selecting its own output
 * for input is not a legal choice. The result is no counting.
 *
 * Values:
 * - 0000 - Counter 0 input pin
 * - 0001 - Counter 1 input pin
 * - 0010 - Counter 2 input pin
 * - 0011 - Counter 3 input pin
 * - 0100 - Counter 0 output
 * - 0101 - Counter 1 output
 * - 0110 - Counter 2 output
 * - 0111 - Counter 3 output
 * - 1000 - IP bus clock divide by 1 prescaler
 * - 1001 - IP bus clock divide by 2 prescaler
 * - 1010 - IP bus clock divide by 4 prescaler
 * - 1011 - IP bus clock divide by 8 prescaler
 * - 1100 - IP bus clock divide by 16 prescaler
 * - 1101 - IP bus clock divide by 32 prescaler
 * - 1110 - IP bus clock divide by 64 prescaler
 * - 1111 - IP bus clock divide by 128 prescaler
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_PCS field. */
#define TMR_RD_CTRL_PCS(base) ((TMR_CTRL_REG(base) & TMR_CTRL_PCS_MASK) >> TMR_CTRL_PCS_SHIFT)
#define TMR_BRD_CTRL_PCS(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_PCS_SHIFT, TMR_CTRL_PCS_WIDTH))

/*! @brief Set the PCS field to a new value. */
#define TMR_WR_CTRL_PCS(base, value) (TMR_WR_CTRL(base, (TMR_RD_CTRL(base) & ~TMR_CTRL_PCS_MASK) | TMR_CTRL_PCS(value)))
#define TMR_BWR_CTRL_PCS(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_PCS_SHIFT), TMR_CTRL_PCS_SHIFT, TMR_CTRL_PCS_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CTRL, field CM[15:13] (RW)
 *
 * These bits control the basic counting and behavior of the counter.
 *
 * Values:
 * - 000 - No operation
 * - 001 - Count rising edges of primary sourceRising edges are counted only
 *     when SCTRL[IPS] = 0. Falling edges are counted when SCTRL[IPS] = 1. If the
 *     primary count source is IP bus clock divide by 1, only rising edges are
 *     counted regardless of the value of SCTRL[IPS].
 * - 010 - Count rising and falling edges of primary sourceIP bus clock divide
 *     by 1 cannot be used as a primary count source in edge count mode.
 * - 011 - Count rising edges of primary source while secondary input high active
 * - 100 - Quadrature count mode, uses primary and secondary sources
 * - 101 - Count rising edges of primary source; secondary source specifies
 *     directionRising edges are counted only when SCTRL[IPS] = 0. Falling edges are
 *     counted when SCTRL[IPS] = 1.
 * - 110 - Edge of secondary source triggers primary count until compare
 * - 111 - Cascaded counter mode (up/down)The primary count source must be set
 *     to one of the counter outputs.
 */
/*@{*/
/*! @brief Read current value of the TMR_CTRL_CM field. */
#define TMR_RD_CTRL_CM(base) ((TMR_CTRL_REG(base) & TMR_CTRL_CM_MASK) >> TMR_CTRL_CM_SHIFT)
#define TMR_BRD_CTRL_CM(base) (BME_UBFX16(&TMR_CTRL_REG(base), TMR_CTRL_CM_SHIFT, TMR_CTRL_CM_WIDTH))

/*! @brief Set the CM field to a new value. */
#define TMR_WR_CTRL_CM(base, value) (TMR_WR_CTRL(base, (TMR_RD_CTRL(base) & ~TMR_CTRL_CM_MASK) | TMR_CTRL_CM(value)))
#define TMR_BWR_CTRL_CM(base, value) (BME_BFI16(&TMR_CTRL_REG(base), ((uint16_t)(value) << TMR_CTRL_CM_SHIFT), TMR_CTRL_CM_SHIFT, TMR_CTRL_CM_WIDTH))
/*@}*/

/*******************************************************************************
 * TMR_SCTRL - Timer Channel Status and Control Register
 ******************************************************************************/

/*!
 * @brief TMR_SCTRL - Timer Channel Status and Control Register (RW)
 *
 * Reset value: 0x0100U
 */
/*!
 * @name Constants and macros for entire TMR_SCTRL register
 */
/*@{*/
#define TMR_RD_SCTRL(base)       (TMR_SCTRL_REG(base))
#define TMR_WR_SCTRL(base, value) (TMR_SCTRL_REG(base) = (value))
#define TMR_SET_SCTRL(base, value) (BME_OR16(&TMR_SCTRL_REG(base), (uint16_t)(value)))
#define TMR_CLR_SCTRL(base, value) (BME_AND16(&TMR_SCTRL_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_SCTRL(base, value) (BME_XOR16(&TMR_SCTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_SCTRL bitfields
 */

/*!
 * @name Register TMR_SCTRL, field OEN[0] (RW)
 *
 * This bit determines the direction of the external pin.
 *
 * Values:
 * - 0 - The external pin is configured as an input.
 * - 1 - The OFLAG output signal is driven on the external pin. Other timer
 *     groups using this external pin as their input see the driven value. The
 *     polarity of the signal is determined by OPS.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_OEN field. */
#define TMR_RD_SCTRL_OEN(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_OEN_MASK) >> TMR_SCTRL_OEN_SHIFT)
#define TMR_BRD_SCTRL_OEN(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_OEN_SHIFT, TMR_SCTRL_OEN_WIDTH))

/*! @brief Set the OEN field to a new value. */
#define TMR_WR_SCTRL_OEN(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_OEN_MASK) | TMR_SCTRL_OEN(value)))
#define TMR_BWR_SCTRL_OEN(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_OEN_SHIFT), TMR_SCTRL_OEN_SHIFT, TMR_SCTRL_OEN_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field OPS[1] (RW)
 *
 * This bit determines the polarity of the OFLAG output signal.
 *
 * Values:
 * - 0 - True polarity.
 * - 1 - Inverted polarity.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_OPS field. */
#define TMR_RD_SCTRL_OPS(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_OPS_MASK) >> TMR_SCTRL_OPS_SHIFT)
#define TMR_BRD_SCTRL_OPS(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_OPS_SHIFT, TMR_SCTRL_OPS_WIDTH))

/*! @brief Set the OPS field to a new value. */
#define TMR_WR_SCTRL_OPS(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_OPS_MASK) | TMR_SCTRL_OPS(value)))
#define TMR_BWR_SCTRL_OPS(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_OPS_SHIFT), TMR_SCTRL_OPS_SHIFT, TMR_SCTRL_OPS_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field FORCE[2] (WORZ)
 *
 * This write only bit forces the current value of VAL to be written to the
 * OFLAG output. This bit always reads as a zero. VAL and FORCE can be written
 * simultaneously in a single write operation. Write to FORCE only if the counter is
 * disabled. Setting this bit while the counter is enabled may yield unpredictable
 * results.
 */
/*@{*/
/*! @brief Set the FORCE field to a new value. */
#define TMR_WR_SCTRL_FORCE(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_FORCE_MASK) | TMR_SCTRL_FORCE(value)))
#define TMR_BWR_SCTRL_FORCE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_FORCE_SHIFT), TMR_SCTRL_FORCE_SHIFT, TMR_SCTRL_FORCE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field VAL[3] (RW)
 *
 * This bit determines the value of the OFLAG output signal when software
 * triggers a FORCE command.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_VAL field. */
#define TMR_RD_SCTRL_VAL(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_VAL_MASK) >> TMR_SCTRL_VAL_SHIFT)
#define TMR_BRD_SCTRL_VAL(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_VAL_SHIFT, TMR_SCTRL_VAL_WIDTH))

