pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*! @brief Set the TOF field to a new value. */
#define TMR_WR_SCTRL_TOF(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_TOF_MASK) | TMR_SCTRL_TOF(value)))
#define TMR_BWR_SCTRL_TOF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TOF_SHIFT), TMR_SCTRL_TOF_SHIFT, TMR_SCTRL_TOF_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TCFIE[14] (RW)
 *
 * This bit (when set) enables interrupts when TCF is set.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TCFIE field. */
#define TMR_RD_SCTRL_TCFIE(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TCFIE_MASK) >> TMR_SCTRL_TCFIE_SHIFT)
#define TMR_BRD_SCTRL_TCFIE(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TCFIE_SHIFT, TMR_SCTRL_TCFIE_WIDTH))

/*! @brief Set the TCFIE field to a new value. */
#define TMR_WR_SCTRL_TCFIE(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_TCFIE_MASK) | TMR_SCTRL_TCFIE(value)))
#define TMR_BWR_SCTRL_TCFIE(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TCFIE_SHIFT), TMR_SCTRL_TCFIE_SHIFT, TMR_SCTRL_TCFIE_WIDTH))
/*@}*/

/*!
 * @name Register TMR_SCTRL, field TCF[15] (RW)
 *
 * This bit is set when a successful compare occurs. This bit is cleared by
 * writing a zero to this bit location.
 */
/*@{*/
/*! @brief Read current value of the TMR_SCTRL_TCF field. */
#define TMR_RD_SCTRL_TCF(base) ((TMR_SCTRL_REG(base) & TMR_SCTRL_TCF_MASK) >> TMR_SCTRL_TCF_SHIFT)
#define TMR_BRD_SCTRL_TCF(base) (BME_UBFX16(&TMR_SCTRL_REG(base), TMR_SCTRL_TCF_SHIFT, TMR_SCTRL_TCF_WIDTH))

/*! @brief Set the TCF field to a new value. */
#define TMR_WR_SCTRL_TCF(base, value) (TMR_WR_SCTRL(base, (TMR_RD_SCTRL(base) & ~TMR_SCTRL_TCF_MASK) | TMR_SCTRL_TCF(value)))
#define TMR_BWR_SCTRL_TCF(base, value) (BME_BFI16(&TMR_SCTRL_REG(base), ((uint16_t)(value) << TMR_SCTRL_TCF_SHIFT), TMR_SCTRL_TCF_SHIFT, TMR_SCTRL_TCF_WIDTH))
/*@}*/

/*******************************************************************************
 * TMR_CMPLD1 - Timer Channel Comparator Load Register 1
 ******************************************************************************/

/*!
 * @brief TMR_CMPLD1 - Timer Channel Comparator Load Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CMPLD1 register
 */
/*@{*/
#define TMR_RD_CMPLD1(base)      (TMR_CMPLD1_REG(base))
#define TMR_WR_CMPLD1(base, value) (TMR_CMPLD1_REG(base) = (value))
#define TMR_SET_CMPLD1(base, value) (BME_OR16(&TMR_CMPLD1_REG(base), (uint16_t)(value)))
#define TMR_CLR_CMPLD1(base, value) (BME_AND16(&TMR_CMPLD1_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CMPLD1(base, value) (BME_XOR16(&TMR_CMPLD1_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CMPLD2 - Timer Channel Comparator Load Register 2
 ******************************************************************************/

/*!
 * @brief TMR_CMPLD2 - Timer Channel Comparator Load Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CMPLD2 register
 */
/*@{*/
#define TMR_RD_CMPLD2(base)      (TMR_CMPLD2_REG(base))
#define TMR_WR_CMPLD2(base, value) (TMR_CMPLD2_REG(base) = (value))
#define TMR_SET_CMPLD2(base, value) (BME_OR16(&TMR_CMPLD2_REG(base), (uint16_t)(value)))
#define TMR_CLR_CMPLD2(base, value) (BME_AND16(&TMR_CMPLD2_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CMPLD2(base, value) (BME_XOR16(&TMR_CMPLD2_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * TMR_CSCTRL - Timer Channel Comparator Status and Control Register
 ******************************************************************************/

/*!
 * @brief TMR_CSCTRL - Timer Channel Comparator Status and Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire TMR_CSCTRL register
 */
/*@{*/
#define TMR_RD_CSCTRL(base)      (TMR_CSCTRL_REG(base))
#define TMR_WR_CSCTRL(base, value) (TMR_CSCTRL_REG(base) = (value))
#define TMR_SET_CSCTRL(base, value) (BME_OR16(&TMR_CSCTRL_REG(base), (uint16_t)(value)))
#define TMR_CLR_CSCTRL(base, value) (BME_AND16(&TMR_CSCTRL_REG(base), (uint16_t)(~(value))))
#define TMR_TOG_CSCTRL(base, value) (BME_XOR16(&TMR_CSCTRL_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual TMR_CSCTRL bitfields
 */

/*!
 * @name Register TMR_CSCTRL, field CL1[1:0] (RW)
 *
 * These bits control when COMP1 is preloaded with the value from CMPLD1.
 *
 * Values:
 * - 00 - Never preload
 * - 01 - Load upon successful compare with the value in COMP1
 * - 10 - Load upon successful compare with the value in COMP2
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_CL1 field. */
#define TMR_RD_CSCTRL_CL1(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_CL1_MASK) >> TMR_CSCTRL_CL1_SHIFT)
#define TMR_BRD_CSCTRL_CL1(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_CL1_SHIFT, TMR_CSCTRL_CL1_WIDTH))

/*! @brief Set the CL1 field to a new value. */
#define TMR_WR_CSCTRL_CL1(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_CL1_MASK) | TMR_CSCTRL_CL1(value)))
#define TMR_BWR_CSCTRL_CL1(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_CL1_SHIFT), TMR_CSCTRL_CL1_SHIFT, TMR_CSCTRL_CL1_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field CL2[3:2] (RW)
 *
 * These bits control when COMP2 is preloaded with the value from CMPLD2.
 *
 * Values:
 * - 00 - Never preload
 * - 01 - Load upon successful compare with the value in COMP1
 * - 10 - Load upon successful compare with the value in COMP2
 * - 11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_CL2 field. */
#define TMR_RD_CSCTRL_CL2(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_CL2_MASK) >> TMR_CSCTRL_CL2_SHIFT)
#define TMR_BRD_CSCTRL_CL2(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_CL2_SHIFT, TMR_CSCTRL_CL2_WIDTH))

/*! @brief Set the CL2 field to a new value. */
#define TMR_WR_CSCTRL_CL2(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_CL2_MASK) | TMR_CSCTRL_CL2(value)))
#define TMR_BWR_CSCTRL_CL2(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_CL2_SHIFT), TMR_CSCTRL_CL2_SHIFT, TMR_CSCTRL_CL2_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field TCF1[4] (RW)
 *
 * When set, this bit indicates a successful comparison of the timer and the the
 * COMP1 register has occurred. This bit is sticky, and will remain set until
 * explicitly cleared by writing a zero to this bit location.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_TCF1 field. */
#define TMR_RD_CSCTRL_TCF1(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_TCF1_MASK) >> TMR_CSCTRL_TCF1_SHIFT)
#define TMR_BRD_CSCTRL_TCF1(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_TCF1_SHIFT, TMR_CSCTRL_TCF1_WIDTH))

/*! @brief Set the TCF1 field to a new value. */
#define TMR_WR_CSCTRL_TCF1(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_TCF1_MASK) | TMR_CSCTRL_TCF1(value)))
#define TMR_BWR_CSCTRL_TCF1(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_TCF1_SHIFT), TMR_CSCTRL_TCF1_SHIFT, TMR_CSCTRL_TCF1_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field TCF2[5] (RW)
 *
 * When set, this bit indicates a successful comparison of the timer and the the
 * COMP2 register has occurred. This bit is sticky, and will remain set until
 * explicitly cleared by writing a zero to this bit location.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_TCF2 field. */
#define TMR_RD_CSCTRL_TCF2(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_TCF2_MASK) >> TMR_CSCTRL_TCF2_SHIFT)
#define TMR_BRD_CSCTRL_TCF2(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_TCF2_SHIFT, TMR_CSCTRL_TCF2_WIDTH))

/*! @brief Set the TCF2 field to a new value. */
#define TMR_WR_CSCTRL_TCF2(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_TCF2_MASK) | TMR_CSCTRL_TCF2(value)))
#define TMR_BWR_CSCTRL_TCF2(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_TCF2_SHIFT), TMR_CSCTRL_TCF2_SHIFT, TMR_CSCTRL_TCF2_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field TCF1EN[6] (RW)
 *
 * An interrupt is issued when both this bit and TCF1 are set.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_TCF1EN field. */
#define TMR_RD_CSCTRL_TCF1EN(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_TCF1EN_MASK) >> TMR_CSCTRL_TCF1EN_SHIFT)
#define TMR_BRD_CSCTRL_TCF1EN(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_TCF1EN_SHIFT, TMR_CSCTRL_TCF1EN_WIDTH))

/*! @brief Set the TCF1EN field to a new value. */
#define TMR_WR_CSCTRL_TCF1EN(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_TCF1EN_MASK) | TMR_CSCTRL_TCF1EN(value)))
#define TMR_BWR_CSCTRL_TCF1EN(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_TCF1EN_SHIFT), TMR_CSCTRL_TCF1EN_SHIFT, TMR_CSCTRL_TCF1EN_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field TCF2EN[7] (RW)
 *
 * An interrupt is issued when both this bit and TCF2 are set.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_TCF2EN field. */
#define TMR_RD_CSCTRL_TCF2EN(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_TCF2EN_MASK) >> TMR_CSCTRL_TCF2EN_SHIFT)
#define TMR_BRD_CSCTRL_TCF2EN(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_TCF2EN_SHIFT, TMR_CSCTRL_TCF2EN_WIDTH))

/*! @brief Set the TCF2EN field to a new value. */
#define TMR_WR_CSCTRL_TCF2EN(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_TCF2EN_MASK) | TMR_CSCTRL_TCF2EN(value)))
#define TMR_BWR_CSCTRL_TCF2EN(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_TCF2EN_SHIFT), TMR_CSCTRL_TCF2EN_SHIFT, TMR_CSCTRL_TCF2EN_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field OFLAG[8] (RO)
 *
 * This read only bit shows the state of the Timer's internal OFLAG signal prior
 * to consideration of polarity or debug mode.
 *
 * Values:
 * - 0 - The OFLAG signal is low.
 * - 1 - The OFLAG signal is high.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_OFLAG field. */
#define TMR_RD_CSCTRL_OFLAG(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_OFLAG_MASK) >> TMR_CSCTRL_OFLAG_SHIFT)
#define TMR_BRD_CSCTRL_OFLAG(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_OFLAG_SHIFT, TMR_CSCTRL_OFLAG_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field UP[9] (RO)
 *
 * This read-only bit is used during quadrature count mode, CTRL[CM] = 100, to
 * read the direction of the last count. CTRL[DIR] reverses the sense of this bit.
 *
 * Values:
 * - 0 - The last count was in the DOWN direction.
 * - 1 - The last count was in the UP direction.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_UP field. */
#define TMR_RD_CSCTRL_UP(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_UP_MASK) >> TMR_CSCTRL_UP_SHIFT)
#define TMR_BRD_CSCTRL_UP(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_UP_SHIFT, TMR_CSCTRL_UP_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field TCI[10] (RW)
 *
 * This bit is used during triggered count mode, CTRL[CM] = 110, to enable the
 * counter to be re-initialized when a second trigger occurs while the counter is
 * still counting. Normally, the second trigger causes the counting to stop/pause
 * until a third trigger occurs. With this bit set, a second trigger event
 * causes the counter to re-initialize and continue counting.
 *
 * Values:
 * - 0 - Stop counter upon receiving a second trigger event while still counting
 *     from the first trigger event.
 * - 1 - Reload the counter upon receiving a second trigger event while still
 *     counting from the first trigger event.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_TCI field. */
#define TMR_RD_CSCTRL_TCI(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_TCI_MASK) >> TMR_CSCTRL_TCI_SHIFT)
#define TMR_BRD_CSCTRL_TCI(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_TCI_SHIFT, TMR_CSCTRL_TCI_WIDTH))

/*! @brief Set the TCI field to a new value. */
#define TMR_WR_CSCTRL_TCI(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_TCI_MASK) | TMR_CSCTRL_TCI(value)))
#define TMR_BWR_CSCTRL_TCI(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_TCI_SHIFT), TMR_CSCTRL_TCI_SHIFT, TMR_CSCTRL_TCI_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field ROC[11] (RW)
 *
 * This bit enables the capture function to cause the counter to be reloaded
 * from the LOAD register.
 *
 * Values:
 * - 0 - Do not reload the counter on a capture event.
 * - 1 - Reload the counter on a capture event.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_ROC field. */
#define TMR_RD_CSCTRL_ROC(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_ROC_MASK) >> TMR_CSCTRL_ROC_SHIFT)
#define TMR_BRD_CSCTRL_ROC(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_ROC_SHIFT, TMR_CSCTRL_ROC_WIDTH))

/*! @brief Set the ROC field to a new value. */
#define TMR_WR_CSCTRL_ROC(base, value) (TMR_WR_CSCTRL(base, (TMR_RD_CSCTRL(base) & ~TMR_CSCTRL_ROC_MASK) | TMR_CSCTRL_ROC(value)))
#define TMR_BWR_CSCTRL_ROC(base, value) (BME_BFI16(&TMR_CSCTRL_REG(base), ((uint16_t)(value) << TMR_CSCTRL_ROC_SHIFT), TMR_CSCTRL_ROC_SHIFT, TMR_CSCTRL_ROC_WIDTH))
/*@}*/

/*!
 * @name Register TMR_CSCTRL, field ALT_LOAD[12] (RW)
 *
 * This bit allows for an alternative method for loading the counter during
 * modulo counting. Normally, the counter can be loaded only with the value from the
 * LOAD register. When this bit is set, the counter is loaded from the LOAD
 * register when counting up and a match with COMP1 occurs, or the counter is loaded
 * from the CMPLD2 register when counting down and a match with COMP2 occurs.
 *
 * Values:
 * - 0 - Counter can be re-initialized only with the LOAD register.
 * - 1 - Counter can be re-initialized with the LOAD or CMPLD2 registers
 *     depending on count direction.
 */
/*@{*/
/*! @brief Read current value of the TMR_CSCTRL_ALT_LOAD field. */
#define TMR_RD_CSCTRL_ALT_LOAD(base) ((TMR_CSCTRL_REG(base) & TMR_CSCTRL_ALT_LOAD_MASK) >> TMR_CSCTRL_ALT_LOAD_SHIFT)
#define TMR_BRD_CSCTRL_ALT_LOAD(base) (BME_UBFX16(&TMR_CSCTRL_REG(base), TMR_CSCTRL_ALT_LOAD_SHIFT, TMR_CSCTRL_ALT_LOAD_WIDTH))

