pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * WDOG_RSTCNT - Watchdog Reset Count register
 ******************************************************************************/

/*!
 * @brief WDOG_RSTCNT - Watchdog Reset Count register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire WDOG_RSTCNT register
 */
/*@{*/
#define WDOG_RD_RSTCNT(base)     (WDOG_RSTCNT_REG(base))
#define WDOG_WR_RSTCNT(base, value) (WDOG_RSTCNT_REG(base) = (value))
#define WDOG_SET_RSTCNT(base, value) (BME_OR16(&WDOG_RSTCNT_REG(base), (uint16_t)(value)))
#define WDOG_CLR_RSTCNT(base, value) (BME_AND16(&WDOG_RSTCNT_REG(base), (uint16_t)(~(value))))
#define WDOG_TOG_RSTCNT(base, value) (BME_XOR16(&WDOG_RSTCNT_REG(base), (uint16_t)(value)))
/*@}*/

/*******************************************************************************
 * WDOG_PRESC - Watchdog Prescaler register
 ******************************************************************************/

/*!
 * @brief WDOG_PRESC - Watchdog Prescaler register (RW)
 *
 * Reset value: 0x0400U
 */
/*!
 * @name Constants and macros for entire WDOG_PRESC register
 */
/*@{*/
#define WDOG_RD_PRESC(base)      (WDOG_PRESC_REG(base))
#define WDOG_WR_PRESC(base, value) (WDOG_PRESC_REG(base) = (value))
#define WDOG_SET_PRESC(base, value) (BME_OR16(&WDOG_PRESC_REG(base), (uint16_t)(value)))
#define WDOG_CLR_PRESC(base, value) (BME_AND16(&WDOG_PRESC_REG(base), (uint16_t)(~(value))))
#define WDOG_TOG_PRESC(base, value) (BME_XOR16(&WDOG_PRESC_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual WDOG_PRESC bitfields
 */

/*!
 * @name Register WDOG_PRESC, field PRESCVAL[10:8] (RW)
 *
 * 3-bit prescaler for the watchdog clock source. A value of zero indicates no
 * division of the input WDOG clock. The watchdog clock is divided by (PRESCVAL +
 * 1) to provide the prescaled WDOG_CLK.
 */
/*@{*/
/*! @brief Read current value of the WDOG_PRESC_PRESCVAL field. */
#define WDOG_RD_PRESC_PRESCVAL(base) ((WDOG_PRESC_REG(base) & WDOG_PRESC_PRESCVAL_MASK) >> WDOG_PRESC_PRESCVAL_SHIFT)
#define WDOG_BRD_PRESC_PRESCVAL(base) (BME_UBFX16(&WDOG_PRESC_REG(base), WDOG_PRESC_PRESCVAL_SHIFT, WDOG_PRESC_PRESCVAL_WIDTH))

/*! @brief Set the PRESCVAL field to a new value. */
#define WDOG_WR_PRESC_PRESCVAL(base, value) (WDOG_WR_PRESC(base, (WDOG_RD_PRESC(base) & ~WDOG_PRESC_PRESCVAL_MASK) | WDOG_PRESC_PRESCVAL(value)))
#define WDOG_BWR_PRESC_PRESCVAL(base, value) (BME_BFI16(&WDOG_PRESC_REG(base), ((uint16_t)(value) << WDOG_PRESC_PRESCVAL_SHIFT), WDOG_PRESC_PRESCVAL_SHIFT, WDOG_PRESC_PRESCVAL_WIDTH))
/*@}*/

/*
 * MKM14ZA5 XBAR
 *
 * Crossbar Switch
 *
 * Registers defined in this header file:
 * - XBAR_SEL0 - Crossbar Select Register 0
 * - XBAR_SEL1 - Crossbar Select Register 1
 * - XBAR_SEL2 - Crossbar Select Register 2
 * - XBAR_SEL3 - Crossbar Select Register 3
 * - XBAR_SEL4 - Crossbar Select Register 4
 * - XBAR_SEL5 - Crossbar Select Register 5
 * - XBAR_SEL6 - Crossbar Select Register 6
 * - XBAR_SEL7 - Crossbar Select Register 7
 * - XBAR_SEL8 - Crossbar Select Register 8
 * - XBAR_SEL9 - Crossbar Select Register 9
 * - XBAR_SEL10 - Crossbar Select Register 10
 * - XBAR_SEL11 - Crossbar Select Register 11
 * - XBAR_SEL12 - Crossbar Select Register 12
 * - XBAR_SEL13 - Crossbar Select Register 13
 * - XBAR_SEL14 - Crossbar Select Register 14
 * - XBAR_SEL15 - Crossbar Select Register 15
 * - XBAR_SEL16 - Crossbar Select Register 16
 * - XBAR_CTRL0 - Crossbar Control Register 0
 */

#define XBAR_INSTANCE_COUNT (1U) /*!< Number of instances of the XBAR module. */
#define XBAR_IDX (0U) /*!< Instance number for XBAR. */

/*******************************************************************************
 * XBAR_SEL0 - Crossbar Select Register 0
 ******************************************************************************/

/*!
 * @brief XBAR_SEL0 - Crossbar Select Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL0 register
 */
/*@{*/
#define XBAR_RD_SEL0(base)       (XBAR_SEL0_REG(base))
#define XBAR_WR_SEL0(base, value) (XBAR_SEL0_REG(base) = (value))
#define XBAR_SET_SEL0(base, value) (BME_OR16(&XBAR_SEL0_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL0(base, value) (BME_AND16(&XBAR_SEL0_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL0(base, value) (BME_XOR16(&XBAR_SEL0_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL0 bitfields
 */

/*!
 * @name Register XBAR_SEL0, field SEL0[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT0 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL0_SEL0 field. */
#define XBAR_RD_SEL0_SEL0(base) ((XBAR_SEL0_REG(base) & XBAR_SEL0_SEL0_MASK) >> XBAR_SEL0_SEL0_SHIFT)
#define XBAR_BRD_SEL0_SEL0(base) (BME_UBFX16(&XBAR_SEL0_REG(base), XBAR_SEL0_SEL0_SHIFT, XBAR_SEL0_SEL0_WIDTH))

/*! @brief Set the SEL0 field to a new value. */
#define XBAR_WR_SEL0_SEL0(base, value) (XBAR_WR_SEL0(base, (XBAR_RD_SEL0(base) & ~XBAR_SEL0_SEL0_MASK) | XBAR_SEL0_SEL0(value)))
#define XBAR_BWR_SEL0_SEL0(base, value) (BME_BFI16(&XBAR_SEL0_REG(base), ((uint16_t)(value) << XBAR_SEL0_SEL0_SHIFT), XBAR_SEL0_SEL0_SHIFT, XBAR_SEL0_SEL0_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL0, field SEL1[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT1 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL0_SEL1 field. */
#define XBAR_RD_SEL0_SEL1(base) ((XBAR_SEL0_REG(base) & XBAR_SEL0_SEL1_MASK) >> XBAR_SEL0_SEL1_SHIFT)
#define XBAR_BRD_SEL0_SEL1(base) (BME_UBFX16(&XBAR_SEL0_REG(base), XBAR_SEL0_SEL1_SHIFT, XBAR_SEL0_SEL1_WIDTH))

/*! @brief Set the SEL1 field to a new value. */
#define XBAR_WR_SEL0_SEL1(base, value) (XBAR_WR_SEL0(base, (XBAR_RD_SEL0(base) & ~XBAR_SEL0_SEL1_MASK) | XBAR_SEL0_SEL1(value)))
#define XBAR_BWR_SEL0_SEL1(base, value) (BME_BFI16(&XBAR_SEL0_REG(base), ((uint16_t)(value) << XBAR_SEL0_SEL1_SHIFT), XBAR_SEL0_SEL1_SHIFT, XBAR_SEL0_SEL1_WIDTH))
/*@}*/

