pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/*******************************************************************************
 * XBAR_SEL12 - Crossbar Select Register 12
 ******************************************************************************/

/*!
 * @brief XBAR_SEL12 - Crossbar Select Register 12 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL12 register
 */
/*@{*/
#define XBAR_RD_SEL12(base)      (XBAR_SEL12_REG(base))
#define XBAR_WR_SEL12(base, value) (XBAR_SEL12_REG(base) = (value))
#define XBAR_SET_SEL12(base, value) (BME_OR16(&XBAR_SEL12_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL12(base, value) (BME_AND16(&XBAR_SEL12_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL12(base, value) (BME_XOR16(&XBAR_SEL12_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL12 bitfields
 */

/*!
 * @name Register XBAR_SEL12, field SEL24[4:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT24 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL12_SEL24 field. */
#define XBAR_RD_SEL12_SEL24(base) ((XBAR_SEL12_REG(base) & XBAR_SEL12_SEL24_MASK) >> XBAR_SEL12_SEL24_SHIFT)
#define XBAR_BRD_SEL12_SEL24(base) (BME_UBFX16(&XBAR_SEL12_REG(base), XBAR_SEL12_SEL24_SHIFT, XBAR_SEL12_SEL24_WIDTH))

/*! @brief Set the SEL24 field to a new value. */
#define XBAR_WR_SEL12_SEL24(base, value) (XBAR_WR_SEL12(base, (XBAR_RD_SEL12(base) & ~XBAR_SEL12_SEL24_MASK) | XBAR_SEL12_SEL24(value)))
#define XBAR_BWR_SEL12_SEL24(base, value) (BME_BFI16(&XBAR_SEL12_REG(base), ((uint16_t)(value) << XBAR_SEL12_SEL24_SHIFT), XBAR_SEL12_SEL24_SHIFT, XBAR_SEL12_SEL24_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL12, field SEL25[12:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT25 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL12_SEL25 field. */
#define XBAR_RD_SEL12_SEL25(base) ((XBAR_SEL12_REG(base) & XBAR_SEL12_SEL25_MASK) >> XBAR_SEL12_SEL25_SHIFT)
#define XBAR_BRD_SEL12_SEL25(base) (BME_UBFX16(&XBAR_SEL12_REG(base), XBAR_SEL12_SEL25_SHIFT, XBAR_SEL12_SEL25_WIDTH))

/*! @brief Set the SEL25 field to a new value. */
#define XBAR_WR_SEL12_SEL25(base, value) (XBAR_WR_SEL12(base, (XBAR_RD_SEL12(base) & ~XBAR_SEL12_SEL25_MASK) | XBAR_SEL12_SEL25(value)))
#define XBAR_BWR_SEL12_SEL25(base, value) (BME_BFI16(&XBAR_SEL12_REG(base), ((uint16_t)(value) << XBAR_SEL12_SEL25_SHIFT), XBAR_SEL12_SEL25_SHIFT, XBAR_SEL12_SEL25_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL13 - Crossbar Select Register 13
 ******************************************************************************/

/*!
 * @brief XBAR_SEL13 - Crossbar Select Register 13 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL13 register
 */
/*@{*/
#define XBAR_RD_SEL13(base)      (XBAR_SEL13_REG(base))
#define XBAR_WR_SEL13(base, value) (XBAR_SEL13_REG(base) = (value))
#define XBAR_SET_SEL13(base, value) (BME_OR16(&XBAR_SEL13_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL13(base, value) (BME_AND16(&XBAR_SEL13_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL13(base, value) (BME_XOR16(&XBAR_SEL13_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL13 bitfields
 */

/*!
 * @name Register XBAR_SEL13, field SEL26[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT26 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL13_SEL26 field. */
#define XBAR_RD_SEL13_SEL26(base) ((XBAR_SEL13_REG(base) & XBAR_SEL13_SEL26_MASK) >> XBAR_SEL13_SEL26_SHIFT)
#define XBAR_BRD_SEL13_SEL26(base) (BME_UBFX16(&XBAR_SEL13_REG(base), XBAR_SEL13_SEL26_SHIFT, XBAR_SEL13_SEL26_WIDTH))

/*! @brief Set the SEL26 field to a new value. */
#define XBAR_WR_SEL13_SEL26(base, value) (XBAR_WR_SEL13(base, (XBAR_RD_SEL13(base) & ~XBAR_SEL13_SEL26_MASK) | XBAR_SEL13_SEL26(value)))
#define XBAR_BWR_SEL13_SEL26(base, value) (BME_BFI16(&XBAR_SEL13_REG(base), ((uint16_t)(value) << XBAR_SEL13_SEL26_SHIFT), XBAR_SEL13_SEL26_SHIFT, XBAR_SEL13_SEL26_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL13, field SEL27[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT27 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL13_SEL27 field. */
#define XBAR_RD_SEL13_SEL27(base) ((XBAR_SEL13_REG(base) & XBAR_SEL13_SEL27_MASK) >> XBAR_SEL13_SEL27_SHIFT)
#define XBAR_BRD_SEL13_SEL27(base) (BME_UBFX16(&XBAR_SEL13_REG(base), XBAR_SEL13_SEL27_SHIFT, XBAR_SEL13_SEL27_WIDTH))

/*! @brief Set the SEL27 field to a new value. */
#define XBAR_WR_SEL13_SEL27(base, value) (XBAR_WR_SEL13(base, (XBAR_RD_SEL13(base) & ~XBAR_SEL13_SEL27_MASK) | XBAR_SEL13_SEL27(value)))
#define XBAR_BWR_SEL13_SEL27(base, value) (BME_BFI16(&XBAR_SEL13_REG(base), ((uint16_t)(value) << XBAR_SEL13_SEL27_SHIFT), XBAR_SEL13_SEL27_SHIFT, XBAR_SEL13_SEL27_WIDTH))
/*@}*/

/*******************************************************************************
 * XBAR_SEL14 - Crossbar Select Register 14
 ******************************************************************************/

/*!
 * @brief XBAR_SEL14 - Crossbar Select Register 14 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBAR_SEL14 register
 */
/*@{*/
#define XBAR_RD_SEL14(base)      (XBAR_SEL14_REG(base))
#define XBAR_WR_SEL14(base, value) (XBAR_SEL14_REG(base) = (value))
#define XBAR_SET_SEL14(base, value) (BME_OR16(&XBAR_SEL14_REG(base), (uint16_t)(value)))
#define XBAR_CLR_SEL14(base, value) (BME_AND16(&XBAR_SEL14_REG(base), (uint16_t)(~(value))))
#define XBAR_TOG_SEL14(base, value) (BME_XOR16(&XBAR_SEL14_REG(base), (uint16_t)(value)))
/*@}*/

/*
 * Constants & macros for individual XBAR_SEL14 bitfields
 */

/*!
 * @name Register XBAR_SEL14, field SEL28[5:0] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT28 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL14_SEL28 field. */
#define XBAR_RD_SEL14_SEL28(base) ((XBAR_SEL14_REG(base) & XBAR_SEL14_SEL28_MASK) >> XBAR_SEL14_SEL28_SHIFT)
#define XBAR_BRD_SEL14_SEL28(base) (BME_UBFX16(&XBAR_SEL14_REG(base), XBAR_SEL14_SEL28_SHIFT, XBAR_SEL14_SEL28_WIDTH))

/*! @brief Set the SEL28 field to a new value. */
#define XBAR_WR_SEL14_SEL28(base, value) (XBAR_WR_SEL14(base, (XBAR_RD_SEL14(base) & ~XBAR_SEL14_SEL28_MASK) | XBAR_SEL14_SEL28(value)))
#define XBAR_BWR_SEL14_SEL28(base, value) (BME_BFI16(&XBAR_SEL14_REG(base), ((uint16_t)(value) << XBAR_SEL14_SEL28_SHIFT), XBAR_SEL14_SEL28_SHIFT, XBAR_SEL14_SEL28_WIDTH))
/*@}*/

/*!
 * @name Register XBAR_SEL14, field SEL29[13:8] (RW)
 *
 * Input (XBAR_INn) to be muxed to XBAR_OUT29 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBAR_SEL14_SEL29 field. */
#define XBAR_RD_SEL14_SEL29(base) ((XBAR_SEL14_REG(base) & XBAR_SEL14_SEL29_MASK) >> XBAR_SEL14_SEL29_SHIFT)
#define XBAR_BRD_SEL14_SEL29(base) (BME_UBFX16(&XBAR_SEL14_REG(base), XBAR_SEL14_SEL29_SHIFT, XBAR_SEL14_SEL29_WIDTH))

/*! @brief Set the SEL29 field to a new value. */
#define XBAR_WR_SEL14_SEL29(base, value) (XBAR_WR_SEL14(base, (XBAR_RD_SEL14(base) & ~XBAR_SEL14_SEL29_MASK) | XBAR_SEL14_SEL29(value)))
#define XBAR_BWR_SEL14_SEL29(base, value) (BME_BFI16(&XBAR_SEL14_REG(base), ((uint16_t)(value) << XBAR_SEL14_SEL29_SHIFT), XBAR_SEL14_SEL29_SHIFT, XBAR_SEL14_SEL29_WIDTH))
/*@}*/

