pyocd/FlashAlgo/source/freescale/devices/MKM14ZA5/MKM14ZA5_extension.h
/* Macros for XBAR_CONTROLx register address. */
#define XBAR_CTRLx_ADDR(base, index)              ((uintptr_t)&XBAR_CTRL0_REG(base) + ((index) & (~1U)))

/* Set the SELx field to a new value. */
#define XBAR_WR_SELx_SELx(base, index, value)     (BME_BFI16(XBAR_SELx_ADDR((base), (index)), ((uint16_t)(value) << (8U * ((index) % 2U))), (8U * ((index) % 2U)), 6U))

/* Read current value of the XBAR_SELx_SELx field. */
#define XBAR_RD_SELx_SELx(base, index)            (BME_UBFX16(XBAR_SELx_ADDR((base), (index)), 8U * ((index) % 2U), 6U))

/* Set the CONTROLx_DENx field to a new value. */
#define XBAR_WR_CTRLx_DENx(base, index, value)    (BME_BFI16(XBAR_CTRLx_ADDR((base), (index)), ((uint16_t)(value) << (8U * ((index) % 2U))), (8U * ((index) % 2U)), 1U))

/* Read current value of the XBAR_CONTROLx_DENx field. */
#define XBAR_RD_CTRLx_DENx(base, index)           (BME_UBFX16(XBAR_CTRLx_ADDR((base), (index)), (8U * ((index) % 2U)), 1U))

/* Set the CONTROLx_IENx field to a new value. */
#define XBAR_WR_CTRLx_IENx(base, index, value)    (BME_BFI16(XBAR_CTRLx_ADDR((base), (index)), ((uint16_t)(value) << (8U * ((index) % 2U) + 1U)), (8U * ((index) % 2U) + 1U), 1U))

/* Read current value of the XBAR_CONTROLx_IENx field. */
#define XBAR_RD_CTRLx_IENx(base, index)           (BME_UBFX16(XBAR_CTRLx_ADDR((base), (index)), (8U * ((index) % 2U) + 1U), 1U))

/* Set the CONTROLx_EDGEx field to a new value. */
#define XBAR_WR_CTRLx_EDGEx(base, index, value)   (BME_BFI16(XBAR_CTRLx_ADDR((base), (index)), ((uint16_t)(value) << (8U * ((index) % 2U) + 2U)), (8U * ((index) % 2U) + 2U), 2U))

/* Read current value of the XBAR_CONTROLx_EDGEx field. */
#define XBAR_RD_CTRLx_EDGEx(base, index)          (BME_UBFX16(XBAR_CTRLx_ADDR((base), (index)), (8U * ((index) % 2U) + 2U), 2U))

/* Set the CONTROLx_STSx field to a new value. */
#define XBAR_WR_CTRLx_STSx(base, index, value)    (BME_BFI16(XBAR_CTRLx_ADDR((base), (index)), ((uint16_t)(value) << ((8U * ((index) % 2)) + 4U)), ((8U * ((index) % 2)) + 4U), 1U))

/* Read current value of the XBAR_CONTROLx_STSx field. */
#define XBAR_RD_CTRLx_STSx(base, index)           (BME_UBFX16(XBAR_CTRLx_ADDR((base), (index)), (8U * ((index) % 2U) + 4U), 1U))

/* Instance numbers for core modules */
#define JTAG_IDX (0) /*!< Instance number for JTAG. */
#define TPIU_IDX (0) /*!< Instance number for TPIU. */
#define SCB_IDX (0) /*!< Instance number for SCB. */
#define CoreDebug_IDX (0) /*!< Instance number for CoreDebug. */

#endif /* __MKM14ZA5_EXTENSION_H__ */
/* EOF */
